{
    "0": {
        "text": "RT @daylonprochaska: The movement around bernie is, ideologically, something we haven’t seen in decades. With the climate crisis looming, w…",
        "date": "2019-12-07 17:55:04"
    },
    "1": {
        "text": "RT @pujanpatel_: Bernie is one of the only presidential candidates that cares about my voice, and the collective voice of the working class…",
        "date": "2019-12-07 17:46:22"
    },
    "2": {
        "text": "RT @israhirsi: Officially the youngest endorser for the campaign! #Bernie2020 https://t.co/AE8HrXkgTH",
        "date": "2019-12-07 17:46:10"
    },
    "3": {
        "text": "Young people across the country are leading a movement to end the school-to-prison and deportation pipelines. When we are in the White House, together we'll create supportive school communities for all students and end all forms of racial injustice and discrimination. https://t.co/C4TubAwosi",
        "date": "2019-12-07 17:43:41"
    },
    "4": {
        "text": "The time is long overdue for the U.S. government to stand with family farmers. If I am elected president, we will break up massive agriculture corporations and revitalize rural America. Join us live from Iowa Falls: https://t.co/qWSETL80mb",
        "date": "2019-12-07 17:23:40"
    },
    "5": {
        "text": "HBCU students have always led in the fight for justice, and we need their help to transform this country. Sign up to join our HBCU student organizing program before the deadline tomorrow: https://t.co/7l75jKfwtK #BernieForHBCUs https://t.co/LMw4lDZC4f",
        "date": "2019-12-07 17:08:38"
    },
    "6": {
        "text": "Many people are responding that they can't afford to get dental care. This is a major reason we need Medicare for All. Dental care is health care and Medicare for All covers it. https://t.co/OyfhL8mvek",
        "date": "2019-12-07 15:23:58"
    },
    "7": {
        "text": "Unions like @Teamsters know what's at stake.\n\nAs president, I will double union membership nationwide, end \"right-to-work\" laws by repealing section 14(b) of the Taft-Hartley Act, and impose a moratorium on multi-employer pension cuts.\n\nI will be your Organizer-In-Chief. https://t.co/E8p4qmFjUV",
        "date": "2019-12-07 13:28:03"
    },
    "8": {
        "text": "Campaign Manager @fshakir is live NOW with an update for our grassroots supporters and he’s bringing a SPECIAL GUEST. https://t.co/iwMp6a5jGq",
        "date": "2019-12-07 03:52:39"
    },
    "9": {
        "text": "Thank you to the postal workers of New Hampshire and NH-APWU for your support and for your tireless work to protect public postal services and lift up working people. Together we are going to strengthen the Postal Service and protect it from privatization.\nhttps://t.co/4e68JbGbyJ",
        "date": "2019-12-07 02:59:55"
    },
    "10": {
        "text": "Some campaigns give updates to their donors at closed-door fundraisers over hors d'oeuvres.\n\nOur campaign is a little different.\n\nLive tonight at 11 pm EST, campaign manager @fshakir will give another update for our grassroots supporters. And this time he'll have a special guest.",
        "date": "2019-12-07 02:45:00"
    },
    "11": {
        "text": "If I told you someone was attacking the country, you would not hear politicians say, “We have decades to deal with it.”\n\nThe major threat we are facing now is climate change.\n\nWe do not have decades to deal with it.\n\nWe need to pass a Green New Deal now.",
        "date": "2019-12-07 02:01:00"
    },
    "12": {
        "text": "We have introduced the most comprehensive climate change proposal by any candidate. Our Green New Deal will:\n\n✅Create 20 million jobs\n✅Transition us to 100% renewable energy\n✅Avert climate catastrophe https://t.co/RkqHQdt5MK",
        "date": "2019-12-07 01:20:00"
    },
    "13": {
        "text": "Instead of taking from the poor and giving to the rich, we need to do the exact opposite. \n\nWe need to end hunger in America and repeal the Trump tax breaks to the rich and the powerful.\n\nAs president, that's exactly what I intend to do.",
        "date": "2019-12-07 00:28:05"
    },
    "14": {
        "text": "Donald Trump’s food stamp rule is cruel, immoral and outrageous.\n\nAfter giving over a trillion dollars in tax breaks to the wealthiest people and most profitable corporations in America, no, Donald Trump, you do not take food out of the mouths of nearly 700,000 hungry Americans. https://t.co/HaAk3fB78y",
        "date": "2019-12-07 00:28:05"
    },
    "15": {
        "text": "Thousands of family farmers are forced off their land every year by big agribusinesses. It’s time the government had the backs of family farmers instead of doing favors for corporate agriculture monopolies. https://t.co/ooyAU1ORva",
        "date": "2019-12-07 00:05:00"
    },
    "16": {
        "text": "It would be outrageous for the @MLB to simply shut down 42 minor league teams around the country that are so important to their communities. This proposal must be stopped. https://t.co/8kv7WSAIN3",
        "date": "2019-12-06 23:31:54"
    }
}