{"0": {"text": "If you think it is too expensive to take care of our veterans, don't send them to war. https://t.co/yCLyUablN9", "date": "2019-11-11 19:16:04"}, "1": {"text": "On Veterans Day, let us renew our promise to returned service members by ending the injustices that too many of them face, such as homelessness, loneliness, and deportations. We must also strengthen the VA so that veterans and their families get the support they deserve.", "date": "2019-11-11 16:35:30"}, "2": {"text": "A retail worker who misses a shift because of an emergency can be fired on the spot. \n\nBut what happened when Gap's CEO oversaw sales and stock declines? He got a 33% pay raise and made $20 million a year—3,500 times more than his workers. Obscene. https://t.co/0xOVMMowtf", "date": "2019-11-10 21:14:33"}, "3": {"text": "RT @RepJimmyGomez: My bill — the For the 99.8% Act — would strengthen the #EstateTax to:\n\n▫️Narrow the #WealthGap\n\n▫️Limit the American ari…", "date": "2019-11-10 16:50:08"}, "4": {"text": "50 years ago, every dollar of an estate over $10 million was taxed at a rate of 77 percent. Since then, wealthy elites have worked to gut the estate tax—and inequality has exploded. \n\nOur job: Bring back this critical tool to stop the rise of oligarchy. https://t.co/FvBAbigj6e", "date": "2019-11-10 16:49:48"}, "5": {"text": "In the richest country in the world, no child should be poisoned by contaminated water coming through their faucet. What has gone on in Flint, where 30,000 kids have been exposed to neurotoxins, is a crime and an obscenity. https://t.co/xXghULqEYv", "date": "2019-11-09 15:56:47"}, "6": {"text": "We have got to join the rest of the developed world and abolish the death penalty. Too many innocent people, particularly people of color, get caught up in this unjust policy. A civilized society should not be involved in the murder of other Americans. https://t.co/366d0w3QZu", "date": "2019-11-08 23:05:20"}, "7": {"text": "Despite GOP efforts to sabotage health care for millions of Americans, the Affordable Care Act is still the law.\n\nSpread the word: You can sign up for health insurance today. Open enrollment runs until December 15. Go to https://t.co/abvyRmbFsY to choose a plan and get covered. https://t.co/KzprONt2fq", "date": "2019-11-08 19:09:17"}, "8": {"text": "RT @RepRoKhanna: Yemen is the world’s worst humanitarian crisis, and we have the power to end it. The moral urgency here has never been gre…", "date": "2019-11-07 21:57:31"}, "9": {"text": "Philadelphia police stopped 25,000 cars because they \"smelled marijuana.\" \n\n84% were African American drivers. They found marijuana only 12% of the time.\n\nOur job must be to end the War on Drugs—and get racial bias out of law enforcement at the same time. https://t.co/6luwr6TayC", "date": "2019-11-07 19:22:35"}, "10": {"text": "Seven decades ago, the British people put in place a system that treats health care as a human right. Today they live longer than Americans, infant mortality is lower, and they spend half of what we do on health care.\n\nIt’s time we join the rest of the industrialized world. https://t.co/5fwJZbLeaM", "date": "2019-11-07 13:32:13"}, "11": {"text": "Mr. Trump said he'd fight for a trade policy to help American workers. He said he'd lower the trade deficit. He lied: It's gone up.\n \nHis real agenda: Protect the profits of the pharmaceutical industry and make it easier for corporations to outsource jobs. https://t.co/pjqNDc7V51", "date": "2019-11-06 22:00:03"}, "12": {"text": "Nicole Smith-Holt’s son Alec died at 26 because he was rationing insulin that was too expensive. Every day, Americans are suffering and dying because of the greed of Big Pharma. We need to share these stories and stand together to fight back. https://t.co/O8o36i5Ljw", "date": "2019-11-06 19:59:25"}, "13": {"text": "Facebook has incredible power over the economy and our political life. It harvests the data of 228 million Americans and, over and over, uses this sensitive information in dangerous ways. What we need is vigorous antitrust action and to break Facebook up. https://t.co/Wawjlff1o6", "date": "2019-11-06 19:02:19"}, "14": {"text": "3.2 million more people are in poverty than official statistics show—how? Inflation is higher for the poorest than it is for the average person.\n\nThis is more evidence of what we already know: the economy is rigged and it benefits the wealthiest the most. https://t.co/bQuvDpuonX", "date": "2019-11-06 15:10:11"}, "15": {"text": "Now, thanks to the FCC under Mr. Trump, many Americans will only be able to choose from three huge corporations for their wireless service: Verizon, AT&amp;T, and T-Mobile.\n \nThis trend of unending corporate consolidation goes against the interests of consumers and our democracy. https://t.co/NCy2aPf3Um", "date": "2019-11-05 22:35:50"}, "16": {"text": "11,258 scientists from 153 countries came together to say: \"Scientists have a moral obligation to clearly warn humanity of any catastrophic threat and tell it like it is.\" \n \nIt's time we listen. Congress must declare a climate emergency and act boldly to protect our only home. https://t.co/zz6tbXDEG4", "date": "2019-11-05 20:41:37"}, "17": {"text": "Republicans all over the country are trying to make it harder for people of color, poor people, and older people to participate in our democracy. \n\nOur agenda:\n🗳️ Extend early voting\n🌃 Extend voting hours\n🇺🇸 Make #ElectionDay a holiday", "date": "2019-11-05 19:40:12"}, "18": {"text": "If Trump was serious about a solution to the horrendous conflict in Yemen, he would have signed our War Powers Resolution into law and ended illegal military support to the Saudis. Instead, he vetoed it. \n\nThousands of Yemeni children have died on his watch. https://t.co/tSNMJjwZL0", "date": "2019-11-05 18:13:53"}, "19": {"text": "Iran's resumption of work at Fordow is a concerning step. We had a deal in place that capped Iran’s nuclear program, which Trump recklessly violated. We should rejoin the JCPOA immediately and talk to Iran about other regional issues. https://t.co/nlMIqEjt67", "date": "2019-11-05 15:44:34"}, "20": {"text": "During his campaign, Trump said over and over again that he would stick it to the wealthy by closing the egregious carried interest loophole. Guess what? His disgraceful tax bill did nothing to address it and even Fox Business commentators are fed up with his broken promises. https://t.co/f6O1FJPzw7", "date": "2019-11-05 13:00:00"}, "21": {"text": "Secretary Pompeo, I hate to break it to you, but plunging the world in to a full-scale climate catastrophe is nothing to be proud of. https://t.co/rJlAEbLJnD", "date": "2019-11-04 21:48:53"}, "22": {"text": "Well, what do you know? One of the Wall Street ratings agencies complicit in the worst financial crash in modern history is warning of the dangers of bailing out students—not the crooks who run the big banks. \n \nThanks for the advice. But we are going to cancel all student debt. https://t.co/VFsygSmgy5", "date": "2019-11-04 17:26:51"}, "23": {"text": "Here’s an idea: How about an agenda that isn’t about corporate trade deals that sell out our workers, tax cuts for billionaires, and endless war? \n\nFor once let’s focus on dignity for the working class. Let’s create millions of good jobs to take care of each other and our planet. https://t.co/Tlk7D99Xpo", "date": "2019-11-04 14:40:21"}, "24": {"text": "☀️Solar—¢4.3/kWh\n💨Wind—¢4.2/kWh\n🛢Coal—¢10/kWh\n☢️Nuclear—¢15/kWh\n \nAs renewable costs fall, there is no technological obstacle to transforming our energy system to create millions of good jobs. What we need now is the political will for a Green New Deal. https://t.co/vlolJfwoyD", "date": "2019-11-03 20:10:53"}, "25": {"text": "RT @greenhousenyt: While Bezos bathes in money, remember at one Amazon warehouse in Pennsylvania,  temperatures sometimes soared to over 10…", "date": "2019-11-03 14:31:04"}, "26": {"text": "Trump is a good example that if you put your mind to it and work hard, you can betray just about every promise you make and deny every reality that exists. https://t.co/S5BX5Q4v81", "date": "2019-11-02 20:21:13"}, "27": {"text": "All of us can be a little forgetful sometimes. My Republican friends launched trillion-dollar wars and passed huge tax cuts for the rich. Then they ask why the deficit went up. https://t.co/T85zn4mCiU", "date": "2019-11-02 14:30:33"}, "28": {"text": "Congratulations to the UK’s grassroots activists for successfully banning fracking. We know fracking contaminates our water. We know it pollutes the air we breathe. We know it fuels climate change. \n\nTogether, we can—and we will—ban fracking in America, too. https://t.co/gDeEkK6yJl", "date": "2019-11-01 23:19:03"}, "29": {"text": "How do we pay for quality health care, guaranteed to all our people? Pretty simple, in my view. The way every other rich country does. #MedicareForAll https://t.co/etEl0V1wU6", "date": "2019-11-01 21:16:27"}, "30": {"text": "Since 2011, I opposed the KeystoneXL pipeline. I feared that more dirty tar sands oil infrastructure would lead to disastrous spills. \n\nAs 380,000 gallons of crude oil contaminate North Dakota's rural wetlands, we have got to say: Enough. It's time for a Green New Deal. https://t.co/wU5Zow8K0n", "date": "2019-11-01 20:01:31"}, "31": {"text": "What if the media told the American people every day that the richest 400 billionaires pay lower taxes than the middle class and the working poor? \n\nWhat if, when politicians say we must make do with less, the media admitted we're being played for suckers?https://t.co/eIodfu0Z1b", "date": "2019-11-01 16:10:01"}, "32": {"text": "I voted against the Patriot Act. It created an Orwellian system of mass surveillance. We must now end the NSA's unconstitutional data collection on hundreds of millions of calls. Intelligence agencies cannot unjustly surveil activists, Muslim Americans, and people of color. https://t.co/u0uO6caSOO", "date": "2019-11-01 14:50:25"}, "33": {"text": "I applaud @CTULocal1's teachers for achieving better pay, smaller class sizes, and more nurses and social workers in Chicago's schools. This is what solidarity is about—fighting for the whole community. \n \nWhen workers stand together, I have no doubt we will transform America. https://t.co/J0iGp3zb7n", "date": "2019-10-31 21:51:26"}, "34": {"text": "Jeff Bezos' income per day: $215 million\nFederal taxes Amazon pays: $0\nAmazon's spending to buy Seattle's City Council: $1.6 million\n\nThe only way we take back our democracy and end this obscene system of oligarchy is by standing up and fighting back. https://t.co/cL6DneCBzT", "date": "2019-10-31 19:42:04"}, "35": {"text": "RT @Ilhan: 45 Million                            Cancelling all \nAmericans                           $1.6 trillion\nwith student…", "date": "2019-10-31 18:36:50"}, "36": {"text": "Want to talk about clearing a low bar, Senator McConnell?\n\nHere's one: Explain to the 750,000 Kentuckians living in poverty why you won't put a $15 minimum wage bill on the Senate floor that would raise their wages and those of 39 million Americans. https://t.co/wDFJaOSgTM", "date": "2019-10-31 17:56:36"}, "37": {"text": "Mr. Trump, the American people read the call summary.\n\nThat is why the House is voting to proceed with an impeachment inquiry at this very moment. https://t.co/ISxYHnXrXe https://t.co/eM9frqpgq3", "date": "2019-10-31 15:21:49"}, "38": {"text": "RT @RoKhanna: There’s now $1.6 trillion in outstanding student loans &amp; many people are falling behind on payments, putting off major life d…", "date": "2019-10-31 03:36:31"}, "39": {"text": "En Chile, un presidente multimillionario impone austeridad mientras el ejercito reprime a los manifestantes. Miles han sido detenidos. Ante la historia de Chile, esto es peligroso. La solución es obvia aquí y en el mundo. Devuelve el poder donde debe estar: con la clase obrera.", "date": "2019-10-30 20:27:29"}, "40": {"text": "In Chile, a billionaire president pushes austerity while the military represses protesters. Thousands have been arrested. Knowing Chile's history, this is very dangerous.\n \nThe solution here and across the world is obvious. Put power where it belongs: with working people. https://t.co/s6J7kOtDXs", "date": "2019-10-30 20:03:36"}, "41": {"text": "Unions don't just mean better wages and benefits. Workers organize to protect each other from abusive bosses, harassment and discrimination. \n \nI stand in solidarity with these employees fighting for a fair workplace on behalf of all workers at NBC. https://t.co/TFAsbGmZPQ", "date": "2019-10-30 18:53:45"}, "42": {"text": "CEO-to-worker pay gaps:\n\nGap, Inc.: 3,566 to 1\nMcDonald's: 2,124 to 1\nDisney: 1,424 to 1\nWalmart: 1,076 to 1\n\nWhen the middle class is rebuilt, we will look back on this period in history and say, \"This was wrong. Why on Earth did we allow this kind of grotesque inequality?\"", "date": "2019-10-30 15:52:52"}, "43": {"text": "Looking for a paid internship? Apply to intern in the office of Senator Sanders here: https://t.co/EPSZUJsFvB", "date": "2019-10-30 14:58:44"}, "44": {"text": "I’m from Brooklyn. New York wouldn’t be one of the greatest cities in the world without the 40,000 transit workers @TWULocal100 who run the bus and subway systems. They keep New York moving and deserve a fair contract with good wages, benefits and job security. #TWURally2019", "date": "2019-10-29 21:24:06"}, "45": {"text": "The death toll in Yemen's war could grow to 230,000 by the year's end. Trump vetoed our bill to stop U.S. military involvement, but Congress can still prohibit it. And we must.\n \nI look forward to working with Armed Services Ranking Member Reed to end this humanitarian nightmare. https://t.co/rP44XCGVyA", "date": "2019-10-29 17:36:28"}, "46": {"text": "Access to a safe and legal abortion is a constitutional right. https://t.co/bD2J0ysQ6D", "date": "2019-10-29 16:33:08"}, "47": {"text": "Surviving a wildfire is like experiencing hell on Earth. If we know that climate change makes these fires more frequent and widespread, why aren't we working together to pass a Green New Deal? https://t.co/XLmBrMBmh2", "date": "2019-10-29 15:55:49"}, "48": {"text": "It’s been over 10 years since the federal minimum wage was raised to $7.25 an hour and over 100 days since the House passed the Raise the Wage Act. No American should be in poverty. Workers need a living wage. Mr. McConnell: do your duty and bring the bill to the Senate floor. https://t.co/MCB0EdZ1qp", "date": "2019-10-29 14:35:43"}, "49": {"text": "On #NationalImmigrantsDay, I am proud of our country for welcoming millions around the world seeking refuge from violence, racism and poverty—people like my father who came here from Poland at the age of 17.\n\nThis is the America that we must be. https://t.co/AufzoyGs0l", "date": "2019-10-28 19:59:34"}, "50": {"text": "This is what a climate emergency looks like. We must bring the full weight of the federal government to bear to help the people of California. We need to deal with the impacts that are already here and act decisively to prevent a much bigger catastrophe. https://t.co/Pmzw51rB4I", "date": "2019-10-28 16:26:15"}, "51": {"text": "RT @RepPressley: Community Health Centers play a critical role in fighting for health care justice for our most vulnerable communities. Thi…", "date": "2019-10-28 13:54:04"}, "52": {"text": "The time has come to fulfill and expand upon FDR’s vision that he laid out 75 years ago.\n\nThese are not radical ideas. They're supported by the majority of Americans. Working together, we can and must achieve economic, social, racial, political and environmental justice for all. https://t.co/95W1GygZn5", "date": "2019-10-28 12:35:18"}, "53": {"text": "Abu Bakr al Baghdadi was a murderer and terrorist responsible for terrible suffering and death. The fight against ISIS would not be possible without the brave efforts of the Kurds and other U.S. allies.", "date": "2019-10-27 16:42:34"}, "54": {"text": "African-Americans are almost 4 times as likely to have force used on them by police—this is unacceptable. The time is long overdue for us to end \"stop and frisk\" practices, demilitarize our police departments, and reform our racist criminal justice system. https://t.co/Wrw6o3Nsg8", "date": "2019-10-27 16:35:51"}, "55": {"text": "The richest 400 billionaires pay lower taxes than everyone else. In my view, this obscene inequality in wealth and political power is not compatible with a democratic society. I am proud to support the introduction of the For The 99.8% Act in the House by @RepJimmyGomez. https://t.co/DiLA5G1HgK", "date": "2019-10-27 12:02:00"}, "56": {"text": "How can we talk about problems of crime without mentioning that we have one of the highest rates of childhood poverty in the industrialized world? Building all the jails in the world will not make this right. https://t.co/H3In1bSUal", "date": "2019-10-26 18:57:44"}, "57": {"text": "Mr. President, this is the exact opposite of what halting endless war looks like. Congress has not authorized you to use our troops to secure Syria’s oil.\n\nRead the Constitution, Article I. https://t.co/viku9MF9HA", "date": "2019-10-26 12:30:00"}, "58": {"text": "I've said it before: Betsy DeVos is the worst Secretary of Education in modern history. Instead of standing up for victims of fraud, she is profiting off of them. Our country needs an advocate for students, not a billionaire working on behalf of predatory lenders. https://t.co/MKypqYzAUv", "date": "2019-10-25 15:40:01"}, "59": {"text": "Life-threatening diseases linked to Agent Orange are afflicting 83,000 veterans of the Vietnam War—and the White House refuses to cover their care. This is outrageous.\n \n@SenatorTester and I are demanding these veterans get the coverage they deserve now. No more excuses. https://t.co/mlbeMtZA9d", "date": "2019-10-25 14:53:58"}, "60": {"text": "It is unfortunate that Trump officials have to resign in order to shed light on the huge debt burden for students. We must cancel student loan debt—but not just some of it. All $1,675,469,158,747. https://t.co/TFWZ3vzR8n", "date": "2019-10-24 20:45:01"}, "61": {"text": "Right-wing extremists in every state and every branch of government have worked for decades to make it more and more difficult for women to access abortion. We cannot let them win. Abortion is a constitutional right that must be protected. https://t.co/SF9IdKju8x", "date": "2019-10-24 19:52:49"}, "62": {"text": "This major settlement will benefit the people of Vermont, who have been hurt and misled by opioid distributors like Reckitt. I am proud of our state’s Attorney General for taking the fight to the pharmaceutical industry, and winning. https://t.co/fAeYfFpDWK", "date": "2019-10-24 14:10:36"}, "63": {"text": "The average cost of 4-year college in the United States: $23,091 \nThe average cost of 4-year college in France: $212\n \nEducation is one of the keys to a successful democracy, so why are we making it so hard for our people to learn? https://t.co/c4dXRBZbow", "date": "2019-10-24 12:50:20"}, "64": {"text": "We are putting corporate America on notice: treat your workers with fairness and dignity.\n \nWhen workers strike and secure better wages and benefits, we embolden workers everywhere to stand up and fight too.\n \nThis is how we rebuild our middle class. https://t.co/h9musUeGb9", "date": "2019-10-24 00:29:35"}, "65": {"text": "RT @KtreeThomas: Nah. First step is to tax you to pay for a rapid transition away from fossil fuels to renewables. Next step is to prosecut…", "date": "2019-10-23 22:05:51"}, "66": {"text": "Let’s be absolutely clear about what Republicans are doing by adding new paperwork and requirements to Medicaid: they are attacking the poor and threatening lives. https://t.co/zKAzcpy4vo", "date": "2019-10-23 18:18:52"}, "67": {"text": "President Trump announced he will keep troops in Syria to protect oil fields. Last I checked, Congress never authorized U.S. forces to be deployed to secure Syria’s economic resources. Putting U.S. forces in harm’s way for this purpose is illegal and unconstitutional. https://t.co/zagOw99YEd", "date": "2019-10-23 16:39:31"}, "68": {"text": "It is completely unacceptable for a quid pro quo regarding personal political goals to determine the conduct of U.S. foreign policy.\n \nThe House should continue its impeachment inquiry and expose the full nature of the most corrupt presidency in modern history. https://t.co/mPn4NJvk7J", "date": "2019-10-23 15:27:45"}, "69": {"text": "Big surprise: the president is a liar. Far from \"ending the endless wars,\" Mr. Trump has ended no wars and deployed more troops to the Middle East. https://t.co/IFo6rNzfc3", "date": "2019-10-23 12:19:58"}, "70": {"text": "The Arab Spring rose up to fight corruption, repression, inequality and austerity. The Lebanon and Iraq protests show this spirit is still very much alive. If we want a progressive future, we need to build up a global movement of and for working people. https://t.co/KTheQouKK8", "date": "2019-10-22 21:52:32"}, "71": {"text": "RT @civilrightsorg: We agree, @SenSanders. It’s past time for @senatemajldr McConnell to bring up the #RaiseTheWage Act.\n\nRemember: A natio…", "date": "2019-10-22 19:03:53"}, "72": {"text": "No, Mr. Trump. “Lynching” was a campaign of racial terror by white supremacists who murdered thousands of African-American men, women, and children. If you are nervous about an impeachment process, then you should not have violated the Constitution. https://t.co/jSBLJ2ZAIt", "date": "2019-10-22 18:19:31"}, "73": {"text": "I think it is pretty sick to knowingly sell a product that will destroy the planet and our children's futures, but that is the mindset of a fossil fuel billionaire. It's time for a Green New Deal and an end to this disease of lying for profit. https://t.co/rAkkdbyTfa", "date": "2019-10-22 17:33:26"}, "74": {"text": "It turns out that when you put people over profits, society is better off. https://t.co/bLGxJegzLI", "date": "2019-10-22 16:23:20"}, "75": {"text": "In one of the wealthiest countries in the history of the world, no one should be in poverty. The current $7.25 an hour federal minimum wage is a starvation wage and must be increased to a living wage of $15 an hour. \n\nTime for the Senate to do its job and take a vote. https://t.co/Y8BKypQ1Q4", "date": "2019-10-22 11:15:00"}, "76": {"text": "Congratulations to the Burlington High School women's soccer team on taking this courageous step. I myself am a baseball fan, but no matter the sport, I hope all fans and athletes can agree on this: Equal pay for equal work, full stop. https://t.co/YUGKIfVsQy", "date": "2019-10-21 23:13:46"}, "77": {"text": "The Supreme Court just allowed Michigan to continue gerrymandering districts to benefit Republicans.\n\nOur job: Fight back. Expand voter turnout. Make state legislatures and courts end partisan gerrymandering. Overturn Citizens United. Create a vibrant democracy. https://t.co/KHTpy5I2y8", "date": "2019-10-21 18:19:17"}, "78": {"text": "Mr. Trump's NAFTA 2.0 will not stop the outsourcing of jobs I warned against on the picket lines in 1993.\n\nWe need a trade policy that ends the race to the bottom, not another one of Trump’s corporate giveaways. https://t.co/6iPZZEbM0Y", "date": "2019-10-21 13:45:36"}, "79": {"text": "For vulture fund CEO Paul Singer, it seems having $3.5 billion is not enough. He is now trying to profit from taking AT&amp;T workers' jobs, wages and benefits. \n\n@RoKhanna and @CWAUnion are right. We must tell the Paul Singers of the world: Enough is enough. https://t.co/L3ZQZ6iri8", "date": "2019-10-20 20:37:41"}, "80": {"text": "\"School lunch debt\" is not a phrase that should exist.\n\n@Ilhan and I want to eliminate all of it. https://t.co/icVLKvjhIF", "date": "2019-10-20 17:44:32"}, "81": {"text": "RT @Ilhan: Universal school meals programs act will:\n🚫End denying children meals\n✅Wipe out school meal debt\n📈Increase reimbursement rates t…", "date": "2019-10-19 19:09:05"}, "82": {"text": "This American woman experienced what it's like to have universal health care in the UK, and guess what? Now she doesn't want to move back to the United States. https://t.co/bPNAu7jLAV", "date": "2019-10-19 17:13:16"}, "83": {"text": "Imagine cancelling all student debt and making every public college tuition-free, so that the rich aren't vacationing off the backs of struggling students. \n \nNow stop imagining. Let's tax Wall Street and do it. https://t.co/7CO8qP6u4V", "date": "2019-10-19 12:00:00"}, "84": {"text": "Billy Foister was one of 125,000 Americans toiling in Amazon's warehouses for Jeff Bezos—a billionaire who makes $150,000 per minute. Just sickening. @OSHA_DOL must launch a comprehensive investigation now. https://t.co/ftW0Nv8iS3", "date": "2019-10-18 17:19:46"}, "85": {"text": "Purdue Pharma used its wealth, power, and army of lawyers to bully West Virginia officials and get away with murder. \n\nWho has to live with the consequences of opioid executives' greed? Thousands of innocent kids now in foster homes and emergency shelters. https://t.co/sf2ftYhMYE", "date": "2019-10-18 16:53:10"}, "86": {"text": "If we make lunch free for all kids, kids do better in school. It’s as simple as that. To ensure that all kids are prepared to be successful, now is the time to make all school meals universal. https://t.co/X1aQlvWhnu", "date": "2019-10-18 14:21:27"}, "87": {"text": "Congratulations to our neighbors to the north on completing their first year of marijuana legalization! Vermont shares a border with Canada, and as far as I can tell, the sky has not fallen and the cities have not plunged into anarchy on the other side. https://t.co/O5qnBHrwCZ", "date": "2019-10-17 21:11:47"}, "88": {"text": "If we do not pass a Green New Deal, Mr. Trump's resort is likely to be swallowed by sea-level rise before the century ends because of catastrophic climate change.\n\nMaybe when it is underwater he'll have a harder time calling global warming a \"hoax.\" https://t.co/Km8T4Yb6mY", "date": "2019-10-17 18:24:31"}, "89": {"text": "“How can we afford it?”\n\nIt’s a question critics ask any time I propose a bold new program like College for All. The answer in this case is very simple: with a small fee on Wall Street that will end reckless financial speculation. https://t.co/6yUXktQiRx", "date": "2019-10-17 17:26:56"}, "90": {"text": "Through our efforts to make prescription drugs affordable and expand dental care, I saw how committed he was to a more compassionate, humane society. He will be sorely missed. Our thoughts are with his family today.", "date": "2019-10-17 14:29:54"}, "91": {"text": "Jane and I are deeply saddened by the loss of our good  friend, Rep. Elijah Cummings. I was honored to work closely with him over the years. His integrity and moral vision for his community and the country were extraordinary.", "date": "2019-10-17 14:29:54"}, "92": {"text": "The greed of opioid manufacturers has taken hundreds of thousands of lives, and the epidemic they created cost us $631 billion over the past four years alone.\n\nNow they're cutting a deal to pay $18 billion for their wrongdoing. Outrageous. https://t.co/fz0KnZrsah", "date": "2019-10-16 21:08:58"}, "93": {"text": "Let us be very clear: Medicare for All will boost pay and benefits for workers across this country. That's why unions are organizing to get rid of corporate greed in our health care system. \n \nThank you, @RepJayapal and @RepDebDingell, for your strong leadership in this fight. https://t.co/5alC6hcF6V", "date": "2019-10-16 18:46:30"}, "94": {"text": "In our system of government, Congress alone controls government spending. And we did not give Trump the money to waste on his damn wall. \n\nI say this with no great pleasure, but we have a President of the United States who has not read, or does not understand, the Constitution. https://t.co/MWUrSMKAsu", "date": "2019-10-16 15:35:22"}, "95": {"text": "The ecological crisis has gotten worse and worse, decade after decade, and yet the corporate media still refuse to take it seriously.\n\nWe will not bring about the political change needed to tackle the climate emergency until we address this. https://t.co/6MIbAu8izH", "date": "2019-10-16 15:02:57"}, "96": {"text": "RT @Ilhan: It's true! \n\n@SenSanders and I just introduced sweeping legislation to make school meals universal.\n\nIn the richest country in t…", "date": "2019-10-15 22:42:31"}, "97": {"text": "@Ilhan 75% of school districts have unpaid student meal debt. This bill will:\n\n✅ Prohibit school lunch programs from denying children hot meals\n✅ Wipe out existing delinquent meal debt and stop harassment of families\n✅ Increase reimbursement rates to schools for meal preparation", "date": "2019-10-15 22:25:52"}, "98": {"text": "I am proud to unveil, with Rep. @Ilhan Omar, a bill to ensure that every child in America has access to school meals.\n\nIn the richest country in the history of the world, we must not tolerate the obscenity of kids going hungry while they're trying to learn. https://t.co/UnBhOW1cDd", "date": "2019-10-15 21:56:47"}, "99": {"text": "RT @RepRoKhanna: You know it’s a worthy cause when @SenSanders, @SamanthaJPower, and @MarkRuffalo are all fighting for it #YemenCantWait.\nh…", "date": "2019-10-15 17:10:23"}, "100": {"text": "The national security experts who led this letter are exactly right: Congress must block taxpayer dollars from funding this illegal war. We have a chance to not only end the suffering of Yemenis, but ensure that America is never again embroiled in another unconstitutional war. https://t.co/d7qZMhpXLE", "date": "2019-10-15 14:59:20"}, "101": {"text": "I applaud Ecuador’s Indigenous-led grassroots movements who stood up to repression and blocked the IMF's austerity agenda. \n\nEconomic elites keep pushing austerity worldwide, making life unbearable for working people. The U.S. should stop supporting this. https://t.co/9DIY4Q1Rpk", "date": "2019-10-14 21:31:55"}, "102": {"text": "I don't accept people hiding behind the American flag to give tax breaks to the rich and throw billions upon billions of dollars at the military-industrial complex. Who is patriotic and who is not? It's an interesting question. https://t.co/aOPJuXBU1B", "date": "2019-10-14 16:37:47"}, "103": {"text": "Trump is working to:\n• enable corporate tax evasion\n• let factories dump toxic chemicals into wetlands\n• limit food inspections \n• collect debt from defrauded students\n• increase car pollution\n\nThis is the most corrupt presidency in modern history.  https://t.co/KmpFQsbzQZ", "date": "2019-10-13 23:12:54"}, "104": {"text": "This phony “anti-war” president vetoed our bill to get American troops out of the illegal war in Yemen. He has ignored Congress’s power to declare war. He’s spent years intensifying Middle East conflicts without giving a damn about the Constitution.\n\nTrump is a liar and a fraud. https://t.co/MOWv5nqHEp", "date": "2019-10-13 14:34:06"}, "105": {"text": "When I reflect on how this country passed Social Security in 1935 and Medicare in 1965, I think about how much poverty and suffering we ended.\n\nOur next step is Medicare for All. When we succeed, future generations will appreciate how we made health care a human right in America.", "date": "2019-10-13 12:05:00"}, "106": {"text": "Some argue that the U.S. is not really engaged in hostilities in Yemen. But when Yemenis see \"Made in USA\" on the bombs killing their children, it’s very clear that the United States is part of this horrible war. This must end. https://t.co/34uUe6uG14", "date": "2019-10-12 20:14:38"}, "107": {"text": "@workerism This is exactly right. Wage theft is a crime and workers should stand up to it. We need a powerful labor movement to end the obscenity of businesses robbing billions of dollars from their own employees every year.", "date": "2019-10-12 19:28:42"}, "108": {"text": "Inequality is at a 100-year high. 400 billionaires pay lower taxes than fast-food workers. Wages have gone nowhere.\n \nThe power elite need to come clean. Admit to the American people that the trickle-down economics you've sold us for 40 years is a racket. https://t.co/fzmB8vbCfC", "date": "2019-10-12 14:24:12"}, "109": {"text": "Very proud of Vermont and other jurisdictions for leading the way. This is a critical victory for immigrants across the United States, who should never have to fear risking their status in order to access basic services. https://t.co/W1mWmoHX68", "date": "2019-10-11 20:48:16"}, "110": {"text": "Remember when Donald Trump tweeted that he was \"trying to end the endless wars?\" That was yesterday. \n\nToday he's sending thousands of troops, warplanes, and missiles to his dictator friends in Saudi Arabia to escalate military tensions with Iran. https://t.co/3OuxvgRwDf", "date": "2019-10-11 17:16:39"}, "111": {"text": "Trump's Pentagon is run by a former Raytheon lobbyist. So of course an official who successfully eliminated billions in Pentagon waste and abuse was forced out. \n\nIt's time to slash our bloated military budget and use the savings to solve real human needs. https://t.co/vB8DpSJCWP", "date": "2019-10-11 16:40:54"}, "112": {"text": "Climate strikers, led by our young people, are on the march for environmental justice. They are changing our national conversation and building an unstoppable movement. Together, we will transform this country and pass a Green New Deal. https://t.co/IowCGiORYd", "date": "2019-10-11 13:37:20"}, "113": {"text": "I believe decent housing, good health care, and a quality education are human rights that everyone should have. \n\nUnder our ruthless economic system, they are commodities whose costs keep rising as Americans’ wages stagnate. \n\nThis is why we fight. https://t.co/316UwW8sm7", "date": "2019-10-10 23:35:59"}, "114": {"text": "Think of the alternative to these power outages and intense wildfires if America tackles climate change. \n\nWe can build a smart, safe, and modern electrical grid that gives every American access to clean, cheap, and reliable energy from renewables. https://t.co/DYEUr1CWnz", "date": "2019-10-10 20:54:37"}, "115": {"text": "Almost half of all Americans will experience a mental illness during their lifetime. We have to take care of one another. In the wealthiest nation in the world, all of us, regardless of income, should have access to mental health care as a right. #WorldMentalHealthDay", "date": "2019-10-10 18:18:44"}, "116": {"text": "I noticed, and I'm pretty damn sure patients with breast cancer and their families will notice too. https://t.co/hMNhX8pRAj", "date": "2019-10-10 15:19:04"}, "117": {"text": "I have long believed that democracy isn't just voting every four years—it’s about ordinary people creating community, engaging in the political process together, and building powerful grassroots movements to achieve progressive change. And that’s exactly what we’re doing. https://t.co/byLcBX7WAB", "date": "2019-10-10 13:59:34"}, "118": {"text": "Congress must assert its important responsibility over foreign policy and serve as a check on this unstable president.", "date": "2019-10-09 22:21:16"}, "119": {"text": "This is not a case of sending American troops there. They are already there and Trump is withdrawing them, giving the Turkish Army permission to invade.\n\nKurdish fighters have fought and died in our joint effort to eliminate ISIS. They should not be abandoned in this way.", "date": "2019-10-09 22:21:16"}, "120": {"text": "I condemn Trump's reckless decision to abandon our Kurdish allies to their fate at the hands of Turkish President Erodogan.\n\nThe President of the United States should not make significant national security decisions impulsively, by tweet, after a single phone call. https://t.co/WvY6U4HVo6", "date": "2019-10-09 22:21:15"}, "121": {"text": "In America today, we are overpaying for subpar health care. Why? Corporate greed.\n\nMedicare for All would save both dollars and lives. It is time that we finally join every other major country in the world and guarantee health care for all. https://t.co/COzXN5hrtm", "date": "2019-10-09 21:05:43"}, "122": {"text": "RT @RepRoKhanna: The author of this study works for Humana, one of the biggest health insurers. They still found that over $200 billion is…", "date": "2019-10-09 17:44:24"}, "123": {"text": "I say, with @MrDannyGlover, to Trump: We will not let you destroy a generational source of good, unionized jobs for the African-American community. We should modernize and expand the U.S. Postal Service to offer basic banking solutions—not privatize it. https://t.co/qcyYj79b7u", "date": "2019-10-09 12:00:01"}, "124": {"text": "RT @IlhanMN: “This body of data suggests the aftershocks of the financial crisis in 2008 are still present in many Americans’ minds, and th…", "date": "2019-10-08 20:16:33"}, "125": {"text": "I applaud the activists whose efforts led the Trump Organization to cancel this event. Anti-Muslim bigotry has no place in American political life. https://t.co/TyUAKPmfhL", "date": "2019-10-08 18:58:39"}, "126": {"text": "Think of how broken our economic system is. A warehouse worker whose bathroom break goes too long gets threatened with being fired. \n\nA typical consequence for a CEO who runs a corporation to the ground? Millions of more dollars in salary and bonuses. https://t.co/a1iurMfQp3", "date": "2019-10-08 17:15:19"}, "127": {"text": "If the Supreme Court wants to be on the right side of history, it must recognize that transgender people are entitled to the same civil and human rights as everybody else. Period. https://t.co/epbJICyt04", "date": "2019-10-08 13:25:57"}, "128": {"text": "RT @jwjnational: The power and strength of the mostly Somali women leading protests at an Amazon warehouse in Minnesota is amazing. They ar…", "date": "2019-10-07 19:50:27"}, "129": {"text": "We now know the richest 400 Americans have rigged the system to pay lower taxes than everyone else in the country.\n\nThe question of our time is this: will we tolerate it? Or will we take back our democracy from the oligarchs who run this country? https://t.co/wn4DbztrTA", "date": "2019-10-07 15:08:22"}, "130": {"text": "I have long believed the U.S. must responsibly end our military interventions in the Middle East. But Trump’s abrupt announcement to withdraw from northern Syria and endorse Turkey’s incursion is extremely irresponsible. It is likely to result in more suffering and instability. https://t.co/a4Wi5RYFuC", "date": "2019-10-07 13:28:26"}, "131": {"text": "I am glad to be home in Burlington to rest for a little bit. I want to thank all of you for your well wishes, love, and support over the week. I am recovering well and feeling much better. \n\nI am more determined than ever to fight alongside you to make health care a human right.", "date": "2019-10-06 20:49:09"}, "132": {"text": "RT @RBReich: .@SenSanders has long been an advocate for systemic change, w/ bold proposals like imposing a wealth tax on billionaires.\n\nThe…", "date": "2019-10-01 20:58:25"}, "133": {"text": "Fast-food workers too often face starvation wages and unjust working conditions. Forming a union is the best way to give workers a voice to get fair treatment from billion-dollar corporations.\n\nI support the workers leading the fight for $15 and a union.\nhttps://t.co/OEGfAUp057", "date": "2019-10-01 19:55:51"}, "134": {"text": "For over a year, Haitians have demonstrated against government corruption and rising costs. As protests grow, I am concerned about increased violence. Using live ammunition against protesters and journalists violates basic human rights and is unacceptable. https://t.co/sKuetplcSK", "date": "2019-10-01 17:50:08"}, "135": {"text": "This ruling threatens to give more power to unaccountable companies like AT&amp;T, Comcast and Verizon over what we see and do on the internet. \n\nWe must fight to keep the internet free and open—not dominated by corporations. This struggle is essential to free speech and democracy. https://t.co/9xZGpt7rpK", "date": "2019-10-01 15:47:42"}, "136": {"text": "The American people are not falling for billionaires' anti-worker propaganda. Support for unions is near a 50-year high. \n\nMore unions will rebuild the middle class, combat corporate greed, and ensure that workers get their fair share. The labor movement makes our country strong. https://t.co/tQdaWvGKs8", "date": "2019-10-01 13:18:40"}, "137": {"text": "The greed of Goldman Sachs, JPMorgan, Citigroup and BlackRock is insatiable. Who cares if the Saudis are starving millions of Yemeni civilians or that our planet faces a climate emergency? Profiting off of $1.5 trillion in Saudi oil is just too important. https://t.co/y83lIFqXlV", "date": "2019-09-30 22:53:54"}, "138": {"text": "CEOs say they want to make a social impact. Here's a way to do that: Instead of making 300 times more than their employees, maybe they should raise workers' wages and try getting by on 30 times more. Top CEOs in America did this not so long ago and somehow managed to survive. https://t.co/iyZkzOCxXX", "date": "2019-09-30 19:33:22"}, "139": {"text": "A Green New Deal isn't just about the climate—it is about preventing hunger and illness. The time for incremental change has passed. We must fight to rapidly transform our energy system. https://t.co/EiflnYD8Vz", "date": "2019-09-30 13:48:29"}, "140": {"text": "Alec Smith died at 26 because he was rationing insulin that was too expensive. Corporate greed is taking the lives of Americans and it needs to end now. https://t.co/VSoJnG6U9b", "date": "2019-09-29 17:00:00"}, "141": {"text": "Tax Wall Street and cancel it. https://t.co/sszBjINLUN", "date": "2019-09-29 14:45:26"}, "142": {"text": "This behavior toward @RepJayapal as she performed her House duties is unacceptable. \n\nI voted against creating ICE because I feared the agency and its leaders would act with impunity. We need an immigration system that respects human rights and Congress's oversight authority. https://t.co/TaGzzwFJ1m", "date": "2019-09-28 22:50:19"}, "143": {"text": "We have got to get to the bottom of this. The American people have a right to know what deals Trump might be making with the murderous Saudi dictator that he loves so much. https://t.co/UrbPL6FfzD", "date": "2019-09-28 20:58:08"}, "144": {"text": "This is what a rigged economy looks like: While labor productivity has more than doubled since the late 1960s, nearly half of all new income since 1993 has gone to the top 1 percent.\n\nMeanwhile Americans continue to work some of the longest hours on earth. https://t.co/4DFImeIyoM", "date": "2019-09-28 20:01:38"}, "145": {"text": "The undemocratic fiscal control board of Puerto Rico is still working hand in hand with Wall Street, with a plan for more austerity and slashed pensions. The board must stop dictating Puerto Rico’s economic decisions and let the people decide their future. https://t.co/pon8S2cap1", "date": "2019-09-28 13:09:27"}, "146": {"text": "RT @RoKhanna: There are almost no communities in the U.S. where you can work 40 hours per week at minimum wage and afford a one bedroom apa…", "date": "2019-09-28 12:49:49"}, "147": {"text": "Today, millions of climate strikers, led by a global youth movement, showed politicians around the world that the demand for environmental justice is not going away. It is only growing stronger. Together, we will pass a Green New Deal. https://t.co/ihsUcmNYd0", "date": "2019-09-28 00:06:15"}, "148": {"text": "Mr. Trump made a series of disastrous choices this week—decisions that tear at the fabric of what this country is about. This is one of them. We must not turn our backs on refugees fleeing horrific violence and persecution around the world. https://t.co/crmiWqWabz", "date": "2019-09-27 21:08:13"}, "149": {"text": "This Republican mayor leads the first city in Texas powered by 100% renewable energy. Addressing climate change and creating millions of good-paying jobs in the process should not be a partisan issue. https://t.co/5kk5iA1Jws", "date": "2019-09-27 17:22:23"}, "150": {"text": "Make no mistake about it: Canceling student debt is an act of social, racial and economic justice. https://t.co/MV6OnPH6RD", "date": "2019-09-27 13:59:36"}, "151": {"text": "It is the right of all people to protest for a better future. The Egyptian government should refrain from violence against protesters exercising this right. The world is watching. https://t.co/KAWIuBTuLK", "date": "2019-09-27 00:35:16"}, "152": {"text": "Inequality in America is at its worst level in more than 50 years. Maybe—just maybe—it's time we start taxing the super-rich to ensure human rights for all Americans: housing, health care, education, retirement, good jobs, and a livable planet. https://t.co/TIanMupibp", "date": "2019-09-26 20:18:19"}, "153": {"text": "As a corporate lawyer and lobbyist, Eugene Scalia made millions working for Chevron, Goldman Sachs, Facebook and other huge corporations, helping them undermine health and safety regulations. \n \nSo naturally he's Trump's pick to lead the Labor Department. Obscene. https://t.co/KDx4M6EN4B", "date": "2019-09-26 19:00:46"}, "154": {"text": "Medicare for All will lower overall health care costs. Meanwhile:\n\n📈Family premiums are up 54%—$20,000 a year\n📈Deductibles up 162%—$1,655 a year\n\nBut I'm sure the American people getting robbed blind by the insurance industry are just thrilled these costs aren't called \"taxes.\" https://t.co/XoCBEN7OWf", "date": "2019-09-26 18:01:25"}, "155": {"text": "There is a metaphorical wildfire happening in our oceans that will devastate our planet’s marine ecosystems and coastal communities. We must immediately take aggressive action to address this global emergency before it is too late. https://t.co/mrVvYEUi9c", "date": "2019-09-26 15:09:37"}, "156": {"text": "Trump's cruelty and xenophobia never stops: ICE wants to send women and moms back to a for-profit detention center where there is a pattern of suicide and abuse. I support the efforts of @RAICESTEXAS and other organizers to prevent this from happening. https://t.co/PiGFHUEKwG", "date": "2019-09-26 12:20:52"}, "157": {"text": "The President has left the House of Representatives no choice but to begin an impeachment inquiry. I believe impeachable offenses were committed, and the House will now lay out the case. No president is above the law, and it is our responsibility to safeguard the Constitution.", "date": "2019-09-25 21:16:58"}, "158": {"text": "Trump is depriving 500,000 kids of their school lunches for no damn reason—even after 139 members of Congress warned him not to. \n\nI cannot begin to understand the casual cruelty that motivates Trump and his billionaire friends to harm vulnerable children like this. https://t.co/XhTZrgNS37", "date": "2019-09-25 20:38:01"}, "159": {"text": "The White House sent us their talking points around President Trump’s Ukraine call.\n\nFor some strange reason, they forgot to mention that Mr. Trump said, “I would like you to do us a favor though” after Zelensky brought up military aid. https://t.co/60PMZ6aKcv", "date": "2019-09-25 17:12:18"}, "160": {"text": "RT @AOC: Did you know our Fed poverty line is based on 1955 spending, &amp; the way we calculate it hasn’t changed since 1964?\n\nIt assumes 1 ea…", "date": "2019-09-25 16:17:25"}, "161": {"text": "A message to Wall Street: We will investigate your corruption. We will not let you cut the schools, hospitals and pensions that the Puerto Rican people need to live with dignity and recover from Hurricane Maria. https://t.co/9Rqvy5EqnU", "date": "2019-09-25 14:39:25"}, "162": {"text": ".@AOC and I stand with the Puerto Ricans who flooded into the streets to demand democratic control over their lives. \n \nPuerto Rico's working families have suffered enough austerity. It's time to impose some austerity on the banks destroying the island. https://t.co/qEOQ481FFT", "date": "2019-09-24 20:41:46"}, "163": {"text": "When Mr. Trump blames immigrants for crime, he spreading a racist lie.\n\nInstead of frightening 11 million undocumented people with deportation, we need comprehensive immigration reform and a path to citizenship. https://t.co/AIC1fOk31n", "date": "2019-09-24 15:08:13"}, "164": {"text": "While Trump and the GOP cut taxes for the top 1%, they want to return us to a time when workers could not engage in collective bargaining.\n \nUnions are the backbone of America's middle class. Graduate student workers must have the right to join a union and earn a living wage. https://t.co/TzPEoVj5Jd", "date": "2019-09-23 23:01:00"}, "165": {"text": "What a disgrace that it takes a 16-year-old to tell world leaders what they won't acknowledge: We cannot continue with this type of ruthless capitalism that is destroying our planet. This is why we need young people leading our climate justice movement. https://t.co/uKpMUc2CMw", "date": "2019-09-23 18:56:09"}, "166": {"text": "Today is Native American Women’s Equal Pay Day, which marks how long a Native woman has to work into 2019 to catch up to the same amount a white man made in 2018. We must continue the fight for pay parity. This is not a radical issue, this is an issue of fairness and justice. https://t.co/uWRnc1KUXc", "date": "2019-09-23 17:11:28"}, "167": {"text": "General Motors made $11 billion last year. Their CEO was paid $22 million, nearly 300 times as much as their median worker.\n\nThe workers who make GM’s success possible deserve health care and good wages. I know which side I'm on. https://t.co/jGjaexShcv", "date": "2019-09-23 14:33:04"}, "168": {"text": "Trump calls Egypt's Sisi his 'favorite dictator.'\n\nI believe the United States should stand for human rights, especially with governments that receive large amounts of US aid, as Egypt does. All people have the right to protest for a better future. Sisi should respect that right. https://t.co/EP7DccjTMU", "date": "2019-09-22 19:18:27"}, "169": {"text": "Dwight D. Eisenhower was not a radical socialist—he was a Republican. And in 1961, he tried to warn us about the \"military industrial complex.\" https://t.co/WLbZ9U6NFG", "date": "2019-09-22 16:02:18"}, "170": {"text": "I am proud to stand with these civil rights organizations. In the fight for marijuana legalization, we must prioritize racial and economic justice—that means revenues from this industry must be invested in the communities that have been devastated by the so-called \"war on drugs.\" https://t.co/5IGh53QI7j", "date": "2019-09-21 15:23:47"}, "171": {"text": "What gives me hope right now is this new generation of young people who dream big and do not want to settle for the status quo. #ClimateStrike https://t.co/wPEl9KGKds", "date": "2019-09-20 22:25:00"}, "172": {"text": "More than 1,000 Amazon employees have courageously challenged the richest man in the world over Amazon's massive carbon footprint—and they have already achieved results. I want to thank them and workers around the world who are walking off the job today for climate justice. https://t.co/cBrfwbtyI6", "date": "2019-09-20 21:23:06"}, "173": {"text": "For too long, the mainstream media has ignored science and given a platform to climate change deniers. I am glad they are finally starting to give this issue the attention it deserves, and I am calling on them to continue shedding light on the seriousness of this global crisis. https://t.co/thGMt6MKZs", "date": "2019-09-20 19:43:41"}, "174": {"text": "It is unconscionable that amid global climate protests, tech giants like Microsoft are announcing major partnerships with Big Oil.\n\nWe must hold them accountable, demand they break ties with the fossil fuel industry, and move rapidly to sustainable energy. https://t.co/GZb38RbiCE", "date": "2019-09-20 17:57:23"}, "175": {"text": "RT @KellyMarx_: Just getting to the climate march in DC, it’s an hour before we begin and there are thousands here.\n\nWe’re here to #Climate…", "date": "2019-09-20 16:04:01"}, "176": {"text": "RT @nowthisnews: July 2019 was the hottest month ever recorded #ClimateStrike https://t.co/gHxYd13wl1", "date": "2019-09-20 16:03:03"}, "177": {"text": "Young people have already demonstrated they can take on powerful fossil fuel companies and force politicians to answer their call to action. To the millions of young people and allies worldwide who are striking today to demand climate justice: I stand with you. #ClimateStrike https://t.co/MzNXI4XIjK", "date": "2019-09-20 14:21:48"}, "178": {"text": "As thousands of people take to the streets today to demand bold climate change solutions, people in Texas are facing serious flooding. Our thoughts are with the people in southeast Texas. We will do everything we can to help those communities recover. https://t.co/NWPRPIqMgq", "date": "2019-09-20 13:20:49"}, "179": {"text": "Two years ago, Hurricane María—fueled by climate change—devastated Puerto Rico and the U.S. Virgin Islands.\n \nOur message for the people of those islands: you are not forgotten. We will fight for you, as American citizens, to fully rebuild for a sustainable and resilient future. https://t.co/I9QxwY1kxY", "date": "2019-09-20 00:10:24"}, "180": {"text": "99% of applications for loan forgiveness in this program are being rejected. The Department of Education is failing our public service workers and students.\n \nOur job:\n- Stand up to Betsy DeVos and the predatory lenders\n- Cancel student debt and make public colleges tuition-free https://t.co/dyewD2ucYL", "date": "2019-09-19 21:14:46"}, "181": {"text": "A U.S. airstrike was intended for ISIS, but killed 30 Afghan civilians. This is just one of the horrors of endless war. ISIS did not even exist when America invaded Afghanistan 18 years ago.\n \nWe need to end our longest war and bring our troops home. https://t.co/qYWMcn4agZ", "date": "2019-09-19 19:37:02"}, "182": {"text": "Think of how corrupt our political and economic system truly is. Instead of worrying about jail time, the billionaire culprits of America's opioid crisis have the audacity to ask for millions in bonuses for their top employees.\n\nWe need a political revolution in this country. https://t.co/7q4RyysQ4t", "date": "2019-09-19 15:58:07"}, "183": {"text": "Ady is fighting two difficult battles at once: one against the horrific disease of ALS, and another against the insatiable greed of the insurance and drug companies. When we pass Medicare for All, it will be because of heroes like him who stood up and fought back. https://t.co/u2seGRqs3o", "date": "2019-09-19 13:55:00"}, "184": {"text": "RT @SenateDems: Last night, more than 20 Senate Democrats held the Senate floor to demand action on gun violence. \n \n93% of Americans suppo…", "date": "2019-09-19 02:14:21"}, "185": {"text": "This is why we need Medicare for All. https://t.co/mkWXuCIVi9", "date": "2019-09-18 19:31:09"}, "186": {"text": ".@SecPompeo: An attack on Saudi oil is NOT an attack on America. If you want a war, come to Congress to make your case. We will not let you drag the American people into another catastrophe in the Middle East.\n\nYour job is to use diplomacy to resolve conflict—not incite more war. https://t.co/GcpacxodOd", "date": "2019-09-18 18:25:11"}, "187": {"text": "U.S. trade agreements should stop the outsourcing of jobs, end the race to the bottom, protect the environment and lower the outrageously high price of prescription drugs. \n\n@RepDebDingell is right: Trump’s NAFTA 2.0 falls far short of those standards. https://t.co/ClYOaxoO1F", "date": "2019-09-18 13:48:57"}, "188": {"text": "Trump says he loves business and states' rights. Except when automakers and the state of California worked together to reduce car emissions. \n\nHow sick do you have to be, in the face of a climate emergency, to have your EPA block this effort to cut tailpipe pollution? https://t.co/AtW9Hs3pfm", "date": "2019-09-18 13:29:16"}, "189": {"text": ".@HasanMinhaj is right. Instead of just worrying about Wall Street, maybe it's time we start worrying about the 45 million Americans with $1.6 trillion in student debt. We could start by canceling it. https://t.co/Ie9Xaj4Jqf", "date": "2019-09-17 23:52:51"}, "190": {"text": "\"I am alive today not because of insurance companies but despite them.\"\n \nWe are the only major country that allows private insurance companies to rip us off, rob us of our health, and drive our people into financial or emotional catastrophe. https://t.co/kCvle57MVz", "date": "2019-09-17 19:18:24"}, "191": {"text": "Congratulations to the students pushing the University of California to join more than a thousand institutions in divesting from fossil fuels. If we want to leave future generations a planet that is healthy and habitable, we must transform our energy system to sustainable energy. https://t.co/YBGS3m59RA", "date": "2019-09-17 16:29:30"}, "192": {"text": "RT @himpey: @SenSanders I’m from the U.K. and I had a c-section for the birth of my son 3 years ago in the NHS. But If I went private the c…", "date": "2019-09-17 15:21:11"}, "193": {"text": "Average cost of a C-section:\n\n🇪🇸 $2,352\n🇬🇧 $4,435\n🇦🇺 $5,186\n🇫🇷 $6,441\n\n🇺🇸 $15,041\n\nWe can afford Medicare for All. What we can't afford is continuing to charge women in the U.S. more than any other country for giving birth.", "date": "2019-09-17 13:41:52"}, "194": {"text": "RT @mattduss: If the DC foreign policy establishment got as agitated by a school bus full of kids getting blown up as it does for an oil re…", "date": "2019-09-17 13:35:25"}, "195": {"text": "As many as 22 million people—double the populations of New York City and Chicago combined—could be displaced by global warming this year. \n\nWhen we say that climate change is an emergency, this is what @AOC, @RepBlumenauer and I are talking about. https://t.co/IQW00xHTIP", "date": "2019-09-16 17:58:35"}, "196": {"text": "RT @repmarkpocan: Hey @realDonaldTrump – FYI you need approval from Congress (not Saudi Arabia) if you want to go to war with Iran.\n\nIt’s t…", "date": "2019-09-16 17:34:14"}, "197": {"text": "What are our priorities when it takes 10 years to get food insecurity back down to a level before Wall Street crashed the economy?\n\n1 in 9 families still go hungry in the world's richest country. If we are to end hunger, ordinary people must get involved in the political process. https://t.co/cGSyit7e3A", "date": "2019-09-16 14:15:58"}, "198": {"text": "Mr. Trump, the Constitution of the United States is perfectly clear. Only Congress—not the president—can declare war. And Congress will not give you the authority to start another disastrous war in the Middle East just because the brutal Saudi dictatorship told you to. https://t.co/3wstui4O6I", "date": "2019-09-16 02:28:04"}, "199": {"text": "A federal report I commissioned confirms it: poverty is killing our people.\n \nA man in McDowell County, West Virginia, dies at 67—the same life expectancy as a man in India.\n \nJust 350 miles away, in Fairfax, VA, a man lives to 82—the same as in Switzerland. This is just obscene. https://t.co/k793Lp6i5w", "date": "2019-09-15 13:46:22"}, "200": {"text": "I said it in 1993 and I will say it again now: If you want a simpler, more cost-effective health care system, the way forward is a Medicare for All, single-payer program. https://t.co/RpZqqXO4k1", "date": "2019-09-14 20:24:23"}, "201": {"text": "200 days ago, Nancy Pelosi and her House colleagues passed expanded background checks, taking common-sense action to prevent another horrific mass shooting.\n\nWhat has Mitch McConnell done? Nothing but the NRA's bidding.\n\nDo your damn job, Senator. https://t.co/LsmVo3Ce5Q", "date": "2019-09-14 14:09:23"}, "202": {"text": "Here's the business model: \n\n• Flood the country with painkillers\n• Lie about the addictive effects\n• Start opioid epidemic \n• Cut a deal, admit no wrongdoing\n• Hide money in Swiss bank accounts\n\nThe billionaire Sackler family must be held criminally liable for their greed. https://t.co/MspNZAapxH", "date": "2019-09-13 22:22:03"}, "203": {"text": "Wall Street billionaires have cooked up a new scheme: buying up health clinics so they can charge unsuspecting patients insane “out-of-network” fees. That is pretty disgusting. https://t.co/BuOWiBngv0", "date": "2019-09-13 21:02:53"}, "204": {"text": "The Republicans who are suppressing the vote are terrified of how we could transform this country when millions more Americans are allowed to participate in our democracy. They are cowards. https://t.co/UUgIlH12Pu", "date": "2019-09-13 17:17:00"}, "205": {"text": "By stopping the U.S. support that Saudi Arabia needs to carry out its bombings in Yemen, we can help end the world’s worst humanitarian crisis.\n \nI've passed an awful lot of amendments in Congress over the years, so let me tell you: this one is important.\nhttps://t.co/jVG0yYAfWq", "date": "2019-09-13 14:13:03"}, "206": {"text": "I've never met a voter, Republican or Democrat, who is begging the government to let corporations pollute the sources we rely on for drinking water even more.\n \nYet that's just what Trump is doing, threatening 117 million Americans. Big polluters are in charge of our government. https://t.co/IgRBHElbCT", "date": "2019-09-12 20:07:24"}, "207": {"text": "Workers of all backgrounds are standing up for their rights. That includes yoga teachers, who are facing down shameful anti-union propaganda from their Wall Street owners. This is exactly the kind of energy we need to rebuild the middle class. https://t.co/VgH64dK0OP", "date": "2019-09-12 17:59:39"}, "208": {"text": "It is unbelievable that this needs to be said: American citizens are not something to be “cleaned up,” Mr. Trump.\n\nI have a much better idea. Build homes for all 552,730 unsheltered people, at a cost of less than 10% of Trump’s tax cut for the rich and large corporations. https://t.co/eDAj5BHaqH", "date": "2019-09-12 13:59:33"}, "209": {"text": "Now do AR-15s. https://t.co/HNJmxIuCrr", "date": "2019-09-11 20:12:41"}, "210": {"text": "Are you a student or recent graduate? Apply to be a full-time legislative intern in my D.C. office in the fall and spring semesters. Applications will be considered on a rolling basis. https://t.co/EPSZUJsFvB", "date": "2019-09-11 17:08:35"}, "211": {"text": "Home health aides, mostly women of color, do enormous work caring for our elderly. Yet they are insanely overworked and get poverty pay. Almost half need public assistance. \n\nWhat they need are the living wages and benefits they are entitled to in America. https://t.co/KalHZTCdIQ", "date": "2019-09-11 16:43:47"}, "212": {"text": "We must also reflect on the 18-year-old \"war on terror\" and the harm it has caused. If we do not move decisively to end America’s longest war, we will soon see servicemembers fight and die in Afghanistan and around the world in a conflict that was started before they were born.", "date": "2019-09-11 12:18:28"}, "213": {"text": "This year, Congress finally acted to give these first responders the financial security and medical attention they need as they cope with illnesses from the toxins they were exposed to at Ground Zero.", "date": "2019-09-11 12:18:28"}, "214": {"text": "Today, we remember the 3,000 Americans we lost on September 11, 2001, and we honor the bravery of the emergency workers who rushed into danger in order to save lives.", "date": "2019-09-11 12:18:28"}, "215": {"text": "96 percent of Democrats and 83 percent of Republicans support background checks for all potential gun buyers. The gun lobby should not control Congress. https://t.co/c9RBh0XEdW", "date": "2019-09-10 22:37:14"}, "216": {"text": "This is what oligarchy looks like. If you're a member of the family that controls Cargill, you can award yourself a $5 million payout. \n\nMeanwhile, small farmers are struggling and Mitch McConnell is blocking a raise to $15 an hour for 40 million workers. https://t.co/xdqGrqgB9n", "date": "2019-09-10 19:09:19"}, "217": {"text": "Mr. Trump lied. He promised to strengthen health care—instead, he has done everything he can to sabotage the Affordable Care Act.\n\nThe result: Nearly two million people joined the ranks of the uninsured last year, the first increase in the uninsured rate in a decade. https://t.co/ZmmX8eXxQG", "date": "2019-09-10 14:57:28"}, "218": {"text": "It's absurd that the United States is the only advanced country that does not guarantee its workers paid vacation time. A mom and a dad ought to have the right to at least a couple of weeks of paid vacation so they can spend quality time with their kids. https://t.co/RnxeA0vheu", "date": "2019-09-10 14:10:33"}, "219": {"text": "The DMV should not use its trove of personal information as a tool to make money. Nobody—from agencies like the DMV to large corporations like Facebook and Google—should be profiting from sharing or selling personal information without meaningful consent. https://t.co/HsVe6ieBLf", "date": "2019-09-09 23:30:00"}, "220": {"text": "This is dangerous. Too many Americans have fought and died to defend American democracy to let President Trump act like an authoritarian. https://t.co/1JSKZ0idOD", "date": "2019-09-09 20:05:25"}, "221": {"text": "RT @RepJayapal: America “is already spending the money required to fund single-payer… But that money goes to private corporations who in tu…", "date": "2019-09-09 16:41:38"}, "222": {"text": "Poverty is, in my view, a death sentence. The poorest older Americans die at twice the rate as the richest. \n\nWe must end our country’s obscene inequality and ensure basic economic security for all—or we will condemn an entire generation to early death. https://t.co/h6D1lzC8ES", "date": "2019-09-09 13:04:33"}, "223": {"text": "If @realDonaldTrump was serious about ending U.S. wars in the Middle East, he would’ve signed our bipartisan bill to stop the Yemen war instead of vetoing it.\n\nIf Congress does not stand up to him and defund it, the Saudi-led war could kill 233,000 Yemenis by the end of the year. https://t.co/9nQ2W48nE6", "date": "2019-09-08 20:04:14"}, "224": {"text": "The world's largest military budgets:\n \n🇯🇵 $50 billion\n🇬🇧 $53 billion\n🇫🇷 $56 billion\n🇮🇳 $58 billion\n🇷🇺 $63 billion\n🇸🇦 $83 billion\n🇨🇳 $168 billion\n🇺🇸 $700 billion\n \nWhat if—just maybe—we led the world not in weapons and war, but in fighting humanity's common enemy: climate change?", "date": "2019-09-08 15:26:50"}, "225": {"text": "Here are 6 of the 10 fastest-growing jobs in America:\n \n• Personal care aide—$24,020\n• Food preparer—$21,250\n• Home health aide—$24,200\n• Cook—$26,530\n• Waiter—$21,780\n• Janitor—$26,110\n\nIf we want a decent, humane society, workers must get at least $15 an hour and a union. https://t.co/qfXOPkSxoe", "date": "2019-09-07 22:18:23"}, "226": {"text": "Under a Medicare for All system, we are going to guarantee health care to all people as a human right. Working people should not have to search around for coupons or risk going into bankruptcy to afford their medical care. https://t.co/1xGIR2TQFx", "date": "2019-09-07 15:44:48"}, "227": {"text": "How absurd is it that Social Security has lifted 22 million Americans out of poverty and is among the most popular government programs in existence, but Republicans still want to cut it? Sorry, GOP, but our job is not to cut Social Security. Our job is to expand it. https://t.co/2BBCmeSOkA", "date": "2019-09-06 20:15:27"}, "228": {"text": "Mr. Trump wasted everyone's time with ludicrous talk about trying to buy Greenland.\n\nWouldn't it be nice if we had a leader who tried to stop it from melting? https://t.co/57WlXy5CAZ", "date": "2019-09-06 14:54:11"}, "229": {"text": "Addiction is a disease, not criminal activity.\n\nHere's who should be held criminally liable: The top executives of the opioid manufacturers who lied by pushing a product they knew was addictive on doctors and patients, causing a national public health emergency. https://t.co/uibjXg2AiV", "date": "2019-09-05 23:06:13"}, "230": {"text": "RT @fightfor15: @SenSanders 100% Senator. It's been over ten years since the last increase in the federal minimum wage and it's time for Mi…", "date": "2019-09-05 20:23:26"}, "231": {"text": "Here's a fact you don't hear too often: Half of America’s workers make less than $19 an hour.\n \nWhen we double the federal minimum wage from $7.25 to $15, we'll boost pay up the income ladder. That means workers making above $15 an hour—11.6 million of them—will also get raises. https://t.co/WNrWNmxNBn", "date": "2019-09-05 20:14:41"}, "232": {"text": "RT @RepDavidTrone: We need to make sure House-passed provisions blocking US aid to the Saudi-led coalition in Yemen remain in the #NDAA. Co…", "date": "2019-09-05 18:39:33"}, "233": {"text": "The loan sharks of today wear expensive suits and work on Wall Street, where they make hundreds of millions of dollars by pushing sky-high fees and outrageous interest rates as high as 27 percent on American consumers. Together, we must end their greed. https://t.co/YdsrI2KbMG", "date": "2019-09-05 15:57:57"}, "234": {"text": "Trump's still trying to waste billions of taxpayer dollars on a wall, using a phony \"national emergency\" to ignore Congress and the Constitution.\n \nThink of the urgent work we could be doing together, instead, if we treated climate change like the national emergency that it is. https://t.co/1yvbP3zocz", "date": "2019-09-04 16:35:58"}, "235": {"text": "Just in time for the new school year, billionaire Betsy DeVos wants to make it harder for students who were the victims of fraud to get their debts cancelled. She has got to be the worst Secretary of Education in the modern history of our country. https://t.co/K3MaNwG7hB", "date": "2019-09-04 13:10:53"}, "236": {"text": "The fossil fuel industry is now the equivalent of the tobacco industry. It creates death and destruction, then spends billions denying its responsibility.\n \nLet us be clear: Hurricane Dorian has everything to do with climate change, which is the existential crisis of our time. https://t.co/TBLiIcKb1W", "date": "2019-09-03 19:02:48"}, "237": {"text": "Bipartisan majorities of Congress told Mr. Trump to end this unconstitutional war. Now we must use Congress’s power of the purse to block every nickel of taxpayer money from going to help the Saudi dictatorship as it bombs and starves civilians in Yemen. https://t.co/GjzQ3S905c", "date": "2019-09-03 14:12:33"}, "238": {"text": "If you were born in 1973, the median wage went from $17 to $19 an hour over your lifetime. That’s it. Two bucks in 45 years. \n\nThe top 1%'s annual income tripled: $480K to $1.45 million.\n\nThat's why we need a political revolution. To build an economy for all of us—not the 1%. https://t.co/2OOonDDPhV", "date": "2019-09-02 19:07:03"}, "239": {"text": "RT @keithellison: Today, thank labor. Tell your loved ones about A. Phillip Randolph, Walter Reuther or Triangle Shirt Waist Fire, or tell…", "date": "2019-09-02 18:42:19"}, "240": {"text": "Eight million people work two or more jobs just to survive in the world's richest country. Their stories show us an economy of, by, and for the 1%.\n\nIt's time to stand up, fight back, and build a society where America's working class can live in dignity. https://t.co/CpU7nwTwTB", "date": "2019-09-02 17:07:03"}, "241": {"text": "This Labor Day, I stand with my House colleagues. Mitch McConnell: You do not have the right to deprive the American people of a debate to give millions of workers a raise. Bring the Raise The Wage Act to the floor for a vote. https://t.co/xtZPD6mIOp", "date": "2019-09-02 12:00:01"}, "242": {"text": "U.S. bombs, logistical support, and intelligence for the Saudi dictatorship's airstrikes make us complicit in this nightmare.\n\nCongress has declared this war unconstitutional. We must now stand up to Trump and defund all U.S. involvement in these horrors. https://t.co/590lTcBtku", "date": "2019-09-01 18:20:04"}, "243": {"text": "Even the part of Trump’s tax scam supposedly for low-income neighborhoods is a massive tax avoidance scheme for the ultra-rich.\n \nPresident Trump has many critics. But as a con artist, he is a talent of the highest caliber. https://t.co/lIc2IBk2Zj", "date": "2019-09-01 15:29:02"}, "244": {"text": "Average cost of a year of college: $50,000\nMedian family income: $61,000\n\nWe let middle-class parents drown in debt trying to ensure a middle-class future for their kids. That is obscene.\n\nWe must cancel student debt and make public colleges tuition-free. https://t.co/CUoQ0WexYg", "date": "2019-08-31 18:13:29"}, "245": {"text": "It is unconscionable that this man was given a lifetime prison sentence and kept behind bars for 36 years—for stealing $50 at the age of 22.\n\nWe have a racist criminal justice system that must be fundamentally transformed. https://t.co/KxqRipGcQM", "date": "2019-08-31 14:54:27"}, "246": {"text": "How crazy is it that there was no in-state tuition for all students in California, until the 1970s? College was free.\n\nNot crazy at all. Don't let anyone tell you that we cannot tax Wall Street to fund tuition-free college and the cancellation of student debt. https://t.co/sGnyP3ji7r", "date": "2019-08-30 19:11:46"}, "247": {"text": "Strong unions are the reason why America once led the world in wages in benefits. No wonder they're so popular, despite decades of right-wing attacks. We must rebuild the trade union movement in this country. https://t.co/XYt8B9qo2F", "date": "2019-08-30 14:26:23"}, "248": {"text": "Good. Now let's do every other state and territory in the country. https://t.co/4zuFMck4pV", "date": "2019-08-29 19:10:42"}, "249": {"text": "It is crazy that we are the only country that lets drug companies charge anything they want—even $6 million—and raise the price tomorrow.\n\nTaxpayers give Big Pharma patent monopolies, tax breaks and research money. But Medicare isn't allowed to negotiate fair prices. Shameful. https://t.co/vpWn6n1vQu", "date": "2019-08-29 16:32:46"}, "250": {"text": "The Amazon is being destroyed. So Trump opens America's largest rainforest, Tongass National Forest, to logging and mining. \n\nMethane emissions surge worldwide. Trump's EPA will make them grow faster.\n\nThe president and his billionaire friends are a threat to our entire planet. https://t.co/hQuysV8zUc", "date": "2019-08-29 14:55:28"}, "251": {"text": "What does it mean when the function of the health care system—in the richest country in the history of the world—is to make billions for insurance and drug companies? \n\n18 percent of Americans with diabetes are rationing the medications they need to live. https://t.co/zyDjSiA3FP", "date": "2019-08-28 21:03:45"}, "252": {"text": "On Trump's watch, 3,000 Americans died after Hurricane María. A new storm approaches and 33,000 Puerto Ricans still live under blue tarps.\n \nTrump's response? Divert $155 million from FEMA for migrant detention, complain about federal aid, and mock Puerto Rican officials. Insane. https://t.co/wIrsjajzrY", "date": "2019-08-28 15:51:25"}, "253": {"text": "Debido al fracaso del gobierno federal, 33, 000 techos todavía siguen con toldos azules después del huracán María, que fue hace casi 2 años. El gobierno federal debe proveer todos los recursos, por el tiempo que sea necesario, para preparar a nuestros conciudadanos para lo peor.", "date": "2019-08-28 01:03:26"}, "254": {"text": "Due to the failure of the federal government, 33,000 roofs still have blue tarps almost two years after Hurricane María. We must commit full resources to prepare our fellow citizens for the worst and stand with them for as long as is necessary to finally help rebuild Puerto Rico. https://t.co/fZEyb8qDok", "date": "2019-08-28 01:03:25"}, "255": {"text": "Under the so-called \"War on Drugs,\" men on street corners dealing pot were thrown in jail. I want to see a war on the corporate greed that is killing Americans. I want to see top executives held personally liable for actions that led to the deaths of more than 42,000 people.", "date": "2019-08-27 22:39:04"}, "256": {"text": "Under my legislation, the Opioid Crisis Accountability Act, Johnson &amp; Johnson would be fined $7.8 billion—13 times as much as this penalty, about half of the company's profits, and 10 percent of the total annual cost of the terrible opioid crisis afflicting our country.", "date": "2019-08-27 22:39:04"}, "257": {"text": "This fine is a step in the right direction. But I want to see the corporate executives at Johnson &amp; Johnson, Purdue, and other companies held criminally liable for their actions. https://t.co/eK7UqwXEJt", "date": "2019-08-27 22:39:03"}, "258": {"text": "Trump complains about \"bad\" trade negotiators. But U.S. negotiators under both parties deliberately pushed through trade deals written by huge corporations designed to outsource millions of U.S. jobs and exploit cheap labor. \n\nWe need fair trade to protect workers and our planet. https://t.co/AJGnPfyUes", "date": "2019-08-27 17:12:21"}, "259": {"text": "People say climate action is expensive. But the price of inaction is far more costly. Intense heat waves could kill tens of thousands of Americans each year if we don't act. We must move urgently and boldly to transform our energy system. https://t.co/nOx0L3VFNd", "date": "2019-08-27 14:51:41"}, "260": {"text": "If its CEO @SteveEasterbrk gets paid $85 million over three years, @McDonalds can damn well pay all its workers at least $15 an hour. @McDonaldsCorp market value grew $71 billion while it paid the average cashier a starvation wage of $9 an hour. Shameful. https://t.co/29ZZPhYc6I", "date": "2019-08-26 23:39:24"}, "261": {"text": "RT @SEIU: We agree with @SenSanders.“No senior should have to sell their belongings or spend their life savings just to be able to age in p…", "date": "2019-08-26 21:15:00"}, "262": {"text": "Trains from Boston to D.C. take 7-8 hours. Trains from Beijing to Shanghai go nearly twice as far in half the time.\n \nA Green New Deal means major public investments in American-made high-speed rail. We can lower emissions, create good union jobs, and improve our quality of life. https://t.co/V9fgmaZ00A", "date": "2019-08-26 16:05:50"}, "263": {"text": "Trump said he wanted to get us out of Middle East conflicts. He lied. When we passed a bill to end U.S. involvement in the Saudi-led war in Yemen, he vetoed it. \n\nCongress must now defund all U.S. support for this war. Millions of lives are at stake. https://t.co/jK1hQAuTTC", "date": "2019-08-26 14:24:48"}, "264": {"text": "Over 40 years, income per person doubled. But half our people live paycheck to paycheck. Why?\n\nBecause the top 1% captured 45% of new income. And the median hourly wage grew by $2 over 40 years.\n\nThis is a rigged economy. And the working class needs to come together to fix it.", "date": "2019-08-25 18:47:47"}, "265": {"text": "Let's be clear: Trickle-down economics is nothing but a fraudulent theory designed by the rich and their think tanks to protect billionaires and large corporations. https://t.co/FUAWrbpYZc", "date": "2019-08-24 18:03:15"}, "266": {"text": "RT @Winnie_Byanyima: Thank you @SenSanders for amplifying my voice on the important question of tax justice. Big companies &amp; billionaires m…", "date": "2019-08-24 17:57:20"}, "267": {"text": "The inaction and denialism of Trump and Bolsonaro are threatening not just our lives, but also future generations. \n\nAmericans and Brazilians must come together to defeat these rightwing demagogues and act immediately to save the planet—our only home—from climate catastrophe. https://t.co/p0XYIZIL9o", "date": "2019-08-23 20:24:04"}, "268": {"text": "The banks are still at it. This is the very same Wall Street recklessness that led to economic disaster and ruined millions of lives across our country. Unless we end their greed, American taxpayers will be on the hook again. https://t.co/Ii89ZDHkzf", "date": "2019-08-23 18:30:29"}, "269": {"text": "Black women make 61 cents on the dollar compared to white men, and their wages continue to fall further and further behind. That is simply a disgrace.\n\nWe should guarantee equal pay for equal work. This is not a radical idea—this is an issue of basic justice. https://t.co/00ffms2oNT", "date": "2019-08-22 19:13:16"}, "270": {"text": "It will take student borrowers 100 years to repay their debt for the \"crime\" of getting a higher education. That is insane.\n\nWe have got to hit the reset button. We should cancel all student debt in this country and make Wall Street pay for it. https://t.co/z8bvcjaLCy", "date": "2019-08-22 13:29:16"}, "271": {"text": "For centuries, America’s rise relied on treating Black people as literal property. \"Slavery By Another Name\" continued well into the 20th century. I believe we should talk about this part of our history, and learn about how it has shaped every aspect of our politics and economy. https://t.co/RUVpyx6mYT", "date": "2019-08-21 18:56:04"}, "272": {"text": "If the richest Americans do not start paying their fair share of taxes, we are headed for a future where they control all of the wealth and the rest of the country has none. All of it.\n\nTo me, that is outrageous and that is not what America is about. https://t.co/iAOHZmXLRQ", "date": "2019-08-21 13:35:54"}, "273": {"text": "On many issues, we are divided, but comprehensive background checks are supported by 97 percent of Americans. President Trump is a coward whose failure to act threatens public safety. https://t.co/3Em0njQ9oc", "date": "2019-08-20 21:35:47"}, "274": {"text": "The business model of Wells Fargo is fraud. Yet how many people at Wells Fargo are going to jail? Zero.\n\nBut if you smoke marijuana in this country, you get a criminal record. That is unacceptable. https://t.co/pnxPjy0SU5", "date": "2019-08-20 20:05:59"}, "275": {"text": "We still can't import medicine from Canada at a fraction of the price. My bill, the Affordable and Safe Prescription Drug Importation Act, ends this absurdity. We can lower drug prices and save lives. \n\nDoes @realDonaldTrump have the guts to stand up to Big Pharma’s greed? https://t.co/4RywIn58lb", "date": "2019-08-20 15:40:29"}, "276": {"text": "CEOs of billion-dollar companies say they want to invest in their workers and communities. Good. I have a few ideas for them:\n\n✅ Provide a living wage of at least $15 an hour\n✅ Stop union-busting and outsourcing jobs\n✅ Pay your taxes, don't evade them https://t.co/WTGLgHN6Ox", "date": "2019-08-20 01:41:42"}, "277": {"text": "Trump and the Republicans' latest attack on women's rights is this gag rule on health providers. Their goal is to overturn Roe v. Wade.\n\nWe will not let them win. We must fight together until a woman’s constitutional right to abortion is truly secure. https://t.co/sOsq5GTdWM", "date": "2019-08-19 22:32:59"}, "278": {"text": "The millennial generation was told that the only way they would get good jobs is if they received a college education. That turned out to be dead wrong. Wages for the average college graduate have stagnated. It's time to hit the reset button. Here's how: https://t.co/gd3TPjxH1a", "date": "2019-08-19 15:30:42"}, "279": {"text": "Together, we will cancel all student debt. And we're going to make Wall Street speculators pay for every nickel of it. https://t.co/QFxLXLKD1W", "date": "2019-08-19 15:21:26"}, "280": {"text": "Whether America's climate-action plan is 1,000 pages long or two pages long, at the end of the day, we all know what it’s about. It’s about building the political power to tell the fossil fuel industry: Sorry, you cannot continue to destroy the planet for short-term profits. https://t.co/pi8Pv0z54m", "date": "2019-08-19 13:54:26"}, "281": {"text": "Billionaires and huge corporations should not be allowed to use loopholes and tax havens to avoid paying their fair share. At a time of massive global inequality the very wealthy should be paying more in taxes, not less. https://t.co/uRIQoiqn7c", "date": "2019-08-18 21:20:00"}, "282": {"text": "Some say we can't afford tuition-free public college. \n\nLet me get this straight: 40 years ago, in an economy with half the income per person, some of the best public schools were essentially free. \n\nBut guaranteeing college for all is so \"radical\" that we can't afford it today?", "date": "2019-08-18 18:09:39"}, "283": {"text": "President Trump proposed cutting Social Security benefits by $25 billion in his budget. That should outrage all of us, young and old alike. \n\nNo, Mr. President, we will not let you cut Social Security. We will fight to expand it. https://t.co/evYVDVQfoG", "date": "2019-08-18 16:30:06"}, "284": {"text": "Think of how crazy you have to be, in the middle of a mass-extinction event, to try to destroy the Endangered Species Act.\n\nI’m sure Trump’s friends in the fossil fuel and mineral industries are happy with his attack on our biodiversity. https://t.co/gHs41O9Nop", "date": "2019-08-17 17:45:25"}, "285": {"text": "Over 40 years:\n\n• GDP per person doubled\n• CEO pay ⬆️ 1,000%\n• CEOs, who got $30 for every $1 a worker made, now get $278\n• The median wage grew $2 an hour since 1978\n\nA political revolution means standing up to billionaires to say: Enough is enough. You can't have it all. https://t.co/bfu5Qint8D", "date": "2019-08-16 19:30:14"}, "286": {"text": "If Prime Minister @Netanyahu doesn't want members of Congress to visit Israel, then maybe he can respectfully decline $3.8 billion in annual funding—the largest amount of U.S. aid to any country.\n\nI believe in an even-handed approach to ending the Israeli-Palestinian conflict. https://t.co/GGVHi8pzSk", "date": "2019-08-16 16:59:41"}, "287": {"text": "It's confirmed: July was the hottest month ever recorded. \n\nHow insane is it that our Environmental Protection Agency is now run by a former coal lobbyist? We must stand up to the fossil fuel industry and say: you will no longer dictate our climate policy. https://t.co/IciWMOYO19", "date": "2019-08-16 15:37:51"}, "288": {"text": "No senior should have to sell their belongings or spend their life savings just to be able to age in place. \n\nUnder the Medicare for All, long-term, home-based care will be guaranteed as a right to every senior and person with a disability in America. https://t.co/J2S671yF2a", "date": "2019-08-15 19:19:55"}, "289": {"text": "Banning Congresswomen Omar and Tlaib from entering Israel and Palestine is a sign of enormous disrespect to these elected leaders, to the United States Congress, and to the principles of democracy. The Israeli government should reverse this decision and allow them in. https://t.co/mvdcmnFBKU", "date": "2019-08-15 15:08:19"}, "290": {"text": "When @RepCummings and I asked pharma CEOs about soaring drug prices, they coordinated to block our investigation.\n\n@MylanNews and @TevaUSA: Obstructing our inquiry is a crime. The American people deserve answers about your price-fixing conspiracy. https://t.co/rLIq7pAfcK", "date": "2019-08-15 12:48:21"}, "291": {"text": "Mr. Trump is a lying bigot. https://t.co/uXcajQtLdQ", "date": "2019-08-14 22:23:36"}, "292": {"text": "On this day, 84 years ago, FDR signed Social Security into law. It is one of the most successful programs in our country’s history and lifts more Americans out of poverty than any other.\n \nWe are not going to cut Social Security—we are going to expand it. https://t.co/8M7rEoNmgB", "date": "2019-08-14 19:49:58"}, "293": {"text": "The effects of climate change already affect all of us—rural and urban residents, inland and coastal communities alike.\n\nLet's come together as a nation and mobilize a response as large and serious as the emergency itself. Our future depends on it. https://t.co/TidTWv5Fdx", "date": "2019-08-14 14:26:55"}, "294": {"text": "Do you think it’s a coincidence that the racist manifesto of the El Paso shooter echoes Trump’s language of “invasion” and “infestation” of immigrants? I don’t. \n\n@realDonaldTrump is fanning the flames of white supremacy. We must stop him. https://t.co/CTz96qAZ8A", "date": "2019-08-13 21:49:37"}, "295": {"text": "The United States needs to end the international embarrassment of being the only industrialized nation not to provide paid family leave. https://t.co/Fe0IMkxx25", "date": "2019-08-13 19:37:05"}, "296": {"text": "We must not be about tearing small children away from their families. In 2002, I voted against creation of DHS and the establishment of ICE. That was the right vote. \n\nWhat our cruel and broken immigration system needs is comprehensive reform. https://t.co/WcLAiBpGb2", "date": "2019-08-13 13:39:54"}, "297": {"text": "$70,000 a minute. \n$4 million per hour. \n$100 million per day. \n\nThat's how much the Walton family, the richest family in the world, made last year. \n\nI say to the Walton family: No more excuses. Pay your workers a living wage—at least $15 an hour. https://t.co/k7aGeQXxvq", "date": "2019-08-12 15:19:19"}, "298": {"text": "I guess this is what Senator Mitch McConnell calls \"leadership\": Defending starvation wages for American workers, inaction on the climate crisis, and doing nothing to stop mass shootings. https://t.co/4fxen1s7qg", "date": "2019-08-12 12:59:03"}, "299": {"text": "Health care is a right, not a privilege. We need Medicare for All so we can end the disgrace of 30 million Americans having no health insurance, and many more being underinsured with high deductibles and co-payments. https://t.co/N7nPZ4H59T", "date": "2019-08-10 14:11:07"}, "300": {"text": "Our grassroots movement got Democrats and Republicans to pass our bill to end the U.S. role in Saudi Arabia's brutal war in Yemen. \n\nAlthough Trump vetoed it, Congress can still rein in this president and put an end to the world's worst humanitarian crisis. https://t.co/BRV3gZ4pno", "date": "2019-08-09 15:14:37"}, "301": {"text": "Billionaire Wall Street investors think they’re pretty savvy. But their big bet on fossil fuels didn’t pan out: BlackRock lost $90 billion investing in oil and coal over 10 years. \n\nMaybe after a few billion more in losses, they’ll realize we should act to solve climate change. https://t.co/hdOUPnMFBi", "date": "2019-08-09 12:58:45"}, "302": {"text": "Prescription drug costs are too damn high!\n\nFor decades, we've been paying more to pharmaceutical companies than any other country. You know what that makes us? The suckers of the world. https://t.co/Ztc4a43fD2", "date": "2019-08-08 19:53:35"}, "303": {"text": "In 1923, researchers who discovered insulin sold the patent for $1 so it would be available to all. But drug companies hijacked this lifesaving medicine and now charge over $300 a vial.\n \nLet’s be clear about this: Big Pharma’s greed is literally killing people in this country. https://t.co/T9oUdD7W9E", "date": "2019-08-08 16:41:07"}, "304": {"text": "The Trump plan to cut nutrition assistance for 3 million Americans is nothing short of obscene. Tax cuts for the rich, more hunger for the poor. This is what oligarchy looks like.\n\nWe are calling on @realDonaldTrump to reverse this disastrous proposal. \nhttps://t.co/T1lNXK6tq2", "date": "2019-08-08 14:03:48"}, "305": {"text": "Billions around the world are at risk of drought, displacement, and resource wars. \n\nWhat if, instead of spending $738 billion a year on the Pentagon and weapons systems, the United States brought the world together to cooperate on solving climate change? https://t.co/GaudS5MASR", "date": "2019-08-07 23:05:15"}, "306": {"text": "And we should make public colleges and universities tuition-free. This is not a \"radical\" idea. Here is how we do it: https://t.co/gd3TPjg5CA", "date": "2019-08-07 16:19:17"}, "307": {"text": "We should cancel it. https://t.co/Vb2UW8nO2R", "date": "2019-08-07 15:51:04"}, "308": {"text": "July 2019 was the hottest month in recorded history. Make no mistake: this is an emergency. \n\nWe cannot afford to simply wait Trump out. Congress must act boldly to tackle the climate threat—the fate of our children and grandchildren depend on it. https://t.co/MEHWCTC7pg", "date": "2019-08-06 23:43:41"}, "309": {"text": "RT @RepRoKhanna: .@SenSanders and my War Powers Resolution led to the suspension of refueling Saudi planes. Now, we have a chance to stop t…", "date": "2019-08-06 20:04:28"}, "310": {"text": "Why are we the only advanced country with no guaranteed family leave, sick days or vacations? Because corporate America hates unions.\n \nOur plan, the Workplace Democracy Act, will revitalize union organizing so America's working class has a dignified life. https://t.co/OkZCDgDW64", "date": "2019-08-06 18:48:32"}, "311": {"text": "President Trump faces a choice: bring the country together to pass commonsense gun safety measures—or blame the internet. He has decided to side with the NRA, whose lobbyists and campaign contributions control the Republican party. \n#VideogamesAreNotToBlame https://t.co/r4IeRDsYKz", "date": "2019-08-05 23:11:55"}, "312": {"text": "On the issue of guns, we are not so divided: Over 90% of the public supports universal background checks. \n \n@SenateGOP and @realDonaldTrump: the country is demanding action right now. Will you side with the American people or will you just do what the @NRA wants?", "date": "2019-08-05 21:22:22"}, "313": {"text": "No one should profit from imprisoning people, especially children.\n\nWe must end this morally repugnant business. https://t.co/FPHeTzVRee", "date": "2019-08-05 13:36:46"}, "314": {"text": "Senator McConnell, bring a bill to fight this gun violence epidemic to the Senate floor for a vote. \n\nThese were passed by the House five months ago: \n∙ Bipartisan Background Checks Act \n∙ Enhanced Background Checks Act\n\nWithout action, your words are meaningless and insulting. https://t.co/4tcr9NgivP", "date": "2019-08-04 20:13:52"}, "315": {"text": "A society which proclaims freedom as its goal, as the United States does, must work unceasingly to end the disgraceful bigotry and violence against transgender Americans. https://t.co/CKRrvBjpLt", "date": "2019-08-03 12:11:28"}, "316": {"text": "El pueblo boricua se unió, se levantó, y le forzó a Rosselló a renunciar. Nos muestra lo que la gente común puede lograr cuando nos organizamos. Ahora tenemos que asegurar de que reciban una representación justa y receptiva. Puerto Rico se merece la democracia, no la austeridad.", "date": "2019-08-03 00:01:31"}, "317": {"text": "The Puerto Rican people came together, stood up, and forced Governor Rosselló to resign. They showed us what ordinary people can achieve when we organize. Our job now is to make sure they get fair and responsive representation. Puerto Rico deserves democracy, not austerity. https://t.co/GmwAUFZHQm", "date": "2019-08-02 22:36:14"}, "318": {"text": "I say to Mitch McConnell: Do not ignore the will of 200 million Americans who want us to put an end to starvation wages in the United States.\n\nLet the American people have a vote on a $15 minimum wage! https://t.co/p0uaE6mMo9", "date": "2019-08-02 14:51:15"}, "319": {"text": "The pharmaceutical industry will claim the outrageous prices they charge for life-saving medicines are necessary. \n \nMaybe they haven’t heard of a country that we share thousands of miles of a border with, where they sell the exact same drugs for a fraction of the price. https://t.co/ECz1Q2TsVt", "date": "2019-08-02 13:23:31"}, "320": {"text": "Esto es inaceptable. El gobierno de los Estados Unidos le ha fallado al pueblo de Puerto Rico por demasiado tiempo. Eso debe acabar ya. El presidente Trump debe asegurar que el gobierno federal esté haciendo todo lo que esté en su poder para reconstruir a Puerto Rico.", "date": "2019-08-01 23:40:18"}, "321": {"text": "For far too long, the U.S. government has failed the people of Puerto Rico. That must end today. President Trump must act now to ensure that the federal government is doing everything in its power to fully rebuild Puerto Rico. https://t.co/EodP9a5Vhv", "date": "2019-08-01 23:39:05"}, "322": {"text": "The Pentagon is set to grow by $90 billion and reach $738 billion next year. For $90 billion, we could double nutrition assistance or provide $7,000 to every child in poverty. \n\nWe cannot keep handing over billions to the military-industrial complex. https://t.co/8zIyQnlbfZ", "date": "2019-08-01 18:46:44"}, "323": {"text": "RT @RoKhanna: When students attend public colleges and universities, here’s what they pay on average: \n\n🇩🇰 Denmark: $0\n🇪🇪 Estonia: $0\n🇫🇮 Fi…", "date": "2019-08-01 14:13:47"}, "324": {"text": "We should pay attention to this: Brazilian President Jair Bolsonaro, a far-right authoritarian, is rapidly destroying the Amazon rainforest. He is a threat to working people, minorities, journalists, and a habitable planet. No wonder Trump loves him so much. https://t.co/xO8n6Xfc5d", "date": "2019-08-01 13:10:18"}, "325": {"text": "If every major country on the planet can guarantee health care to all and achieve better health outcomes, while spending less per capita, please do not tell us that the United States of America cannot do the same. https://t.co/bzBbFFL8hL", "date": "2019-07-31 21:24:13"}, "326": {"text": "This is what an energy transition looks like when we have no plan. The coal company Blackjewel has filed for bankruptcy—meanwhile, its miners have not been paid for weeks. \n\nWe need to move to a sustainable economy with a just and fair transition for workers and their families. https://t.co/idjsbNg1Ei", "date": "2019-07-31 18:58:36"}, "327": {"text": "To restore our one-person-one-vote democracy, we must pass a constitutional amendment to overturn Citizens United and stop this country's slide to oligarchy. https://t.co/zs0MWAlXiT", "date": "2019-07-30 19:42:20"}, "328": {"text": "It makes no sense for young people to be denied jobs because they were arrested for smoking marijuana. It is time to decriminalize marijuana, expunge past marijuana convictions and end the failed war on drugs.", "date": "2019-07-30 14:38:06"}, "329": {"text": "RT @Public_Citizen: Universal health care COULD NEVER WORK\n\n...unless you live in:\n\nAustralia\nAustria\nBelgium\nCanada\nChile\nCzech Republic\nD…", "date": "2019-07-30 13:22:02"}, "330": {"text": "The Saudis said Jamal Khashoggi’s murder was a ‘rogue operation.’ That was a lie. \n\nA new piece reveals the regime’s ongoing efforts to harass and kidnap its critics around the world. It's past time to rethink our relationship with this repressive regime. https://t.co/D52fvbHVMl", "date": "2019-07-30 13:21:28"}, "331": {"text": "I wonder why Donald Trump vetoed our historic legislation to end U.S. involvement in the brutal bombing of Yemen. Who benefits from that?\n\nRaytheon, Boeing, Lockheed Martin, and General Dynamics: the four corporations making 90 percent of the weapons that we sell to Saudi Arabia. https://t.co/edxwSYnwO0", "date": "2019-07-29 18:51:36"}, "332": {"text": "It is unacceptable that across every chronic and acute health condition, people of color fare worse than their white counterparts. Together, we can fight racial bias and repair our broken health care system by passing the Health Equity and Accountability Act and Medicare for All. https://t.co/gX6wKGtvKw", "date": "2019-07-29 18:09:58"}, "333": {"text": "Let us be clear: In states where they have increased the minimum wage, paychecks are higher and the economy is booming. There is no excuse not to raise the federal minimum wage to $15 an hour and end starvation wages for 40 million Americans. https://t.co/UYwCD08jgj", "date": "2019-07-28 14:55:47"}, "334": {"text": "Public support for Medicare for All is rising. Why? The reason is pretty obvious. It is getting harder and harder to defend a dysfunctional health care system in which 30,000 people die every year because they don't get to a doctor when they should. https://t.co/GTPVwfMsRW", "date": "2019-07-27 19:43:58"}, "335": {"text": "How crazy is this? Even though car makers agreed with California to keep stronger fuel efficiency standards, the EPA is proposing to allow more tailpipe pollution. Trump's loyalty to the fossil fuel industry is threatening the very lives of our children. https://t.co/4CEXinXHJG", "date": "2019-07-26 17:32:20"}, "336": {"text": "The climate crisis means more frequent and more intense heatwaves around the world. Our job must be to rapidly transform our energy system from fossil fuels to energy efficiency and sustainable energy. With a Green New Deal, we can save the planet and create millions of new jobs. https://t.co/hkZJdkdHzK", "date": "2019-07-26 14:03:51"}, "337": {"text": "I agree with @Ilhan. We must counter Trump's racist playbook by advancing policies that unmistakably improve working people’s lives, like strengthening collective bargaining, raising the minimum wage, and treating jobs and health care as human rights. https://t.co/sQnCTVXOCo", "date": "2019-07-26 00:00:00"}, "338": {"text": "For three decades, I have been advocating for tuition-free college. If you are new to this effort, we welcome you to the fight for justice. https://t.co/qgoRWvh6bg", "date": "2019-07-25 21:53:18"}, "339": {"text": ".@RepRaulGrijalva is right. We must stand with the people of Puerto Rico in this decisive moment, and make sure their will is not trampled upon by an unelected board making cuts to education and health care. https://t.co/skcIHgYCk4", "date": "2019-07-25 19:55:13"}, "340": {"text": "Our broken criminal justice system targets poor people and minorities disproportionately with the death penalty, including those who are innocent. The government should not be in the business of killing people. We must abolish capital punishment. https://t.co/TkIuqkXnnN", "date": "2019-07-25 19:04:45"}, "341": {"text": "Nobody should be \"drowning,\" worrying about becoming homeless, because of crushing student debt in the United States of America.\n\nIt is time to tax Wall Street to fund student debt cancellation and tuition-free public colleges for all. https://t.co/0zDrEq23Bg", "date": "2019-07-25 14:56:36"}, "342": {"text": "The president’s veto enables the sale of $8.1 billion in weapons sales to Saudi Arabia's brutal dictators. It will deepen and prolong the world's worst humanitarian crisis in Yemen. It infringes on Congress' authority over matters of war.\n\nWhat a disgrace. https://t.co/sBcuczx21a", "date": "2019-07-25 13:51:36"}, "343": {"text": "Esta persona debe ayudar a la isla a recuperarse luego de décadas de devastación económica y del huracán María, que arrasó la isla hace casi dos años. Sin demora, garantizaremos el apoyo total del gobierno federal en la reconstrucción y recuperación de Puerto Rico.", "date": "2019-07-25 04:37:25"}, "344": {"text": "Felicito a los milliones de boricuas que se unieron a exigir que el gobernador Rosselló renunciara. Cuando nos unimos, no hay nada que no podemos lograr. La próxima persona que gobierne la isla debe escuchar a la gente y oponerse a la corrupción y la austeridad de Wall Street.", "date": "2019-07-25 04:37:25"}, "345": {"text": "His successor must stand against corruption and Wall Street-imposed austerity to help the island recover from decades of economic devastation and Hurricane Maria. Together, we will ensure the full support of the federal government in the rebuilding and recovery of Puerto Rico.", "date": "2019-07-25 04:27:33"}, "346": {"text": "I congratulate the millions of people in Puerto Rico who came together to demand the resignation of Governor Rosselló.\n\nWhen we stand together, there is nothing we cannot accomplish. https://t.co/bBJaz2Jd3q", "date": "2019-07-25 04:27:33"}, "347": {"text": "Why is it that year after year, our people are living shorter lives while we spend more and more on health care?\n\nPharmaceutical profits are a big part of the story. \n\nIf we want to solve the opioid crisis, their greed and criminality must come to an end. https://t.co/B9D9QPxN0o", "date": "2019-07-24 23:21:08"}, "348": {"text": "Trump is a scam artist and a demagogue. He is using racism to divide working people and distract from his loyalty to billionaires and huge corporations. It won't work. The American people will come together and defeat this strategy of fomenting hate. https://t.co/mdaNqLR87i", "date": "2019-07-24 19:55:24"}, "349": {"text": "Trump proposed $87 billion in cuts to infrastructure over the next 10 years in his budget. How is it, Mr. President, that a nation can thrive when its infrastructure is crumbling? https://t.co/j5FEFylx5G", "date": "2019-07-24 18:14:37"}, "350": {"text": "This proposal belongs in the trash, @realDonaldTrump. No one should go hungry in the United States of America. https://t.co/gRcYlWIq0s", "date": "2019-07-23 21:10:47"}, "351": {"text": "RT @SenateDems: America Speaks Out: Stop Trump’s Cruel Treatment of Children at the Border \n \nSenate Democrats are hearing testimony from m…", "date": "2019-07-23 19:39:44"}, "352": {"text": "If we could bail out Wall Street and give $1.5 trillion in tax breaks to private corporations, we damn well can cancel all student debt in this country—no exceptions. https://t.co/Lz9ATKwrve", "date": "2019-07-23 18:51:06"}, "353": {"text": "@Ilhan @RepJayapal @rweingarten @AFTunion Here's our plan to make all public colleges, trade schools and universities tuition free, and eliminate all student debt while making Wall Street speculators pay for every penny of it: https://t.co/gd3TPjxH1a", "date": "2019-07-23 18:35:44"}, "354": {"text": "RT @rweingarten: Black college graduates from 4 year schools take on $7,400 more in loans than white students. By cancelling student debt,…", "date": "2019-07-23 15:18:37"}, "355": {"text": "RT @RepJayapal: We must protect the enthusiasm, innovation, creativity and potential of our next generation! #CollegeForAll https://t.co/wL…", "date": "2019-07-23 15:04:41"}, "356": {"text": "Teachers are facing outrageous levels of student debt. It is time to cancel student debt for all and make public universities and colleges tuition-free. @Ilhan, @RepJayapal and I are incredibly proud to have the support of @rweingarten and @AFTUnion in this effort. #CollegeforAll https://t.co/ePldyaJed4", "date": "2019-07-23 14:27:29"}, "357": {"text": "Hundreds of thousands of people in Puerto Rico are demonstrating against corruption, Wall Street-imposed austerity, and decades of economic devastation. We stand with them: Governor Rossello must resign. Puerto Rico needs new leadership and a new direction. https://t.co/KyT1LWhOy3", "date": "2019-07-23 01:22:23"}, "358": {"text": "Big Pharma lied about opioid addictiveness. And here they are, joking about their racket in these emails. Their greed has no limits. We must pass the Opioid Crisis Accountability Act to hold top executives criminally liable for the devastation they caused. https://t.co/RGJdlyO7PY", "date": "2019-07-22 22:01:00"}, "359": {"text": "Does Donald Trump want a war with Iran? Who knows? Nobody in the world knows what they'll do tomorrow. And given the confusion in this administration, it’s possible they may. \n\nBut this I do know: The United States Congress must do everything it can to prevent this war.", "date": "2019-07-22 20:41:32"}, "360": {"text": "Me uno al reclamo del pueblo boricua, que ha salido a la calle en un #ParoNacional, para exigir la renuncia inmediata del gobernador Ricardo Rosselló. Debemos garantizar el apoyo del gobierno federal en los esfuerzos de reconstrucción y recuperación de Puerto Rico.", "date": "2019-07-22 19:28:20"}, "361": {"text": "I stand with the people of Puerto Rico, who have taken to the streets for a national strike, to demand the immediate resignation of Governor Rosselló. We must ensure the full support of the federal government in the rebuilding and recovery of Puerto Rico.", "date": "2019-07-22 19:28:20"}, "362": {"text": "Bank of America, Citigroup, Goldman Sachs, JPMorgan Chase and Wells Fargo have all seen their tax rates go from 30 to 22 percent thanks to Trump's tax scam.  \n\nOur job: repeal it and tax Wall Street to cancel $1.6 trillion in student debt. https://t.co/hWpTYtZZca", "date": "2019-07-22 17:17:19"}, "363": {"text": "How is it that in the richest country in the history of the world, we can't afford to pay everyone a living wage? Until we raise the federal minimum wage to $15 an hour, I'm going to keep asking. https://t.co/djDvrQ2eTJ", "date": "2019-07-21 19:39:16"}, "364": {"text": "You want good, clean teeth? Simple: Brush your teeth, floss, and fight for Medicare for All. https://t.co/6BVEdHgYzY", "date": "2019-07-20 14:08:00"}, "365": {"text": "The window for meaningful climate action is closing. Our job: come together to take on the powerful fossil fuel industry and mobilize a national response as large and serious as the emergency itself. Our future depends on it. https://t.co/Sr7GnsM8RV", "date": "2019-07-19 21:38:53"}, "366": {"text": "Me uno al reclamo del pueblo boricua que salió a la calle a exigir la rendición de cuentas por parte del gobernador y el fin de la corrupción. Ante los huracanes y 10 años de austeridad, los boricuas tienen derecho a la democracia y a todo el apoyo federal para salir de la crisis", "date": "2019-07-19 19:57:08"}, "367": {"text": "⚠️The past 5 years are the hottest on record\n⚠️This June is the hottest June recorded\n⚠️Thousands die in heatwaves around the world\n\nTrump's ignorance is threatening the lives of our children. For their sake, we must stand up to the fossil fuel industry and build a green economy. https://t.co/kCe0KfZClg", "date": "2019-07-19 17:37:52"}, "368": {"text": "Mitch McConnell is wrong. Since 1979, when a state has increased the min. wage, employment and wages typically go up, not down. A $15 minimum wage would raise wages for 39 million people and lift millions of Americans out of poverty. Why is McConnell afraid to let us vote on it? https://t.co/CDraIzKFki", "date": "2019-07-18 22:55:52"}, "369": {"text": "I stand with the people of Puerto Rico taking to the streets to demand accountability for the governor and an end to corruption.\n\nAfter dealing with hurricanes and a decade of austerity, Puerto Ricans have a right to democracy and full federal support to get out of this crisis. https://t.co/sSUu0n09MY", "date": "2019-07-18 19:18:20"}, "370": {"text": "RT @SenSanders: If the Majority Leader wants to defend starvation wages to the people of Kentucky, that is his right. \n\nBut I say to Mitch…", "date": "2019-07-18 17:09:28"}, "371": {"text": "RT @fightfor15: BREAKING: Six years after the first #FightFor15 strike, the U.S. House just passed the #RaiseTheWage Act to increase the fe…", "date": "2019-07-18 16:54:09"}, "372": {"text": "Four years ago, @KeithEllison and I rallied with low wage workers for an increase in the federal minimum wage to $15 an hour.\n\nWe were laughed at. We were told it was unrealistic. We were told it wouldn't happen. \n\nNot anymore. https://t.co/UZLQvFPwHE", "date": "2019-07-18 16:53:47"}, "373": {"text": "After supporting a huge increase in military spending for the most dangerous president in American history, it would be outrageous for the House to approve a bill that would deny primary care to over 3 million Americans by cutting community health centers by 20% in real dollars. https://t.co/c6o1mavPFI", "date": "2019-07-18 15:29:13"}, "374": {"text": "Remember when $15 an hour was \"radical\"? Not so radical anymore thanks to people fighting for a living wage. In a historic vote today, the House of Representatives will pass legislation to end poverty wages for 33 million people. https://t.co/tS7u9zeBgf", "date": "2019-07-18 15:08:05"}, "375": {"text": "RT @SpeakerPelosi: .@HouseDemocrats are preparing to pass the first increase in the federal minimum wage in over a decade. #RaiseTheWage ht…", "date": "2019-07-18 14:44:06"}, "376": {"text": "RT @SSWorks: .@SenSanders is right. Medicare for All would improve and expand Medicare to cover dental, vision, &amp; all other necessary medic…", "date": "2019-07-18 14:35:15"}, "377": {"text": "#IStandWithIlhan and am proud to work with her in Congress. \n\nTrump is stoking the most despicable and disturbing currents in our society. And that very hatred and racism fuels him. We must fight together to defeat the most dangerous president in the history of our country.", "date": "2019-07-18 03:20:13"}, "378": {"text": "Exactly 50 years after the moon landing, we can again mobilize as a nation to overcome enormous challenges. We have no time to waste in taking on climate change, which is a true national emergency. Here's how @repblumenauer and I plan to tackle it: https://t.co/aPO6nUAIKq", "date": "2019-07-17 20:05:41"}, "379": {"text": "Not one major Wall Street executive went to jail for destroying the American economy. The criminal justice system is profoundly broken. https://t.co/hbSgxeM4za", "date": "2019-07-17 17:29:50"}, "380": {"text": "@aylaa_renee @hacketmale @SenatorLeahy @WelchForVT We are having a \"milk toast,\" the finest beverage of the great state of Vermont.", "date": "2019-07-17 17:26:39"}, "381": {"text": "RT @USProgressives: Tomorrow, Congress will vote to raise the minimum wage to $15 an hour. \n\nThis vote was built on years of work from #Fig…", "date": "2019-07-17 16:43:09"}, "382": {"text": "I congratulate my friend @SenatorLeahy for casting his 16,000th vote in the U.S. Senate! Senator Leahy has worked tirelessly for the people of Vermont since 1974, bringing our state's values of justice and openness to Washington. I look forward to continuing our work together. https://t.co/3aaIAZvG5X", "date": "2019-07-17 15:51:32"}, "383": {"text": "\"A democracy cannot function effectively when its constituent members believe laws are being bought and sold.\" This was Justice John Paul Stevens’ prophetic dissent against Citizens United. During his tenure on the Supreme Court, he was astute and fair. We will miss him.", "date": "2019-07-17 15:08:50"}, "384": {"text": "One might have thought given all the Republicans in the House and Senate, a vast number would be standing up and saying the president's racist comments do not reflect the views of their party. It is sad and disappointing the degree to which Trump's ideology has dominated the GOP.", "date": "2019-07-16 23:20:00"}, "385": {"text": "I am not interested in a photo op at an Amazon warehouse. I am calling for Labor Department inspectors to come in, unannounced, and do thorough investigations of the facilities where hundreds of workers have told me about horrendous conditions and abuse. https://t.co/OE76mJcjjs", "date": "2019-07-16 22:31:47"}, "386": {"text": "@halrudnick I must admit that today I felt the burn.", "date": "2019-07-16 22:25:47"}, "387": {"text": "The grassroots of our country came together and got the Congress to pass a bipartisan prohibition on unconstitutional war with Iran. Given the recklessness of this administration, I intend to do everything I can in the Senate to get this passed. No war with Iran! https://t.co/05FNsGx5fu", "date": "2019-07-16 21:16:50"}, "388": {"text": "Amazon #PrimeDay sales are nice, but not if they come at the expense of worker safety. The Department of Labor must #InvestigateAmazon. https://t.co/LNgoi1XuFB", "date": "2019-07-16 20:35:16"}, "389": {"text": "RT @Ilhan: Amazon workers fear taking bathroom and water breaks for fear of retaliation. \n\nThere are multiple reports of deaths of Amazon w…", "date": "2019-07-16 19:19:12"}, "390": {"text": "RT @MaxZahn_: Thirteen Congresspeople, including @SenSanders @AOC @IlhanMN, sent a letter calling on the Dept. of Labor to \"immediately inv…", "date": "2019-07-16 19:17:44"}, "391": {"text": "I believe, with @IlhanMN and my colleagues, that a complete investigation by @OSHA_DOL into Amazon warehouses is long overdue. The reports of dangerous, dehumanizing conditions—where 125,000 Americans are working for the wealthiest man in the history of the world—are sickening. https://t.co/QY9GJT4mTk", "date": "2019-07-16 18:20:26"}, "392": {"text": "Climate change is an existential disaster facing the entire world. We should start acting like it. https://t.co/p11YE61HHx", "date": "2019-07-15 20:37:19"}, "393": {"text": "I stand in solidarity with the courageous Amazon workers engaging in a work stoppage against unconscionable working conditions in their warehouses. It is not too much to ask that a company owned by the wealthiest person in the world treat its workers with dignity and respect. https://t.co/GxagHx70pb", "date": "2019-07-15 16:21:33"}, "394": {"text": "This is how we defeat Donald Trump's disgraceful bigotry and xenophobia. When billionaires use racism to divide us, we build solidarity among working people—immigrants and non-immigrants, gay and straight, men and women, black and brown and white. https://t.co/HkC77UOyWA", "date": "2019-07-15 15:10:07"}, "395": {"text": "RT @AyannaPressley: THIS is what racism looks like. WE are what democracy looks like. And we’re not going anywhere. Except back to DC to fi…", "date": "2019-07-15 14:59:19"}, "396": {"text": "The American people are sick and tired of a president who is a liar, a fraud, a narcissist and a bully, @realDonaldTrump. They want leadership which unites us, not divides us. https://t.co/ra1L8ZtR11", "date": "2019-07-14 17:47:34"}, "397": {"text": "We must oppose Mr. Trump's nightmarish mass-deportation plans. We must stop family separation, reunite families that have been separated, and eliminate private detention facilities. Know your rights. Conozca sus derechos. https://t.co/sNKTOyhB0B", "date": "2019-07-13 19:00:00"}, "398": {"text": "The time is long overdue for comprehensive and humane reform of our immigration system. These members of Congress went to the Southern border to go inside detention facilities operated by the Trump administration. What they saw horrified them. https://t.co/U468x75XPQ", "date": "2019-07-13 17:16:51"}, "399": {"text": "Appalachians deal with dirty air and water because of the coal industry's greed. They are standing up and fighting back. @NRDems and I are committed to working with these communities to build just and healthy local economies as we tackle the climate crisis.https://t.co/nBRBBudWDB", "date": "2019-07-13 16:22:06"}, "400": {"text": "Throughout our history, the Postal Service and its unions have been vital institutions providing a pathway into the middle class for working families, particularly communities of color. I stand with @mrdannyglover: we will not allow @USPS to be privatized. https://t.co/weddvvVH1f", "date": "2019-07-12 20:49:51"}, "401": {"text": "Alex Acosta should never have been nominated as Labor Secretary. Now is the time to put an end to our two-tiered criminal justice system. We need a Labor Secretary who puts workers first, not billionaires—and certainly not billionaire sexual predators of underage girls. https://t.co/BMhyJ4QGTO", "date": "2019-07-12 15:22:00"}, "402": {"text": "Donald Trump doesn’t give a damn about the working people of America. His singular aim is to help his billionaire friends make as much money as possible. We need to take on the pharmaceutical industry whose greed is killing Americans and lower the price of medicine in half. https://t.co/DESxTkyE1o", "date": "2019-07-12 13:58:03"}, "403": {"text": "This is what strong oversight is about. The House is reclaiming its authority over war and blocking U.S. tax dollars from going to Saudi bombings in Yemen. Today's vote should make Donald Trump take a hard look at the despotic regime he loves so much. https://t.co/JpClkYOuVW", "date": "2019-07-11 23:07:25"}, "404": {"text": "RT @RepRoKhanna: The only way to prevent the starvation of millions of Yemenis is to end the war.  The US cannot be an effective broker for…", "date": "2019-07-11 22:26:35"}, "405": {"text": "I applaud the House of Representatives for voting to end all U.S. participation in the disastrous Saudi-led war in Yemen. Congress has the power to end this brutal, unconstitutional military intervention. I will do everything in my power in the Senate to see that it becomes law.", "date": "2019-07-11 21:22:21"}, "406": {"text": "Congratulations to the University of Texas for expanding access to tuition-free college! This is a step in the right direction. \n\nOur plan: tax Wall Street, raise $2.4 trillion, cancel student debt, and eliminate tuition at every public college and university for all students. https://t.co/wWZoylmRgG", "date": "2019-07-11 20:12:35"}, "407": {"text": "You can call me a lot of things but you cannot call me inconsistent. Our country must join every other major nation of the world and guarantee health care as a human right. \n\nI hope we are not going to keep debating this for another 50 years. #MedicareforAll https://t.co/aCJPRYfq5P", "date": "2019-07-11 15:07:30"}, "408": {"text": "RT @SenSanders: If ICE agents show up at your door, know your rights.\nSi agentes del ICE llegan a tu puerta, conoce tus derechos. https://t…", "date": "2019-07-11 14:33:57"}, "409": {"text": "RT @RepBonamici: The #ClimateCrisis is an existential threat to our planet. I've joined @repblumenauer, @AOC, and @SenSanders in supporting…", "date": "2019-07-11 13:18:05"}, "410": {"text": "RT @RepJoeNeguse: I'm proud to join @AOC @repblumenauer @SenSanders and several others on a joint resolution to declare a climate emergency…", "date": "2019-07-11 02:27:57"}, "411": {"text": "I agree with Senator Cruz. Congress already blocked weapons sales to the authoritarian regime of Saudi Arabia. \n\nMr. President: follow the damn law. https://t.co/LevCWPqMb5", "date": "2019-07-11 00:14:25"}, "412": {"text": "These incredible high schoolers are working to stop the unconstitutional U.S.-Saudi war in Yemen. They know Congress has the power of the purse. A new effort by @RepRoKhanna, @RepAdamSchiff, @RepAdamSmith and @RepJayapal will defund Trump's participation in this brutal conflict. https://t.co/ofypUffQn7", "date": "2019-07-10 18:57:45"}, "413": {"text": "Climate disasters that can cause death, displacement and suffering—unprecedented heatwaves, storms, and flooding—now occur at a rate of one per week.\n \nIf that is not an emergency, I don't know what is. https://t.co/ncxdJjapBP", "date": "2019-07-10 15:59:17"}, "414": {"text": "RT @MarkRuffalo: #ClimateChange is an emergency, full stop. This isn’t a partisan issue. All representatives should be treating Climate Cha…", "date": "2019-07-10 15:21:03"}, "415": {"text": "RT @RepRoKhanna: My #NDAA Amendment will end all US support for the Saudi/UAE war in Yemen. If we cut off spare part transfers to the Saudi…", "date": "2019-07-10 14:12:05"}, "416": {"text": "Happy #CowAppreciationDay. https://t.co/cIBYktvsu2", "date": "2019-07-09 22:14:37"}, "417": {"text": "RT @SenateDems: Today, Republican AGs, supported by President Trump &amp; the Department of Justice, are making the case in court that millions…", "date": "2019-07-09 22:02:26"}, "418": {"text": "Republicans are still trying to eliminate the Affordable Care Act. They couldn't do it through Congress because the American people rose up. Now they are going through the courts. Our job: keep up the pressure and stop them from kicking millions of people off their health care. https://t.co/vDN49S7SmX", "date": "2019-07-09 20:50:46"}, "419": {"text": "After the Pearl Harbor attacks, America came together and in three years mobilized for victory in World War II. \n\nToday, Congress must lead a national mobilization to take on the fossil fuel industry, transform our economy, and defeat a climate emergency. https://t.co/b3B2RvSEEL", "date": "2019-07-09 20:16:29"}, "420": {"text": "RT @RepRoKhanna: Global warming is a national emergency, and it’s long past time the United States Congress declared it one. Bold action wo…", "date": "2019-07-09 19:34:38"}, "421": {"text": "Ross Perot was a champion for veterans' rights and ahead of his time on disastrous trade policies. During his campaign, he explained, in depth, how he would address our national problems and spurred serious discussion. Ross Perot was a one-of-a kind American. He will be missed. https://t.co/qXukirfwcL", "date": "2019-07-09 18:47:39"}, "422": {"text": "RT @CJAOurPower: Frontline communities recognize that the #ClimateCrisis is here and now; we can’t wait 10 years to address it. @CJAOurPowe…", "date": "2019-07-09 17:47:01"}, "423": {"text": "RT @AOC: Today I am joining @repblumenauer and @SenSanders in pushing Congress to acknowledge the climate emergency.\n\nThe US isn’t leading…", "date": "2019-07-09 17:04:12"}, "424": {"text": "RT @repblumenauer: Today, @AOC, @SenSanders, and I unveiled our resolution to declare a #ClimateEmergency. This is about telling the truth…", "date": "2019-07-09 17:03:47"}, "425": {"text": "RT @MotherJones: On Tuesday, Reps. Earl Blumenauer and Alexandria Ocasio-Cortez in the House, along with Sen. Bernie Sanders in the Senate,…", "date": "2019-07-09 15:43:49"}, "426": {"text": "I am proud to stand with @AOC and @repblumenauer today to announce our resolution declaring a climate emergency. \n\nIf Trump insists on denying the reality of climate change, Congress must act to mobilize America and defeat this existential threat. https://t.co/lTHAclxJyV", "date": "2019-07-09 15:06:29"}, "427": {"text": "Every time a minimum wage increase has been proposed, the extreme right wing and their billionaire campaign contributors claim that jobs will be destroyed. \n\nThey have been proven dead wrong. It is time to raise the minimum wage to at least $15 an hour. https://t.co/4d2WSrdX8u", "date": "2019-07-09 02:50:35"}, "428": {"text": "President Trump’s record on the environment is pathetic and an embarrassment to the world. This is a man who still thinks climate change is a \"hoax.\" He better start listening to scientists and not his friends in the fossil fuel, chemical, and big agribusiness industries. https://t.co/pR2StqgPsh", "date": "2019-07-08 19:46:24"}, "429": {"text": "In the richest country in the history of the world, no one should be living in poverty. It’s time to raise the current starvation level minimum wage to a living wage. It's time for Congress to pass the Raise the Wage Act to increase the federal minimum wage to $15 an hour. https://t.co/RRhqHZfOnr", "date": "2019-07-08 19:31:22"}, "430": {"text": "The United States is the wealthiest country on earth. Our parents and our children deserve paid parental leave. If every other major country can do it, why can't we? https://t.co/AdtMyndfSZ", "date": "2019-07-08 18:42:00"}, "431": {"text": "We spend less than 2.5% of our gross domestic product each year on infrastructure, while Europe spends double that rate and China four times as much.\n\nWhy do we spend trillions on never ending wars but can't afford to rebuild our crumbling infrastructure? https://t.co/d1G2HGuiIH", "date": "2019-07-08 18:34:50"}, "432": {"text": "Millions of people are raising money on GoFundMe right now to fund their health care and life-saving medication. To my mind, that is not a functioning health care system. We must pass Medicare for All. https://t.co/S6sGTj0qau", "date": "2019-07-06 21:00:00"}, "433": {"text": "Let’s cancel $1.6 trillion in student debt and make public universities tuition-free instead. https://t.co/w1eG8dAGUa", "date": "2019-07-06 17:49:30"}, "434": {"text": "It was 115 degrees Fahrenheit in France last week – the highest temperature they have ever recorded.\n \nStill think climate change is a hoax, @realDonaldTrump? You are delusional.\nhttps://t.co/FSFH8kV4YX", "date": "2019-07-05 16:31:43"}, "435": {"text": "Wishing you and your loved ones a very safe and happy 4th of July. https://t.co/pWWfiMACoz", "date": "2019-07-04 13:56:23"}, "436": {"text": "I’m sure this will come as a big surprise to you: Trump’s phony rhetoric did nothing to stop skyrocketing drug prices.\n \nWe need a president who will stand up to the greed of Big Pharma instead of appointing a pharma CEO to \"oversee\" that very industry. https://t.co/rFGEQYaicr", "date": "2019-07-03 18:57:54"}, "437": {"text": "This is what authoritarians do: @realDonaldTrump is taking $2.5 million away from our National Park Service to glorify himself with a spectacle of military tanks rolling through Washington. And top GOP donors are getting VIP seats, all at taxpayer expense. https://t.co/8vchmDxX8W", "date": "2019-07-03 17:30:26"}, "438": {"text": "Here is what we need to do: Convene the countries of this hemisphere to address the violence and deprivation that is prompting people to flee their own countries. As neighbors, we can solve these problems together. https://t.co/jJW6LagSgM", "date": "2019-07-02 22:25:28"}, "439": {"text": "We must stop family separation; reunite families that have been separated; end detention of families, children and anyone who doesn't pose a danger; eliminate private detention facilities; and protect asylum seekers. We also must oppose Trump's nightmarish mass-deportation plans.", "date": "2019-07-02 22:25:27"}, "440": {"text": "Racist and sexist behavior on the part of those who wear a uniform of the United States is completely unacceptable.\n\n@DHSgov must investigate and take strong action against those found guilty of this vulgar behavior. https://t.co/ICF5LZUY3Y", "date": "2019-07-02 22:25:27"}, "441": {"text": "Make no mistake: this is a major victory for democracy and a defeat for the xenophobic Trump Administration. The Census is supposed to count everyone, including immigrants. When we stand together and fight back, we can defeat Trump's bigotry. https://t.co/9rTGEuhFtG", "date": "2019-07-02 22:15:15"}, "442": {"text": "Over the last decade, workers’ wages barely kept up with inflation, while the number of billionaires in the United States more than doubled. The top 1% owns more wealth now than before the 2008 financial crash. \n\nThis is what a rigged economy looks like: https://t.co/2R6hmgXfoH", "date": "2019-07-02 21:41:07"}, "443": {"text": "Racist and sexist behavior on the part of those who wear a uniform of the United States is unacceptable. The DHS must investigate and take strong action against those found guilty of this vulgar behavior. https://t.co/v9aNeCUNvt", "date": "2019-07-02 14:33:15"}, "444": {"text": "This is the point of canceling student debt and providing free college for all. Education should be treated as a public right, enjoyed by everyone—not a luxury afforded to the few. https://t.co/PwjcT769mW", "date": "2019-07-01 19:45:27"}, "445": {"text": "Trump promised he would stop big drug companies from \"getting away with murder.\" He lied.\n\nMy bill with @RepRoKhanna stops Big Pharma's greed by cutting prescription drug prices in half so that Americans no longer pay the highest prices in the world. https://t.co/QwxxuEp48i", "date": "2019-07-01 18:12:36"}, "446": {"text": "I have no problem with Trump negotiating with Kim Jong Un. But while he's meeting with Kim, he's pushed us to the brink of war with Iran, and kept us in the horrific Saudi-led war in Yemen. \n\nWe can't just have photo opportunities. We need real diplomacy. https://t.co/PeRUjYlKRn", "date": "2019-07-01 15:35:43"}, "447": {"text": "@david_l_alvarez Thank you. My condolences and thoughts are with you and your family. Your father is an example of what America is all about.", "date": "2019-06-29 20:54:10"}, "448": {"text": "Today, we mourn the loss of Luis Alvarez, a champion for the health of 9/11 first responders, and one of the selfless men and women who searched for survivors at Ground Zero. \n\nWe must build a society where we take care of each other and treat heath care as a human right. https://t.co/lB1bBgzaGh", "date": "2019-06-29 16:34:03"}, "449": {"text": "Fifty years after the Stonewall Uprising, let us reflect on how the struggle for justice, dignity and equality is advanced. #Stonewall50 https://t.co/QwE6mwVW8z", "date": "2019-06-29 15:52:28"}, "450": {"text": "Today, I stood with a majority of my Senate colleagues who voted to uphold the rule of law. The Constitution and the War Powers Act are perfectly clear: President Trump cannot go to war with Iran without congressional authorization. https://t.co/2XnE2eOl3p", "date": "2019-06-28 19:58:45"}, "451": {"text": "I am proud that @NEAToday, which represents 3 million educators, supports our College for All Act. Canceling student debt lets more people to follow their passion to teach in public school. And tuition-free college and trade school ensures education as a right, not a privilege. https://t.co/E7kJWczWfC", "date": "2019-06-28 15:54:35"}, "452": {"text": "RT @SenSchumer: It’s an honor to preside in the Senate today\n\nWe’re voting to prohibit @realDonaldTrump and the Defense Department from usi…", "date": "2019-06-28 15:44:24"}, "453": {"text": "I agree: \"To some, this will appear too radical. To us, College for All is the bold solution we need. It is high time we enacted policies that benefit the real job creators—the ones on Main Street.\" https://t.co/xb4ZjlVWM6", "date": "2019-06-27 13:58:24"}, "454": {"text": "I thank these 100 scholars for supporting our College For All Act. Young people face lower living standards than their parents enjoyed. We must act boldly and decisively to wipe out student debt and make education a right—and Wall Street will pay for it. https://t.co/X1UvhVcwMH", "date": "2019-06-27 13:45:33"}, "455": {"text": "You've got questions—@RepJayapal, @Ilhan and I have got answers. How do we cancel $1.6 trillion in student debt? We pay for it in a very simple way: a small tax on Wall Street speculation. This is not a \"radical\" idea. https://t.co/jNDX0bZVCm", "date": "2019-06-26 22:42:55"}, "456": {"text": "RT @LGBTEqCaucus: Today is #LGBTQEqualityDay—a day that has seen #SCOTUS hand down 3 landmark victories for LGBTQ Americans:\n\n🏳️‍🌈Decrimina…", "date": "2019-06-26 21:06:15"}, "457": {"text": "Are you a student or recent graduate? Apply for a paid internship in Senator Sanders' Burlington and Washington, D.C. offices by June 30. https://t.co/EPSZUJsFvB", "date": "2019-06-26 20:59:56"}, "458": {"text": "These deaths are what a broken immigration system is all about. Instead of demonizing immigrants, Trump should be meeting with Central American leaders to find ways to end the horrific violence and poverty that are forcing people to flee their homelands. https://t.co/sCACYzMJFp", "date": "2019-06-26 20:33:30"}, "459": {"text": "RT @AOC: The student loan crisis is keeping people from:\n📈 Becoming teachers &amp; other public careers\n📈 Buying homes &amp; large purchases\n📈 Star…", "date": "2019-06-26 19:05:27"}, "460": {"text": "RT @JimmyGomezCA: Medicare for All is a statement of values that we are all one country, and that we all deserve to be healthy. That is why…", "date": "2019-06-26 16:22:38"}, "461": {"text": "As a child, @RepJimmyGomez grew up without health insurance. Today he is calling for Medicare for All to guarantee health care to every person, so that no one has to go through what his family did. https://t.co/WQwqqzn6cp", "date": "2019-06-26 14:38:05"}, "462": {"text": "Here's how we do it: https://t.co/gd3TPjxH1a", "date": "2019-06-25 23:54:43"}, "463": {"text": "Cancel all of it. https://t.co/0gyMBUEhgX", "date": "2019-06-25 18:25:32"}, "464": {"text": "RT @AFTunion: “We have a crisis here of immense proportions.\" -  @rweingarten at yesterday's #CancelStudentDebt event with @SenSanders  @Re…", "date": "2019-06-25 18:17:56"}, "465": {"text": "El Congreso asignó fondos para asistencia nutricional de emergencia hace semanas. Mientras los puertorriqueños pasan hambre, @USDA, @SecretarySonny, @OMBPress, y @MickMulvaneyOMB mantienen esta ayuda en el limbo burocrático. ¡La administración debe proveer estos fondos ahora!", "date": "2019-06-25 17:07:07"}, "466": {"text": "RT @RepRoKhanna: The 2001 AUMF does not cover an attack against Iran. \n\nThe president has to come to congress before engaging in that kind…", "date": "2019-06-25 14:59:10"}, "467": {"text": "\"I know smart, talented, debt-laden millennials who graduated into a post-Great Recession job market so mean and miserly that it literally had them eating out of Dumpsters.\" #CancelStudentDebt https://t.co/aTnRau0iEJ", "date": "2019-06-25 14:28:43"}, "468": {"text": "I don't often use this phrase, but today, we offered a truly revolutionary proposal to transform and improve our country in many ways. \n\nAll of our people regardless of income deserve the education they need. #CollegeForAll #CancelStudentDebt https://t.co/wyGR7438TH", "date": "2019-06-25 01:47:27"}, "469": {"text": "RT @RepJayapal: As a nation, we are killing ourselves by draining the enthusiasm, innovation, creativity and potential of our next generati…", "date": "2019-06-25 00:56:01"}, "470": {"text": "We are saying that all public colleges and universities should be tuition-free and debt-free for ALL Americans. \n\nAll Americans are entitled to Social Security.\nAll Americans are entitled to health care.\nAll Americans are entitled to education as a right.", "date": "2019-06-24 21:40:33"}, "471": {"text": "I believe in universality. That means if Trump wants to send his grandchildren to public school, he has that right. Wealthy kids go to public school right now. At the same time, we will make Wall Street, the top 1% and large corporations start paying their fair share of taxes. https://t.co/IpQt10d5zC", "date": "2019-06-24 21:31:19"}, "472": {"text": "I agree with Harvard Business School professor Marco Di Maggio. Lifting the burden of student loans allows people to make better decisions, feel more freedom to make changes in their careers, and spend more money, which goes back into the economy. https://t.co/B7quhAhCp9", "date": "2019-06-24 20:16:20"}, "473": {"text": "Thank you to @RepJayapal and @Ilhan for your bold leadership as co-sponsors of college for all and debt cancellation in the U.S. House.\n\nTo tax Wall Street and stop the student debt crisis, we need a movement. Working together, we will #CancelStudentDebt for 45 million Americans. https://t.co/xCp8veCQRe", "date": "2019-06-24 18:23:09"}, "474": {"text": "Congress passed emergency nutrition assistance for Puerto Rico weeks ago. While Puerto Ricans are going hungry, @USDA, @SecretarySonny, @OMBPress, and @MickMulvaneyOMB are holding the funds in red tape limbo. The administration should immediately release these funds. https://t.co/zuv3fHJWPM", "date": "2019-06-24 17:26:04"}, "475": {"text": "Student debt disproportionately impacts African Americans and Latinos. 12 years after starting college, the median Black borrower owes more than he or she has taken out in the first place. \n\nCanceling student debt is an act of racial and economic justice. https://t.co/9dQs7TE0CK", "date": "2019-06-24 16:20:25"}, "476": {"text": "RT @Nightline: NEW: Sen. Bernie Sanders details plan to cancel $1.6 trillion in student debt for everyone, saying the plan ends \"the absurd…", "date": "2019-06-24 16:09:20"}, "477": {"text": "RT @Ilhan: 👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽\n👏🏽CANCEL👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽\n👏🏽👏🏽👏🏽STUDENT👏🏽👏🏽👏🏽👏🏽👏🏽\n👏🏽👏🏽👏🏽👏🏽DEBT👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽\n👏🏽#CancelStudentDebt👏🏽👏🏽👏🏽👏🏽…", "date": "2019-06-24 16:02:12"}, "478": {"text": "My colleagues @RepJayapal and @Ilhan are joining me to answer your questions on how we will #CancelStudentDebt. \n\nHow does it work? How is it paid for? This is a crisis that we can solve if we have the political will. Watch live: https://t.co/78BxIr1MhY", "date": "2019-06-24 16:00:35"}, "479": {"text": "I am going to make a prediction. The major opponents of our legislation to cancel $1.6 trillion in student debt—mark my words—will be the exact same people who said we had to bail out Wall Street to the tune of billions upon billions of dollars. https://t.co/kFv0scUydu", "date": "2019-06-24 15:50:55"}, "480": {"text": "RT @adamkelsey: “Bottom line is we should not be punishing people for getting a higher education — it’s time to hit the reset button,” @Sen…", "date": "2019-06-24 15:45:47"}, "481": {"text": "RT @tictoc: .@AOC calls student debt a \"systemic threat that is grinding the U.S. economy to a halt,\" alongside @IlhanMN, @RepJayapal and @…", "date": "2019-06-24 15:45:01"}, "482": {"text": "RT @AFTunion: .@RepJayapal: “The college affordability crisis isn’t just about tuition.” It increases funding for work study, Pell Grants,…", "date": "2019-06-24 15:44:45"}, "483": {"text": "I am introducing legislation to tax Wall Street and eliminate the student debt of more than 40 million Americans with @RepJayapal and @Ilhan. It is time to #CancelStudentDebt. Watch LIVE now: https://t.co/ZvSGQtRqEd", "date": "2019-06-24 15:08:10"}, "484": {"text": "During the financial crisis, Wall Street received the largest taxpayer bailout in American history. Now it is Wall Street’s turn to help rebuild the disappearing middle class. #CancelStudentDebt", "date": "2019-06-24 14:15:18"}, "485": {"text": "RT @SSWorks: Very true! And it shouldn't prevent them from enjoying a secure retirement. \n\nRight now hundreds of thousands of seniors are h…", "date": "2019-06-24 14:09:10"}, "486": {"text": "RT @DonniTurner1: .@SenSanders, @RepJayapal &amp; @Ilhan will introduce college affordability bills in the Senate and House on Monday, June 24,…", "date": "2019-06-24 14:08:52"}, "487": {"text": "The United States once led the world in the percentage of young college graduates. Today, we are in 11th place, one in every four Americans has student debt, and 40 percent of all borrowers are expected to default by 2023. #CancelStudentDebt https://t.co/L1WlmUWNUj", "date": "2019-06-24 13:14:35"}, "488": {"text": "This is truly a revolutionary proposal:  all Americans will get the college education or job training they need, while having all student debt forgiven. \n\nWe bailed out Wall Street in 2008. It’s time to tax Wall Street’s greed to help the American people. https://t.co/J4jqrRbLx3", "date": "2019-06-24 04:43:44"}, "489": {"text": "RT @Ilhan: I am one of the 45 million people with student debt—45 million people who are held back from pursuing their dreams because of th…", "date": "2019-06-24 02:16:34"}, "490": {"text": "This school teacher is one of many millions of Americans who is being crushed by insurmountable student debt. More than 1 million people default on their student loans each year. We have got to make public colleges and universities tuition-free. https://t.co/CRd3jhKpAj", "date": "2019-06-23 17:23:40"}, "491": {"text": "RT @RepJayapal: Education is a right, not a privilege. Share your personal story in a video or tweet with the hashtag #CollegeforAll and le…", "date": "2019-06-23 15:31:28"}, "492": {"text": "Wealthy TV \"experts\" are shaming millennials for buying coffee and avocado toast. But young people are broke because they’re drowning in debt and low wages.\n \nThe ruling class wants to divide the young and old to distract us from an economy that’s rigged for the richest 1%. https://t.co/v4LCNpoExU", "date": "2019-06-23 12:28:00"}, "493": {"text": "RT @RoKhanna: Since 1987 when adjusting for inflation, the % increase in:\n\n➡️ Tuition costs at public universities : 183%\n➡️ Tuition costs…", "date": "2019-06-22 17:17:25"}, "494": {"text": "Nearly half of all college students are going hungry and the average college senior takes on $30,000 in debt.\n \nBut let's go beyond statistics. Share your personal story in a video or tweet, with the hashtag #CollegeForAll. And tell me what we should be doing to fix this crisis.", "date": "2019-06-22 16:57:53"}, "495": {"text": "If ICE agents show up at your door, know your rights.\nSi agentes del ICE llegan a tu puerta, conoce tus derechos. https://t.co/m3UlUjoR4B", "date": "2019-06-21 20:52:30"}, "496": {"text": "Let us not kid ourselves. It is very easy for politicians like Trump to pound the table and talk about how tough they are. But it will not be the sons and daughters of billionaires who get killed in a war with Iran. It will be the working class kids of this country. https://t.co/nddNHpivKh", "date": "2019-06-21 16:22:41"}, "497": {"text": "A war with Iran would be a disaster and lead to endless conflict in the region. Congress must assert its constitutional authority and stop Trump from going to war. https://t.co/9gMcxV9UOl", "date": "2019-06-21 13:08:53"}, "498": {"text": "The president must respect the will of the majority of the Senate, which voted today to block weapons from being transferred to the brutal Saudi dictatorship. The Saudis are using U.S.-made bombs to kill people in Yemen and creating a horrific humanitarian disaster. https://t.co/GycM8fIgXk", "date": "2019-06-20 22:17:28"}, "499": {"text": "The insurance industry is mounting a multi-million dollar campaign against Medicare for All. They want you to believe that the Canadian health care system that guarantees health care to every man, woman and child in that country is a disaster.\n\nThey are dead wrong. https://t.co/tceJ9gMoiY", "date": "2019-06-20 21:16:11"}, "500": {"text": "Congratulations to the advocates who fought to pass this landmark bill to radically cut New York State’s carbon pollution and transform its energy system. This is a step in the right direction toward the type of bold action on climate change that we need. https://t.co/2DnsP61CLB", "date": "2019-06-20 20:24:16"}, "501": {"text": "This president is going to have to learn that he is not a dictator, that there is a Constitution and a separation of powers in this country. https://t.co/pEcIFVqJtY", "date": "2019-06-20 17:43:54"}, "502": {"text": "If you think the invasion of Iraq was a disaster, a war with Iran would be worse. The United States must bring Iran and Saudi Arabia to the negotiating table, not foment a never-ending, unconstitutional war in the region. https://t.co/kirVfPZb7T", "date": "2019-06-20 16:28:14"}, "503": {"text": "This is outrageous. President Trump’s proposal to repeal the Clean Power Plan is a stark reminder that instead of worrying about the future of our planet, he is more concerned with protecting the interests of his friends in the fossil fuel industry. https://t.co/bzKQ6zHvuE", "date": "2019-06-20 15:35:00"}, "504": {"text": "RT @RepRoKhanna: Khashoggi was murdered for one reason: he spoke out against the atrocities in Yemen. Our own CIA documented that very fact…", "date": "2019-06-20 14:06:55"}, "505": {"text": "The only thing Medicaid work requirements are good at is kicking people off their coverage. \n\nIf the GOP wants to help people find work, they should invest in employment programs and guarantee health care as a right—not punish people who are struggling. https://t.co/BjAVgI3SWg", "date": "2019-06-19 22:05:21"}, "506": {"text": "Representative Jayapal is exactly right. There is no such thing as a limited nuclear war. The $13 billion cost of this nuclear weapon would be much better spent fighting poverty and rebuilding the middle class. Thank you for standing up to the military industrial complex. https://t.co/JB2kJ3a4Up", "date": "2019-06-19 21:19:55"}, "507": {"text": "A new United Nations report confirms what the CIA said: Saudi crown prince Mohammed bin Salman ordered the murder of Jamal Khashoggi. It is time for the United States to reevaluate our relationship with this brutal regime, including ending support for the catastrophic Yemen war. https://t.co/s7kXBuc7Nj", "date": "2019-06-19 19:44:52"}, "508": {"text": "RT @thehill: Danny Glover speaks at hearing on reparations: \"I sit here as the great great grandson of former slave -- Mary Brown -- who wa…", "date": "2019-06-19 19:39:56"}, "509": {"text": "RT @CarmenYulinCruz: Met with @SenSanders to discuss his legislation to save 900k people in Puerto Rico from loosing their Medicare benefit…", "date": "2019-06-19 19:16:59"}, "510": {"text": "I'm proud to celebrate #Juneteenth with @MrDannyGlover. This year's holiday takes on special significance because of today's House hearing on H.R. 40 to study the impacts of slavery. We must come to terms with slavery's horrors and how they affect every aspect of our lives today. https://t.co/WXfqO5s4oN", "date": "2019-06-19 17:02:29"}, "511": {"text": "The president won't address our health care crisis or climate change. But he will try to divide us up and go after undocumented people who have very little political power. That is what demagogues always do and that is why he must be defeated. https://t.co/63c26Aeobg", "date": "2019-06-18 23:17:08"}, "512": {"text": "Mr. President: Respect the Constitution. You have no legal authority to launch an attack on Iran. Come to Congress, present your evidence, and make your case. If not, we will assert our power under the War Powers Act to stop you. https://t.co/PZ1XfQkX68", "date": "2019-06-18 21:35:56"}, "513": {"text": "Itta Bena, Mississippi is a \"banking desert\" where residents are without basic banking services. This is why @AOC and I are calling for the return of postal banking in the United States. The big banks of this country are preying on poor people or ignoring them completely. https://t.co/GfuDMaDFGG", "date": "2019-06-18 20:51:02"}, "514": {"text": "It’s a national disgrace that a minimum wage worker cannot afford a modest one-bedroom apartment in 99% of counties in America. All Americans have a right to a decent, affordable home. https://t.co/4542io2Pxu", "date": "2019-06-18 17:10:54"}, "515": {"text": "Hoping for a full recovery for Red Sox great David \"Big Papi\" Ortiz, one of the most outstanding and popular baseball players in recent memory.", "date": "2019-06-18 13:44:53"}, "516": {"text": "Blackrock's role in destroying our planet is unacceptable. Our future is not in fossil fuel investments. Our future is shifting to sustainable energy, creating millions of jobs, leading the world in new technology and leaving our children a clean environment. https://t.co/bFClSbimw5", "date": "2019-06-18 12:00:01"}, "517": {"text": "“It’s demeaning. It’s demoralizing. It’s unjust.” That's what a rigged political system looks like. As a House member in 1999, I led a trip to Canada to buy cheaper drugs. Twenty years later, people are still organizing 'caravans' to buy insulin they need. https://t.co/S8fuCFwm9e", "date": "2019-06-17 21:54:56"}, "518": {"text": "While CEO pay has exploded, the minimum wage has lost more than 15 percent of its value since the last time it was raised. This is a starvation wage for 40 million people and everyone knows it. \n\nCongress must stand with the working people of this country. #RaisetheWage https://t.co/o3YjbbOEmt", "date": "2019-06-17 18:59:48"}, "519": {"text": "This is not right: When it comes to who can afford to pay off their college debt and move on with their lives, there is a significant racial gap.\n \nOur job is to make public colleges tuition-free and substantially reduce student debt in this country. https://t.co/EhZRrpZaG5", "date": "2019-06-17 15:30:42"}, "520": {"text": "RT @WhipClyburn: Today marks the 4th anniversary of the devastating tragedy that was the Emanuel AME Church shooting. \n\nWhile we offer our…", "date": "2019-06-17 15:25:41"}, "521": {"text": "The Gulf of Oman incident must not be used as a pretext for war with Iran. War would be an unmitigated disaster for the United States, Iran, the region, and the world. A unilateral U.S. attack on Iran would be illegal and unconstitutional. https://t.co/D8QK7k50Ur", "date": "2019-06-14 19:28:27"}, "522": {"text": "America’s economic rise relied on treating Black people as literal property. We have not come to terms with the horrors of slavery and its continued impacts on our society. I am proud to cosponsor this bill to study and develop reparations proposals. https://t.co/j8BId5I4cV", "date": "2019-06-14 17:43:39"}, "523": {"text": "Climate change is one of the greatest threats to global security. As we see more drought, as poor people are not able to grow the food they need, there will be migrations of millions of people all over the world. That is why we need a Green New Deal. https://t.co/HFrX8WEtgP", "date": "2019-06-14 14:35:24"}, "524": {"text": "RT @MarkRuffalo: This war has killed 85,000 children. It’s an immoral and useless war. America should wash its hands of being Saudi Arabia’…", "date": "2019-06-14 02:42:56"}, "525": {"text": "\"I do not begrudge any pregnant person’s personal choice, whatever it is. That is, in fact, the whole point.\"\n\nI hope Americans who do not believe in abortion will consider this powerful op-ed by @RepJayapal. Abortion must remain a constitutional right. https://t.co/E11npbp3S8", "date": "2019-06-14 00:50:32"}, "526": {"text": "It is sick and disgraceful that pharmaceutical executives conspired to cover up their greedy price-fixing scheme when @RepCummings and I launched an investigation. They need to be investigated and held accountable by our criminal justice system. https://t.co/ENCUMmVA8a", "date": "2019-06-13 22:31:39"}, "527": {"text": "Donald Trump may not like it, but we are not an authoritarian country. The OSC recommendation is very clear: Ms. Conway must be removed from the federal government for violating the law. https://t.co/ctwBWzY71E", "date": "2019-06-13 18:29:22"}, "528": {"text": "Can you believe it? Amazon is issuing credit cards with 28% interest rates to \"help\" people with bad credit. This kind of greed makes the poor even poorer and @AOC and I intend to outlaw it. Corporations will have to survive on a 15% cap on interest rates. https://t.co/O3v1XOoMk3", "date": "2019-06-12 23:12:27"}, "529": {"text": "Three years ago, 49 people lost their lives in the Pulse nightclub shooting. It is absurd that we have not passed common sense gun safety legislation by now—all because the GOP is in the pocket of the NRA. My thoughts are with those who are remembering their loved ones today. https://t.co/tSTCkxAPnf", "date": "2019-06-12 21:18:46"}, "530": {"text": "Today is historic! The powerful House @WaysMeansCmte is holding a hearing on universal health care —a major step toward passing #MedicareforAll.\n\nWatch @RepJayapal and @RepDebDingell explain what this hearing means, and how we advance the fight for health care as a human right. https://t.co/DapiPXYqFj", "date": "2019-06-12 16:44:57"}, "531": {"text": "The internment of Japanese Americans is a stain on our history. It abhorrent that 75 years later, this administration now wants to hold migrant children in one of those same camps. \n\nWe will look back on Trump’s racist child prisons as an abomination. https://t.co/DOBxbhdrcd", "date": "2019-06-12 16:00:47"}, "532": {"text": "During his presidency, Lula da Silva oversaw huge reductions in poverty and remains Brazil’s most popular politician. I stand with political and social leaders across the globe who are calling on Brazil’s judiciary to release Lula and annul his conviction. https://t.co/dleejJoMaR", "date": "2019-06-12 14:00:15"}, "533": {"text": "Four million Americans live in Puerto Rico, Virgin Islands, Guam, and American Samoa. But their health care is not funded at the same level as the rest of the country.\n\nThese inequities cannot stand, and today, I am introducing new legislation to fix them. https://t.co/YMHsVdkR5i", "date": "2019-06-11 20:24:39"}, "534": {"text": "El pueblo boricua sigue enfrentándose a una crisis y merece recibir todos los fondos federales para la atención de salud basada en la necesidad. Ya llegó la hora de que EE.UU trate a la gente de Puerto Rico como ciudadanos, no como sujetos coloniales. https://t.co/LXteKYFpde", "date": "2019-06-11 19:35:51"}, "535": {"text": "I'm proud of my home state of Vermont for reaffirming the right to abortion, at a time when Roe v. Wade is under attack by right-wing extremists across the country.\n \nWe cannot go back to the days when women did not have the right to control their own bodies. https://t.co/EFNAasnXfo", "date": "2019-06-11 18:49:11"}, "536": {"text": "Very glad to do so. Health care is a human right. https://t.co/04Pe4LL6vz", "date": "2019-06-11 18:02:43"}, "537": {"text": "RT @LittleMissFlint: Give this kid his money back. No child should be covering lunch debt for his class with his allowance. https://t.co/tz…", "date": "2019-06-10 23:27:46"}, "538": {"text": "The Trump administration should start paying attention to the serious problems facing our country and let the people of the United Kingdom decide their own political future. https://t.co/7HuIwO214Y", "date": "2019-06-10 22:31:34"}, "539": {"text": "❌ Gut the Voting Rights Act\n❌ Cut early voting\n❌ Purge voter rolls\n❌ Close polling locations\n❌ Pass restrictive voter ID laws\n\nWhen I look at the Republican Party’s efforts to make it harder for people to vote, I have to wonder: Do they truly believe in democracy? https://t.co/9R45C2BQW6", "date": "2019-06-10 18:14:32"}, "540": {"text": "This is what oligarchy looks like. \n\nAmazon used its enormous wealth and power to kill a tax to build affordable housing in Seattle. One year later, thousands of people live on the streets, and the city continues to struggle with the crisis. https://t.co/rsUC12SBFm", "date": "2019-06-10 14:48:17"}, "541": {"text": "RT @CarmenYulinCruz: In SJ we just increased maternity leave from 3 to 6 months paid at 100%. It can be done. https://t.co/S1CQxIX8gI", "date": "2019-06-10 14:46:58"}, "542": {"text": "Thank you, Reginald Brown, for sharing your story. I am proud to stand with you to make sure we do not go backward on health care. We are fighting for Medicare for All to make sure that Reginald and every HIV-positive American can afford the lifesaving medicine they need to live. https://t.co/sYei9gIrsb", "date": "2019-06-09 19:13:30"}, "543": {"text": "We have got to end the embarrassment of being the only major country on Earth that does not guarantee paid leave. https://t.co/L8HO0LS61e", "date": "2019-06-09 15:05:04"}, "544": {"text": "RT @IlhanMN: Mental health is just as important as physical health; there should absolutely be mental health education in our schools. #Bla…", "date": "2019-06-08 15:45:35"}, "545": {"text": "If the Majority Leader wants to defend starvation wages to the people of Kentucky, that is his right. \n\nBut I say to Mitch McConnell: let the American people have a vote on a $15 minimum wage. https://t.co/Y203gOXKvO", "date": "2019-06-08 12:03:18"}, "546": {"text": "RT @MomsDemand: Today on National Gun Violence Awareness Day, Americans from coast to coast are wearing orange to honor victims and survivo…", "date": "2019-06-07 21:17:51"}, "547": {"text": "The Green New Deal is not only about saving our planet, it is about creating millions of jobs for the American people—family-sustaining, union jobs with benefits. Thank you, @SEIU. This is what leadership and solidarity are about. https://t.co/sI04RLVTPN", "date": "2019-06-07 21:02:51"}, "548": {"text": "Trump backs Saudi Arabia's war in Yemen and sells them bombs they drop on children. Now he wants @Raytheon to help Saudis develop their own weapons. Congress must stop this president from doing the bidding of the arms industry and this brutal regime. https://t.co/AHKt5PJWYf", "date": "2019-06-07 18:33:34"}, "549": {"text": "This is corruption in plain sight. Remember when Mr. Trump told us that he was going to drain the swamp? What a joke. https://t.co/bbvP3sqRe2", "date": "2019-06-07 17:04:19"}, "550": {"text": "As we come together to celebrate #NationalDoughnutDay, let me be perfectly clear: contrary to what you may hear from Fox News, Medicare for All will not limit your donut consumption.\n\nWe cannot glaze over the fact that America does not guarantee health care as a human right. https://t.co/gutPwnU0ji", "date": "2019-06-07 14:54:34"}, "551": {"text": "I want to applaud @RepJoeNeguse for this passionate defense of country's immigrants and Dreamers—kids who are American in every way but a piece of paper. https://t.co/rMS88FCDGg", "date": "2019-06-06 23:02:11"}, "552": {"text": "It's no secret the @SenateGOP does corporate America's bidding. Well, guess what? Thanks to workers standing up, Amazon and Disney now pay $15 an hour.\n\nSo I'm asking @Senatemajldr McConnell: if huge corporations can raise wages, why can't you? Let us vote on a $15 minimum wage. https://t.co/cJ1FdpYq5n", "date": "2019-06-06 21:27:36"}, "553": {"text": "RT @TransEquality: We were happy to work with @SenSanders on this video about the importance of the #EqualityAct!\n\nOne thing you can do rig…", "date": "2019-06-06 21:05:29"}, "554": {"text": "75 years ago at Normandy, the United States and its allies led the largest land invasion in history to help free Europe from Nazi barbarism. We will never forget the young people who gave their lives. We honor them by working toward a world of freedom, dignity and peace for all.", "date": "2019-06-06 18:53:34"}, "555": {"text": "RT @Public_Citizen: In 2018:\n\n-Big Pharma spent $281M lobbying to keep drug costs high\n\n-4 pharma companies made $7B off the GOP tax law\n\n-…", "date": "2019-06-06 17:46:13"}, "556": {"text": "Thousands of transgender individuals are often disrespected and denied health care services due to their gender identity. That’s unacceptable. The Equality Act is an important first step to ensure the transgender community gets the respect and dignity they deserve. #PrideMonth https://t.co/PQDZelKuvZ", "date": "2019-06-06 14:04:35"}, "557": {"text": "Are you a student or recent graduate? Apply for a paid internship in Senator Sanders' Burlington and Washington, D.C. offices, including press internships. Applications are due on June 22nd. https://t.co/o60HIKylyc", "date": "2019-06-06 11:15:11"}, "558": {"text": "Trump’s border wall request: $8.6 billion\nTax cuts for the wealthy: $1.5 trillion\n\"Space Force\" annual budget: $1.3 billion\nSoccer and legal aid for children locked up at the border: $0\n \nHow obscene is it that this administration blames “budget pressures” to punish little kids. https://t.co/VS1yAgRnxh", "date": "2019-06-05 23:08:19"}, "559": {"text": "Wall Street bankers say @AOC and I are wrong to advance the Loan Shark Prevention Act, which would put an end to sky-high interest rates on loans and credit cards. Guess what? They're wrong.\n\nNow economists are joining the fight. And they are on our side. https://t.co/xhMGu7yynG", "date": "2019-06-05 21:01:12"}, "560": {"text": "Mr. Trump now says he prefers to talk to Iran, after threatening a disastrous military conflict with them. Good.\n\nThe president can show he is serious about diplomacy by rejoining the nuclear deal he recklessly withdrew from last year. https://t.co/2SwKidd9Wo", "date": "2019-06-05 18:32:16"}, "561": {"text": "Trump's Mexico tariffs aren't about trade, it's about a fake border \"crisis\" to scapegoat migrants. No wonder it's unpopular. We should be working to address migration’s root causes by ending our militarized drug war and race-to-the-bottom trade policies. https://t.co/sWDmNfrUza", "date": "2019-06-05 17:10:34"}, "562": {"text": "RT @SenSanders: We must rescind the Hyde Amendment and resist attempts by states to erect roadblocks to abortion.", "date": "2019-06-05 16:52:46"}, "563": {"text": "China, with one-third our per capita income, leads on electric vehicles and renewable energy, while Trump says climate change is a hoax.\n \nA Green New Deal would invest in building our electric buses, trains and cars here in America with good union wages. https://t.co/XzUylFg4ij", "date": "2019-06-05 14:15:03"}, "564": {"text": "For the millions of DREAMers and TPS holders whose lives have been thrown into chaos by Mr. Trump’s bigotry, we have got to pass this legislation now. I call on Senator Majority Leader Mitch McConnell to bring this bill to the floor for a vote immediately. https://t.co/RxhGu9waEj", "date": "2019-06-05 00:42:31"}, "565": {"text": "LGBTQ people face unacceptable workplace discrimination and abuse. I say to the huge corporations rainbow-branding themselves for #PrideMonth:\n\nPay your employees fairly.\nLet them unionize.\nSupport their right to health care.\n\nDo not cheapen the struggle for dignity and freedom.", "date": "2019-06-04 22:11:56"}, "566": {"text": "Let's not forget that the middle class was built by organized labor. I am very concerned to see that @BuzzFeed still hasn't recognized the union formed by its newsroom employees. Our Workplace Democracy Act will put an end to corporations getting away with these stalling tactics. https://t.co/TnETs1sEjw", "date": "2019-06-04 17:30:18"}, "567": {"text": "I cannot understand this way of thinking from White House advisor Jared Kushner. It is not moral to have benefitted from the safe haven America provided our parents and grandparents fleeing violence, only to then slam the door shut on today's refugees. https://t.co/ve5tA6rhjr", "date": "2019-06-04 16:23:32"}, "568": {"text": "I believe it is wrong to charge Americans astronomical prices for life-saving drugs developed with taxpayer dollars. You will not find me encouraging pharmaceutical companies to continue ripping off Americans like my Republican colleagues. https://t.co/tMSudxwDyM", "date": "2019-06-04 15:41:20"}, "569": {"text": "I’ve said it before and I’ll say it again: It is outrageous that the Walton family makes more in one minute than a Walmart worker earns in a year. It is not radical to end taxpayer subsidies for this wealthy corporation and have it pay its employees a living wage of $15 an hour.", "date": "2019-06-04 12:44:51"}, "570": {"text": "22 Senators just voted for an extreme budget to cut Medicare and Medicaid IN HALF, throwing millions off their health care, while extending Trump's tax cuts for the ultra-wealthy.\n\nWhen Republicans tell us who they are and what they want for this country, we should believe them. https://t.co/fxLQSbXygH", "date": "2019-06-03 23:31:16"}, "571": {"text": "Big surprise: Under Trump, another head of a federal agency who is supposed to serve the public good is actually furthering family and business interests. The corruption and nepotism of this administration, from Trump on down, never ends. https://t.co/Ti5R8E0C5u", "date": "2019-06-03 20:47:54"}, "572": {"text": "3,000 of our fellow Americans died in Hurricane Maria. Instead of being allowed to recover, Puerto Rico faces cuts to health and education. We must stop treating the island as a colony. Puerto Ricans are U.S. citizens and deserve to live with dignity. https://t.co/Zu76Wu5OJS", "date": "2019-06-03 19:12:02"}, "573": {"text": "The Trump administration serves one group of people in America: the top 1%. https://t.co/BufLiSditT", "date": "2019-06-03 15:00:18"}, "574": {"text": "I applaud New Hampshire for becoming the 21st state to abolish the death penalty. Too many innocent people, particularly racial minorities, get caught up in this unjust policy. A civilized society shouldn’t be involved in the murder of other Americans. https://t.co/CmRoIJlDfh", "date": "2019-06-02 11:51:51"}, "575": {"text": "More proof that this administration wants to rig the 2020 Census to undercount minorities—and they’re trying to cover it up. The census must not be turned into a partisan weapon. Immigrant communities have a right to equal representation and funding. https://t.co/6Vtmdf1rXD", "date": "2019-06-01 18:10:00"}, "576": {"text": "RT @ChrisMurphyCT: 150 - days in 2019\n\n150 - mass shootings\n\n2,876,775 - thoughts and prayers tweets from cowardly public leaders\n\n93 - day…", "date": "2019-06-01 13:03:04"}, "577": {"text": "The 2008 Wall Street bailout was never meant to help ordinary people. It only emboldened Wall Street’s greed, recklessness and fraud. Bonuses went up, no one went to jail. That’s why I voted against it. It’s time to break up the big banks once and for all. https://t.co/b0Wl1UD2MM", "date": "2019-05-31 16:22:06"}, "578": {"text": "Nonpartisan experts confirmed to @HouseBudgetDems that #MedicareforAll could offer universal coverage, lower costs, and stronger wages. I applaud @USProgressives @RepJohnYarmuth, @RepJayapal and @RepRoKhanna for holding this hearing to build the case for health care as a right. https://t.co/bXnzSTzrLo", "date": "2019-05-31 14:41:11"}, "579": {"text": "How sick is Trump's revolving door? The current head of the EPA protecting our air is Andrew Wheeler, an ex-coal lobbyist. Before him, Scott Pruitt ignored his own scientists to make Wisconsin breathe in more smog. Now he works for the coal industry, too. https://t.co/tDIE4zq2Ky", "date": "2019-05-31 12:35:07"}, "580": {"text": "In support of our wonderful “ally,” Saudi Arabia, Trump has provoked war with Iran and kept us in an unconstitutional war in Yemen. Instead of giving the Saudis more bombs, he should take a hard look at the brutal, antidemocratic regime he loves so much. https://t.co/02w58VLXxr", "date": "2019-05-30 21:50:05"}, "581": {"text": "If Eddie Lampert has enough money to buy a $130-million, 288-foot yacht, he damn well has enough money to pay the $43 million severance package he promised to the workers at Sears, whose jobs were destroyed as a result of his greed and mismanagement. https://t.co/b2v9ALpC9F", "date": "2019-05-30 19:02:45"}, "582": {"text": "How can it be that six migrant children have died in U.S. custody in the last eight months? In the previous decade, this hadn't happened even once. \n\nWe need an investigation. Trump's racism, xenophobia and incompetence cannot be allowed to continue. https://t.co/7XLfiQTWyI", "date": "2019-05-30 17:27:01"}, "583": {"text": "As a candidate, Trump promised he'd stop outsourcing good-paying American jobs. He lied. \n\nInstead, by protecting their patents, Trump is trying to make it easier for corporations like Pfizer, GE, Boeing and Microsoft to ship more American jobs to China. https://t.co/1mfrFh1ayF", "date": "2019-05-30 17:16:52"}, "584": {"text": "Nurses know better than anyone how our for-profit health care system is incompatible with health care itself. I applaud @NationalNurses for their leadership to guarantee health care is a human right for all.\nhttps://t.co/TC5KV7Mp4w", "date": "2019-05-30 16:27:02"}, "585": {"text": "In America today, the average student-loan debt for a four-year degree is over $28,000.\n \nWhen asked how big their student debt was, people from Denmark, Taiwan, Ireland, Brazil, the Philippines, Scotland, Turkey, and Canada all gave the same answer: $0.\n\nhttps://t.co/kRA465pbPS", "date": "2019-05-29 20:02:53"}, "586": {"text": "Given the reality that we have a president who believes he is above the law, Congress must continue its investigations. If the House Judiciary Committee deems it necessary, I will support their decision to open an impeachment inquiry. https://t.co/6lTVdcaTXc", "date": "2019-05-29 18:19:34"}, "587": {"text": "McConnell said he’d fill a Supreme Court vacancy in 2020 after blocking hearings for Merrick Garland. What a hypocrite. Make no mistake about it, McConnell's goal has always been the same: lifetime appointments for extreme rightwing judges by any means. https://t.co/v7Pp2u6Ys9", "date": "2019-05-29 16:48:39"}, "588": {"text": "This is insane: As Oklahoma and Arkansas face catastrophic flooding, and Ohio and Indiana reel from tornados, Trump is trying to undermine the very science that proves climate change is real. We need policy based on facts, not rightwing ideology. https://t.co/GfEb5O7G7Y", "date": "2019-05-29 00:26:31"}, "589": {"text": "This is a public health crisis: The last remaining clinic in Missouri that provides safe, legal abortion could be shut down within hours. We must fight the extremists who, in state after state, are waging a war against women. https://t.co/959YySsbHT", "date": "2019-05-28 20:56:07"}, "590": {"text": "The establishment says there's no alternative to an unfettered capitalism that produces huge CEO bonuses while millions are paid starvation wages. They are dead wrong. Instead of more tax breaks to profitable corporations, let’s expand employee ownership. https://t.co/AOeqYmctem", "date": "2019-05-28 19:34:36"}, "591": {"text": ".@AGWilliamTong and 43 other attorneys general have damning proof that major drug companies have been colluding on price, stealing billions from American patients and taxpayers.\n\nI look forward to working with him to ensure they are prosecuted to the fullest extent of the law. https://t.co/0PRs3xu4Jj", "date": "2019-05-28 17:02:24"}, "592": {"text": "This Memorial Day, we say to veterans who came home from war that we honor your service, and we will make sure every man and woman who has served our country gets the very best health care they can through a strong Veterans Administration. https://t.co/e13IAmWf4C", "date": "2019-05-27 13:30:00"}, "593": {"text": "While we honor those who made the ultimate sacrifice, we must also remember our veterans. As the former Chair of the Veterans Affairs Committee, I believe we must strengthen the VA and guarantee that all veterans receive the quality health care they earned.", "date": "2019-05-27 13:20:44"}, "594": {"text": "Today, on this Memorial Day, we remember and honor all those men and women who gave their lives to defend our country, American values and our democracy. Their sacrifice will not be forgotten.", "date": "2019-05-27 12:22:26"}, "595": {"text": "RT @RepRoKhanna: There is no emergency justifying selling the Saudis bombs to kill children in Yemen. Congress passed a war powers resoluti…", "date": "2019-05-26 22:43:30"}, "596": {"text": "I say to the right-wing extremists who want to roll back Roe v. Wade: Abortion is a constitutional right and we are going to keep it that way. https://t.co/4bOHiL26qy", "date": "2019-05-26 20:52:52"}, "597": {"text": "How many kids suffer from mercury, lead, and soot in their air? And the most polluting incinerators in America hurt low-income and minority neighborhoods the most. We need clean air and water for all—not a government that works on behalf of polluters. https://t.co/2X6efs0jMu", "date": "2019-05-26 16:18:18"}, "598": {"text": "I agree with these 76 retired generals and admirals, who warn that a war with Iran would be a disaster for the region and for U.S. security, and who urge Trump to pursue diplomacy rather than an unnecessary conflict. https://t.co/tciy0Id8Qc", "date": "2019-05-25 15:41:10"}, "599": {"text": "I understand President Trump is blocking a resolution at the @WHO that would require drug companies to disclose actual R&amp;D costs for pharmaceutical drugs. Nobody should believe Mr. Trump when he talks about taking on Big Pharma. https://t.co/2XaXURjjlv", "date": "2019-05-24 22:42:37"}, "600": {"text": "Let me be clear: it is a disturbing attack on the First Amendment for the Trump administration to decide who is or is not a reporter for the purposes of a criminal prosecution. Donald Trump must obey the Constitution, which protects the publication of news about our government. https://t.co/5JtHNHH2BE", "date": "2019-05-24 20:31:03"}, "601": {"text": "Young people have already demonstrated that they can take on powerful fossil fuel companies and force politicians to answer their call to action. \n\nTo the more than 1 million people walking out for climate justice today: I stand with you. https://t.co/65rBGcvJTz", "date": "2019-05-24 18:01:03"}, "602": {"text": "I was right about Vietnam.\n\nI was right about Iraq.\n\nI will do everything in my power to prevent a war with Iran.\n\nI apologize to no one. https://t.co/Lna3oBZMKB", "date": "2019-05-24 12:30:00"}, "603": {"text": "Trump said he would “stop Wall Street from getting away with murder.\" Instead, he deregulated Wall Street and gave them a $20 billion tax break. \n\nI've got a better idea. We're going to make Wall Street pay its fair share and stop reckless speculation. https://t.co/c1U272rzpS", "date": "2019-05-24 11:48:56"}, "604": {"text": "I support the Transport Workers Union in their struggle against American Airlines. This is what a strong union and strong union leadership is about: https://t.co/7EINUWs4xl", "date": "2019-05-23 19:48:48"}, "605": {"text": "It is obvious that the President is a pathological liar who does not understand the Constitution. The fact is that if Mr. Trump continues to disregard the right of Congress to subpoena, he will leave House Members with no choice but to begin an impeachment inquiry.", "date": "2019-05-23 19:30:56"}, "606": {"text": "Thank you @chefjoseandres for stopping by to talk about the amazing work you did in Puerto Rico after Hurricane Maria! The full resources of the United States must be used to ensure that Puerto Rico gets the food, water, housing, and electricity they still desperately need. https://t.co/wMlS7emRDA", "date": "2019-05-23 17:25:16"}, "607": {"text": "RT @RepBarbaraLee: Proud to stand with @SenSanders today as we introduced the #InclusiveProsperity Act. It’s time for Wall Street to pay th…", "date": "2019-05-22 19:29:11"}, "608": {"text": "RT @RepMarkTakano: Congress must rein in corporate greed and make Wall Street pay its fair share to ensure that every American is able to b…", "date": "2019-05-22 18:52:23"}, "609": {"text": "\"How do you pay for it?\" This is how. \n\nWatch live as @RepBarbaraLee and I introduce legislation to tax Wall Street greed. https://t.co/tyMgvy79MW", "date": "2019-05-22 18:33:53"}, "610": {"text": "https://t.co/gUE3okDmjI", "date": "2019-05-22 14:38:24"}, "611": {"text": "Yes, facts matter. Delta workers don't make as little as $9 an hour. They make as little as $8.25 an hour. It's time for Delta's CEO to stop misleading, stop discouraging workers from joining a union and pay all of them a living wage with good benefits. https://t.co/tK6bbJTV2Z", "date": "2019-05-22 14:38:24"}, "612": {"text": "This afternoon, I attended a Senate intelligence briefing where the Trump administration presented its policy on Iran. Without going into specifics, let me just say: If you think the war in Iraq was a disaster, in all likelihood a war with Iran would be far worse. https://t.co/UqgAX7l2vx", "date": "2019-05-21 22:37:21"}, "613": {"text": "It is obvious Secretary DeVos wants to dismantle and privatize public education. No wonder she calls unions and local governments an \"empire\" to defeat. Our communities need an advocate for public education, not a billionaire advancing the interests of for-profit industry. https://t.co/W8Eyfzo1cW", "date": "2019-05-21 16:04:18"}, "614": {"text": "Can you believe this? We, as taxpayers, spent millions to develop a treatment for HIV. @GileadSciences disregarded our government patent to charge $2,000 a month for the very same drug. We have got to stop Big Pharma from price-gouging the American people. https://t.co/A8PHGBUZjx", "date": "2019-05-20 21:19:11"}, "615": {"text": "RT @RepJayapal: Shocker: Walmart, Exxon don't want #MedicareForAll. These companies have fought against health &amp; wellbeing of working Ameri…", "date": "2019-05-20 18:44:21"}, "616": {"text": "Trump, the schoolyard bully, is threatening to take us into another war in the Middle East. Just what we need! But it will not be Trump's or his billionaire friend's kids and grandkids who fight and die in that war. It will be working-class kids. No war with Iran! https://t.co/b32MYKtd4P", "date": "2019-05-20 16:35:45"}, "617": {"text": "We must not only make public colleges tuition-free, but we must substantially reduce student debt in this country. It is absolutely absurd that millions of Americans are paying off debts for decades because they got a higher education.", "date": "2019-05-20 01:47:55"}, "618": {"text": "Billionaire Robert F. Smith's gift to forgive the student debts of the graduating class of Morehouse College was extremely generous. But the student crisis will not be solved by charity. It must be addressed by governmental action. https://t.co/hnbVuscke6", "date": "2019-05-20 01:46:40"}, "619": {"text": "The people of Yemen are suffering because of a disastrous, brutal war. We should be ending that war, not funding it. On this issue and many others, I don’t see why we would want to be seen as a close ally of Saudi Arabia, which is a despotic, un-democratic regime. https://t.co/o1JgtjV9nS", "date": "2019-05-19 19:47:36"}, "620": {"text": "Black babies make up only 14% of the infant population, yet make up 30% of all infant deaths. That is unacceptable. We must address the systemic and implicit racism present in maternal care for black mothers, as well as other mothers of color. https://t.co/KaLsMF2RKG", "date": "2019-05-18 12:30:00"}, "621": {"text": "Congratulations to all those in House of Representatives who voted on the right side of history today. All people, regardless of who they are or who they love, deserve fair and equal treatment. #EqualityAct https://t.co/yHPQV8WIP2", "date": "2019-05-17 21:38:18"}, "622": {"text": "I fully support these medical workers in Ohio, who are striking to make St. Vincent Medical Center put patients over profits. They are on the right side of history. https://t.co/fVIDNsiiKs", "date": "2019-05-17 19:09:13"}, "623": {"text": "RT @EdLaborCmte: This is the 65th Anniversary of the Supreme Court’s landmark decision in Brown v Board, but America’s public schools are m…", "date": "2019-05-17 18:17:17"}, "624": {"text": "To the @SenateMajldr: The House did its job. Now, I call on you to bring the #EqualityAct to the Senate floor so that we finally protect LGBTQ people across America from discrimination in housing, employment and other critical parts of their lives. \n\nDo your job. https://t.co/IaFzrLCTGx", "date": "2019-05-17 17:56:37"}, "625": {"text": "Today's modern-day loan sharks are no longer lurking on street corners—they wear Armani suits and work on Wall Street.\n \n@RepAOC and I have a “radical” idea: no bank in America should charge an interest rate higher than 15%. https://t.co/4rzEqx5wjz", "date": "2019-05-17 15:10:10"}, "626": {"text": "It is not an American value to talk about rounding up millions of people and throwing them out of the country. That is xenophobia and racism. https://t.co/o7sE2szJkG", "date": "2019-05-17 14:20:03"}, "627": {"text": "Mr. Trump and his cabinet cannot seem to get on the same page when it comes to raising the min. wage to $15 an hour. It is not that complicated: Too many Americans are working 40+ hours a week and still cannot afford basic necessities. They need a living wage, not poverty pay. https://t.co/Yu6lHpYGus", "date": "2019-05-17 11:00:01"}, "628": {"text": "We know what the goal of the far right is: overturn Roe v. Wade and outlaw all abortion in America. It is not a stretch to say that this would, quite literally, kill women. Here's how we fight back: https://t.co/JEQ7myc0ny", "date": "2019-05-16 23:58:19"}, "629": {"text": "Should antitrust action be taken against Facebook? The answer is yes, of course. We have an increasingly monopolistic society, where you have a handful of very large corporations with far too much power over American consumers. That has got to change. https://t.co/mODGTaK1LR", "date": "2019-05-16 19:52:40"}, "630": {"text": "RT @FlyingWithSara: Who does the current version of Trump’s #NAFTA protect?\n\nBig pharma profits ✔️\nWorkers' rights ❌ \n\nRead this by @CWAUni…", "date": "2019-05-16 17:40:47"}, "631": {"text": "This is sickening. We have seen a terrible level of police violence against unarmed African Americans: Sandra Bland, Rekia Boyd and now Pamela Turner. We need an investigation of this shooting and immediate reform to our racist criminal justice system. https://t.co/NmJsfFfO1F", "date": "2019-05-16 17:17:31"}, "632": {"text": "The same CEOs who say we can't afford to guarantee health care as a right had no problem paying themselves $2.6 billion last year. \n\nWorking together, we will end the greed and profiteering of private health insurance companies and move to #MedicareforAll. https://t.co/PDqghoDTqN", "date": "2019-05-16 15:15:38"}, "633": {"text": "This woman's mother died of a self-induced abortion in 1944, when abortions were strictly criminal. In limiting access to abortion, all we are doing is eliminating safe and monitored abortions. https://t.co/5ccpq8Y19Y", "date": "2019-05-15 22:25:33"}, "634": {"text": "RT @MachinistsUnion: @Delta @iamtransport @IAMDeltaFA @DLWorkersUnite Dear @Delta CEO Ed Bastian,\n\nWe write to express our serious concerns…", "date": "2019-05-15 21:04:04"}, "635": {"text": "I thank my colleagues @SenSherrodBrown, @SenBobCasey, @RonWyden, @SenatorBaldwin, @SenBlumenthal, @SenMarkey, @SenWarren, and @SenJeffMerkley for joining me in this effort to stand with workers and against the outrageous greed of Delta Air Lines.", "date": "2019-05-15 20:23:33"}, "636": {"text": "Workers have the constitutional right to form a union and negotiate for better wages. Delta’s union-busting tactics are reprehensible. My colleagues and I urge Delta's CEO to end this insulting and demeaning campaign of intimidation. \n\nhttps://t.co/3ZgNFiCNxK", "date": "2019-05-15 19:44:31"}, "637": {"text": "The Alabama Senate voted to outlaw nearly all abortions. These hypocrites decry \"big government,\" yet they want to control every aspect of women's bodies, private decisions, and futures.\n \nOur job is to fight at every step to protect reproductive rights.", "date": "2019-05-15 15:19:50"}, "638": {"text": "The United States Congress must do everything it can to prevent the Trump Administration’s attempts to put us on the brink of a catastrophic and unconstitutional war with Iran. https://t.co/n2Wbzcj2Pq", "date": "2019-05-14 20:07:23"}, "639": {"text": "Join me live on Twitter and Facebook in a few moments, as I lay out my strong opposition to the Trump Administration's attempts to put us on the brink of a catastrophic and unconstitutional war with Iran.", "date": "2019-05-14 20:07:16"}, "640": {"text": "From disenfranchising ex-felons to extreme gerrymandering, here are the 5 ways the Republican party is trying to suppress the vote. The great political crisis we face is not voter fraud, which barely exists. It is voter suppression and the denial of voting rights. https://t.co/nM7V3LQ6td", "date": "2019-05-14 17:00:01"}, "641": {"text": "NO WAR WITH IRAN! This would be an unmitigated disaster. We must stop Trump and his national security advisor, John Bolton—someone who likes endless wars. https://t.co/a90UTlj8OU", "date": "2019-05-14 15:35:33"}, "642": {"text": "Americans must not be forced to continue paying outrageously high and inflated prices for the medicine they need. Congress must stand up to the powerful pharmaceutical industry and substantially lower drug prices in this country. https://t.co/mf4RB3bmhF", "date": "2019-05-14 14:49:33"}, "643": {"text": "Pharma executives allegedly deleted their texts and lied to our offices to conceal a conspiracy to fix prices, raising them by as much as 1000%. How many have died as a result of this racket? @RepCummings and I will hold these companies accountable. https://t.co/7v4aSUxi3u", "date": "2019-05-14 14:49:32"}, "644": {"text": "RT @sunrisemvmt: .@SenSanders: “The workers in the fossil fuel industry aren’t our enemies. They are working to feed their families. And th…", "date": "2019-05-14 00:47:29"}, "645": {"text": "When we rally for a Green New Deal, we are rallying to create millions of good clean energy jobs, rallying for racial justice, and rallying to save the only planet that we have. Watch live now at @sunrisemvmt or at https://t.co/2IjiXNhSoF. https://t.co/21XdaCQiE3", "date": "2019-05-14 00:24:58"}, "646": {"text": "Mr. President: Stop dividing the American people up by their religion, their race or their country of origin--and stop your ugly attacks against Muslim women in Congress. You are taking Rep. @RashidaTlaib's comments out of context and should apologize. https://t.co/QlYNn46zXQ", "date": "2019-05-13 19:31:31"}, "647": {"text": "RT @sunrisemvmt: 📣📣TONIGHT AT 7PM EST tune in to the livestream of our final tour stop in Washington DC 🙌🏽🙌🏾🙌🏿\n\nSign up at https://t.co/HYr…", "date": "2019-05-13 19:23:33"}, "648": {"text": "Victor Orban is undermining democracy in Hungary, just as Donald Trump is in the United States. The job of the President of the United States should be to stand up for democratic values, not embrace leaders who reject them. https://t.co/9wWxwrBkOP", "date": "2019-05-13 16:45:13"}, "649": {"text": "In The Divine Comedy, Dante reserved a special place in the Seventh Circle of Hell for people who charged usurious interest rates. Today we don’t need the hellfire, but we do need a national usury law that caps interest rates on credit cards and consumer loans at 15 percent. https://t.co/i4vnZOwFB2", "date": "2019-05-13 14:23:56"}, "650": {"text": "Jane and I, our four kids and seven grandchildren, want to take this opportunity to wish all of the great mothers of our country a very happy Mother's Day.", "date": "2019-05-12 16:56:31"}, "651": {"text": "Making certain that future generations have a planet that is healthy and habitable is a moral imperative. With their activism, young people are taking the lead in the fight against climate change. I look forward to speaking to the @sunrisemvmt tomorrow.", "date": "2019-05-12 14:14:50"}, "652": {"text": "How insane is this. We tell young people to get the best education they can, and then saddle them for decades with student debt. We must make public colleges and universities tuition-free, and substantially reduce student debt. https://t.co/5ZtH7KKyHJ", "date": "2019-05-11 22:51:43"}, "653": {"text": "Think of it. Instead of spending trillions on wars, strong U.S. presidential leadership could bring the world together in the fight against climate change and the need to transform our energy system away from fossil fuels. https://t.co/Q7EieYBmdG", "date": "2019-05-11 16:01:17"}, "654": {"text": "Once again, our critics are wrong: a new study found that in cities and states where wages went up, other low-wage workers got a bump in pay, and overall employment did not decrease. \n\nIt's long past time for Congress to pass a $15-an-hour living wage. https://t.co/Ifforg6cAq", "date": "2019-05-10 18:11:15"}, "655": {"text": "I applaud Facebook co-founder Chris Hughes for sounding the alarm on the dangers of unchecked corporate power. We are living in an era of monopolies that dominate every aspect of our lives—including our government. It’s time to take that power back. https://t.co/L3eEofZtnh", "date": "2019-05-10 13:55:39"}, "656": {"text": "Rep. Ocasio-Cortez is right. The big banks prey on poor people with high interest rates or ignore them entirely. \n\nThe vast majority of postal services around the world allow their customers to use basic banking services without outrageous fees and interest rates. So should we. https://t.co/vX1cgaD59J", "date": "2019-05-09 22:43:05"}, "657": {"text": "88 percent of the American people support capping credit card interest rates. They are sick and tired of being ripped off by Wall Street banks that are making record profits. \n\nWorking together, we will end their greed. https://t.co/hSrF4Ou3Mp", "date": "2019-05-09 19:59:35"}, "658": {"text": "RT @justicedems: \"Every religion understands that usury and loansharking is immoral. Let's call it what it is.\" -@SenSanders on capping cre…", "date": "2019-05-09 19:00:35"}, "659": {"text": "RT @AOC: There is no reason a person should pay more than 15% interest in the United States.\n\nIt’s common sense - in fact, we had these Usu…", "date": "2019-05-09 16:42:50"}, "660": {"text": "Credit card interest rates are outrageously high. With @RepAOC, we are introducing legislation to challenge the greed of Wall Street and protect  consumers across America. https://t.co/eFltL754AG", "date": "2019-05-09 16:12:36"}, "661": {"text": "My colleague @RepAOC and I have a radical idea: maybe Congress should stand up for ordinary people. Join us at noon today on Twitter as we launch our legislation to protect consumers and take on the greed of the big banks. https://t.co/3eLeok1LB7", "date": "2019-05-09 14:07:00"}, "662": {"text": "RT @GunnelsWarren: Spoiler alert: Jamie Dimon &amp; Lloyd Blankfein are really, really going to hate this bill - and we will welcome their hatr…", "date": "2019-05-09 13:13:42"}, "663": {"text": "At a time when climate change is the greatest crisis facing the planet, Microsoft and Google are making billion dollar deals with the fossil fuel industry. \n\nOur job: Break our addiction to fossil fuels and transform our energy system toward sustainable sources of energy. https://t.co/gkAxU7Tniw", "date": "2019-05-09 13:06:08"}, "664": {"text": "RT @AOC: New policy proposal dropping tomorrow with a special Senate co-lead 😎\n\nIt’s radical, which I always love, and we’re keeping more c…", "date": "2019-05-09 03:56:53"}, "665": {"text": "I urge Catalyst Pharmaceuticals to respond to this FDA decision by lowering its own outrageous prices. No patient should worry about whether they will suffer or die just to increase the obscene profits of a pharmaceutical company. https://t.co/FbnddEn6zx", "date": "2019-05-08 21:47:21"}, "666": {"text": "Today, I went to the the National Archives, where our Constitution is housed, to say to @realDonaldTrump: You are not a dictator and you must obey the Constitution. https://t.co/tgYruw0AQA", "date": "2019-05-08 20:28:16"}, "667": {"text": "RT @SenSanders: The average household with credit card debt owes over $15,000. \n\nThe average interest rate on these cards? Above 17%.\n \nSoo…", "date": "2019-05-08 18:56:22"}, "668": {"text": "By withdrawing from the Iran nuclear agreement, a move opposed by his own top security officials, Trump has isolated the U.S. from its closest allies and put us on a dangerous path to conflict. We should rejoin the deal and work with allies to effectively enforce it. https://t.co/ODgZ6lClzV", "date": "2019-05-08 18:05:11"}, "669": {"text": "RT @AdyBarkan: #MedicareForAll will mean that we can finally start to eliminate the atrocious racial and economic disparities that destroy…", "date": "2019-05-08 15:27:33"}, "670": {"text": "The House Judiciary Committee is doing the right thing by voting to hold Mr. Barr in contempt of Congress for defying a subpoena. No Attorney General is above the law. Mr. Barr must testify—the American people have a right to know. https://t.co/3cEBzoUrva", "date": "2019-05-08 15:16:12"}, "671": {"text": "Uber and Lyft drivers are struggling as they work for billion-dollar companies. These drivers are not “independent contractors”—they are employees who deserve rights and benefits. I stand in solidarity with them as they strike today for a dignified life. https://t.co/Cl6Srk0qD2", "date": "2019-05-08 11:44:19"}, "672": {"text": "There's no doubt in my mind that Sandra Bland, like too many African Americans who die in police custody, would be alive today if she were a white woman. I support her family’s call for a renewed investigation into her arrest and death. https://t.co/Zjyn5Isism", "date": "2019-05-08 02:02:29"}, "673": {"text": "This blatant and unconstitutional attack on women's rights must be stopped. Women have a fundamental right to control their own bodies and futures. https://t.co/YXgFTmQYj2", "date": "2019-05-07 22:52:32"}, "674": {"text": "Monopolies are harming the livelihoods of rural Americans. A handful of companies dominate the markets for seeds, equipment, meat packing, and patents. We need to put an end to corporate mergers and break up Big Ag so family farmers can get a fair shake. https://t.co/JMHRuZ5jkv", "date": "2019-05-07 21:01:54"}, "675": {"text": "Ady Barkan has health insurance but is still facing $9,000 a month in out-of-pocket medical expenses. He is dying from a terrible neurological disease and using the time he has left to testify before Congress. When we enact Medicare for All, it will be because of heroes like Ady. https://t.co/dBhiSZ8Rxo", "date": "2019-05-07 19:50:10"}, "676": {"text": "Unlike Donald Trump, most Americans do not believe that a free press is \"the enemy of the people.\" I am delighted that Reuters journalists Wa Lone and Kyaw Soe Oo were released from a Myanmar prison after 500 days in prison. https://t.co/HYibObPwPg", "date": "2019-05-07 13:58:55"}, "677": {"text": "Congratulations to the advocates in Oregon who won a major victory today. The right to a clean environment is more important than the short-term profits of the fossil fuel industry. Our job: break our addiction to fossil fuels, not increase our dependence on fracked natural gas. https://t.co/87SpPsQ7vV", "date": "2019-05-06 22:19:45"}, "678": {"text": "I am so grateful to America's nurses. Nurses are the backbone of our health care system and it is no wonder Americans trust them more than any other profession. They deserve tremendous respect and support from all of us. https://t.co/RNLj3MLX2j", "date": "2019-05-06 20:59:41"}, "679": {"text": "We must combat oligarchy. A new study shows that the top 10% now own 70% of the wealth, while the bottom half have virtually no net wealth at all. We need an economy that works for all, not just the few. https://t.co/jTVeLlaH9U", "date": "2019-05-06 20:28:12"}, "680": {"text": "The people of Puerto Rico have been experiencing a humanitarian crisis for over a year and a half since Hurricane Maria. It is totally unconscionable that in the wealthiest nation in the world we have allowed our fellow citizens to suffer for so long. https://t.co/P7wntVVIOT", "date": "2019-05-06 19:39:28"}, "681": {"text": "The average household with credit card debt owes over $15,000. \n\nThe average interest rate on these cards? Above 17%.\n \nSoon, I’ll introduce legislation to put a stop to this. How have steep interest rates and fees impacted you? Please share your story. https://t.co/MCyxwf8wms", "date": "2019-05-06 18:23:45"}, "682": {"text": "Climate change is destroying our ecosystems and our planet. We must take on the greed of the fossil fuel industry, and transform our energy system away from fossil fuel to energy efficiency and sustainable energy. https://t.co/ZGsobbQCPy", "date": "2019-05-06 15:37:47"}, "683": {"text": "Sorry, Mr. President, you are not a dictator. In our democracy, when Congress calls on Robert Mueller to testify, he will testify. https://t.co/hGhU9PlAXR", "date": "2019-05-06 14:55:53"}, "684": {"text": "This is obscene: while the top 25 hedge-fund managers each take home an average of $850 million a year, nearly half of college students have to skip meals for the crime of pursuing an education. We must ensure tuition-free college for all, funded by a tax on Wall Street greed. https://t.co/VoMYOVyqwW", "date": "2019-05-05 16:27:29"}, "685": {"text": "The United States lags behind every major country on Earth when it comes to paid sick leave. It is time for Congress to follow the lead of states like mine and pass guaranteed sick leave for all Americans. https://t.co/mo9x3XZFEd", "date": "2019-05-04 21:08:54"}, "686": {"text": "There can be no free society without a free media. The work of journalists in this country is absolutely essential to our communities and to a free and functioning democracy. Journalists should never have to fear for their lives as they do their work. #WorldPressFreedomDay", "date": "2019-05-03 21:23:09"}, "687": {"text": "We have a racist criminal justice system that costs us billions of dollars, ruins lives and allows private prisons to profit off of human misery. The private prison racket has got to end. https://t.co/kfLhwsZKL4", "date": "2019-05-03 19:39:13"}, "688": {"text": "In the richest country in the history of the world, 13 million children live in poverty and two-thirds of them are children of color. This is a moral outrage. If we raise the minimum wage and invest in education and housing, we can end child poverty. https://t.co/7BF6n9ONRV", "date": "2019-05-03 18:21:09"}, "689": {"text": "When Congress asks the Attorney General to testify or provide information, he's got to do it. I support those who are prepared to hold him in contempt for stonewalling. The American people are entitled to this information and the House should be as tough as they can be. https://t.co/BYvOrVZbB6", "date": "2019-05-03 15:14:26"}, "690": {"text": "RT @PodSaveAmerica: “I will do everything I can to see that US troops do not get involved in a civil war in Venezuela.” — @BernieSanders\n\nF…", "date": "2019-05-03 00:40:56"}, "691": {"text": "The Trump administration is threatening a disastrous military intervention in Venezuela. Under our Constitution, only Congress can authorize the use of force. We must make sure the United States does not get involved in yet another war and destabilize another region. https://t.co/UxHLljIyKf", "date": "2019-05-02 20:48:39"}, "692": {"text": "RT @TVietor08: NEWS: @SenSanders joined @PodSaveAmerica today to talk about the Senate's efforts to end US support for the disastrous Saudi…", "date": "2019-05-02 20:35:49"}, "693": {"text": "Apparently, it is not enough for the Trump administration to attack the Affordable Care Act. Now they want to open up millions of women and LGBTQ people to discrimination in health care. What we need is a health care system that covers every person's needs. No exceptions. https://t.co/IXawLwg4nw", "date": "2019-05-02 20:11:42"}, "694": {"text": "This is the beginning of a bipartisan process to take back our responsibility over these most important matters. My likeminded colleagues and I, in a bipartisan fashion, will utilize all of the legislative tools at our disposal—including further use of the War Powers Act.", "date": "2019-05-02 19:13:45"}, "695": {"text": "The bad news today: we were unable today to override Trump’s veto regarding U.S. intervention in this horrific war in Yemen. The good news: for the first time in 45 years, Congress used the War Powers Act to reassert its constitutional responsibility over the use of armed forces.", "date": "2019-05-02 19:13:45"}, "696": {"text": "Watch live now: A bipartisan majority in the House and the Senate voted to end U.S. support for the Saudi-led war in Yemen. We can save thousands upon thousands of people if we override Donald Trump's veto. https://t.co/ampKocul70", "date": "2019-05-02 16:58:57"}, "697": {"text": "Lives are at stake. I’m on my way to vote to override Donald Trump’s veto of our bipartisan resolution to stop U.S. involvement in the Saudi war in Yemen. https://t.co/HQD7bmOlmU", "date": "2019-05-02 16:42:18"}, "698": {"text": "I thank my friend @JoeBiden for joining our effort to end U.S. involvement in the Saudi military campaign in Yemen, which, over four years of war, has experienced the world's worst humanitarian crisis. We must override\n@realDonaldTrump's veto. https://t.co/SUHQNp1ptw", "date": "2019-05-02 16:26:45"}, "699": {"text": "I am proud to have worked with @USProgressives in the House to challenge the devastating cuts to education, health care and pensions imposed on the people of Puerto Rico. I applaud @RepRaulGrijalva for hosting a hearing to chart a just and equitable way forward. https://t.co/VUNYz85RW2", "date": "2019-05-02 14:59:06"}, "700": {"text": "Today, the Senate will vote on overriding Trump's veto of our bipartisan bill to end unlawful U.S. participation in the Saudi-led war in Yemen. This is not about partisan politics. What’s at stake are millions of innocent lives and our Constitution. I urge my colleagues vote yes.", "date": "2019-05-02 14:05:02"}, "701": {"text": "Today on #CollegeSigningDay, my staff and I want to celebrate students in Vermont and across the country for their hard work and determination. Congratulations on continuing your education! https://t.co/PegQ7OtxXD", "date": "2019-05-01 23:30:38"}, "702": {"text": "My staff went to the offices of my Senate colleagues to share a new UN report showing that 233,000 people will die as a result of the Saudi-led war in Yemen by 2019.\n \nIf we override Trump's veto of our resolution and end U.S. support for this war, we can save thousands of lives. https://t.co/GNcdo5x3yM", "date": "2019-05-01 21:11:18"}, "703": {"text": "What a hypocrite: While Trump demonizes immigrants, his New York country club exploits undocumented workers and steals their wages. Together, we will build an economy that treats all workers with dignity. https://t.co/7OHPddtvWU", "date": "2019-05-01 20:16:40"}, "704": {"text": "Attorney General Barr's handling of the Mueller report has been a disaster. This is what I feared and why I opposed his nomination. I look forward to Special Counsel Mueller's testimony and believe Congress must continue to investigate whether the president obstructed justice.", "date": "2019-05-01 18:54:14"}, "705": {"text": "Remember when Mr. Trump promised the typical American family a $4,000 pay raise? That was a lie. \n\nThe average worker has received an increased bonus of just 1 cent an hour since the Trump tax scam was signed into law. https://t.co/Ce29v7KAKl", "date": "2019-05-01 18:04:47"}, "706": {"text": "\"The whole myth that if you like your current insurance you can keep it - you know that is just not true.\" \n\nThis man suffers from 'job-lock' because he cannot afford to forgo his employer-based insurance. Our health care system is broken. That is why we need Medicare for All. https://t.co/HJC69rT4fo", "date": "2019-05-01 16:21:11"}, "707": {"text": "Our time on this Earth is precious. Let us honor the tremendous strength and courage of @AdyBarkan by watching his moving testimony, sharing it widely, and working tirelessly to pass #MedicareforAll to guarantee health care to every man, woman and child. https://t.co/q6rAXx8yFb", "date": "2019-04-30 20:34:31"}}