{"0": {"text": "RT @PeteForAmerica: “The promise we make in America is that every child should have access to an education that will give them the power to…", "date": "2019-12-07 14:45:53"}, "1": {"text": "RT @PeteForAmerica: “When we strengthen our education system, we strengthen our democracy. And with these policies, we won’t just teach stu…", "date": "2019-12-07 14:18:27"}, "2": {"text": "The promise we make in America is that every child should have access to an education that will give them the power to live a life of their choosing.\n\nToday I'm proud to announce an education plan that centers on students, teachers, and parents. https://t.co/8JBnMJvChl", "date": "2019-12-07 12:24:53"}, "3": {"text": "Now more than ever, the American people deserve transparency from their president. I’m urging McKinsey to do the right thing, and in the meantime, I’m providing a summary of my work.\nhttps://t.co/EfQF0cGoDL", "date": "2019-12-07 01:34:22"}, "4": {"text": "RT @PeteForAmerica: Marisel ha vivido en South Bend durante 21 años. Como muchos, está orgullosa de tener un líder como @PeteButtigieg, que…", "date": "2019-12-06 23:50:04"}, "5": {"text": "RT @PeteForAmerica: Marisel has lived in South Bend for 21 years. Like many, she's proud to have a leader like @PeteButtigieg who's accessi…", "date": "2019-12-06 23:49:57"}, "6": {"text": "While we wait for more information, my thoughts are with the victims and their families.\n\nService members and the dedicated civilians who support them deserve nothing less than safety on American soil and communities free from gun violence. Enough. https://t.co/sDKITjPwKR", "date": "2019-12-06 16:42:42"}, "7": {"text": "\"For I was hungry and you gave me food, I was thirsty and you gave me drink, I was a stranger and you welcomed me.\" https://t.co/J37TLoCckM", "date": "2019-12-05 23:09:57"}, "8": {"text": "RT @PeteForAmerica: South Benders like Arielle are leading @PeteButtigieg’s campaign of inclusion and belonging. https://t.co/7DvFJTzFuw", "date": "2019-12-05 21:34:50"}, "9": {"text": "RT @PeteForAmerica: As President of the South Bend NAACP and a South Bend resident for more than thirty years, Michael has seen @PeteButtig…", "date": "2019-12-05 18:34:01"}, "10": {"text": "RT @PeteForAmerica: Gladys is a community organizer in South Bend. When she first met @PeteButtigieg, she noticed that he not only listened…", "date": "2019-12-05 18:32:50"}, "11": {"text": "RT @PeteForAmerica: Having lived in South Bend for 15 years, Marilyn knows the values that bring communities together—and they’re exactly t…", "date": "2019-12-05 16:27:47"}, "12": {"text": "RT @PeteForAmerica: NEW: Three former Obama administration officials endorse @PeteButtigieg, citing the power of his message and his abilit…", "date": "2019-12-05 12:48:13"}, "13": {"text": "“An ambitious man might make his own aggrandizement, by the aid of a foreign power, the price of his treachery to his constituents.” \n\n—Alexander Hamilton", "date": "2019-12-05 03:04:15"}, "14": {"text": "This president has berated and demeaned our allies, tarnished our credibility abroad, and put political and personal motives above the national interest.\n\nWe are seeing the results—from betrayal on the battlefields of Syria to mockery among world leaders at NATO.", "date": "2019-12-05 02:00:22"}, "15": {"text": "RT @PeteForAmerica: Thank you, South Carolina, for the meaningful conversations and Southern hospitality. We’ll be back soon. https://t.co/…", "date": "2019-12-05 00:00:42"}, "16": {"text": "RT @PeteForAmerica: Health equity should not just be a priority for those who lack it. @PeteButtigieg believes it is a national responsibil…", "date": "2019-12-04 20:03:53"}, "17": {"text": "RT @PeteForAmerica: This week, @PeteButtigieg met with @KimpsonForSC and other South Carolinians to talk about confronting health equity an…", "date": "2019-12-04 20:02:41"}, "18": {"text": "RT @votevets: And we’re proud to stand with you @PeteButtigieg, and fight side-by-side with you to restore true leadership in the Oval Offi…", "date": "2019-12-04 14:46:51"}, "19": {"text": "I will be a commander in chief who knows what it means to be sent abroad on the orders of a president—one who will keep America’s promise to those who've kept theirs.\n\nThank you, @VoteVets. It is an honor to have your endorsement. https://t.co/etexaqBSOh", "date": "2019-12-04 14:27:11"}, "20": {"text": "Today I visited @MemPeaceJustice, a haunting reflection on our country’s history of white supremacy and racial violence, and a sobering reminder of the injustices persisting today.\n\nWe must act to dismantle racial inequity in our lifetimes—the American project depends on it.", "date": "2019-12-04 03:15:59"}, "21": {"text": "RT @PeteForAmerica: We’re exactly two months away from the Iowa caucuses—our first big electoral test and a defining moment for our campaig…", "date": "2019-12-04 02:22:34"}, "22": {"text": "It’s time to guarantee workplace protections for all American workers—from gig economy workers to student workers. I stand in solidarity with the @UAW and student workers organizing across the country. The @Harvard administration should negotiate in good faith with @hgsuuaw. https://t.co/HMPlBbsc5O", "date": "2019-12-04 01:09:45"}, "23": {"text": "RT @PeteForAmerica: International Day of Persons with Disabilities is a reminder to ensure that our health care system is ready and able to…", "date": "2019-12-04 01:06:22"}, "24": {"text": "RT @PeteForAmerica: This is what inequitable health care looks like. @PeteButtigieg will use the power of the federal government to end the…", "date": "2019-12-03 23:49:15"}, "25": {"text": "RT @PeteForAmerica: Black Americans make up half of new HIV diagnoses. \n\n@PeteButtigieg’s plan ends this disparity: https://t.co/iBwIrFhxmf…", "date": "2019-12-03 20:01:31"}, "26": {"text": ".@KamalaHarris has spent her career advocating for the voiceless and the vulnerable. I am grateful for her leadership and the courage she brings to the Senate and the national debate. I know she will continue to fight fearlessly on behalf of the American people—and our democracy. https://t.co/63Y6vryasv", "date": "2019-12-03 18:38:13"}, "27": {"text": "RT @PeteForAmerica: Combating institutionalized discrimination and structural racism in our health care system will be a priority in @PeteB…", "date": "2019-12-03 17:08:27"}, "28": {"text": "RT @PeteForAmerica: There is no one-size-fits-all approach to health care. That’s why @PeteButtigieg has released a plan that centers peopl…", "date": "2019-12-03 17:08:12"}, "29": {"text": "70 years after the founding of NATO, we must repair the strained relationships with our European allies. Not because we owe them or they owe us, but because America is safer and stronger when we work with strong and able partners—and when those partners can trust America’s word.", "date": "2019-12-03 16:07:09"}, "30": {"text": "The freedom to live a healthy life is an essential part of the American promise—yet millions find their health determined by who they are or where they live. I will make achieving health equity a strategic priority during my first 100 days in office.\nhttps://t.co/91YYclq4kz", "date": "2019-12-03 12:29:31"}, "31": {"text": ".@GovernorBullock joined this race to guarantee a fair shot for all, including communities that often go overlooked in our politics. I'm grateful to him for his service and I look forward to working with him to build a better future for all Americans. https://t.co/oEWmT87eu4", "date": "2019-12-02 21:10:44"}, "32": {"text": "Today, we remember the victims of the San Bernardino attack.\n\nToday, tomorrow, and the next day, we'll continue demanding action.\n\nIt's past time for Washington to act on the threat of gun violence and keep our communities safe.", "date": "2019-12-02 18:02:59"}, "33": {"text": "The freedom to organize is an American freedom. That’s why I’m proud to stand with @Culinary226 workers in their fight for their rights at Station Casinos in Nevada. https://t.co/UnaI0OBxyH", "date": "2019-12-02 17:52:57"}, "34": {"text": "Thank you @RevDrBarber and @UniteThePoor for the warm welcome. It was an honor to worship with you and I look forward to working alongside you as we serve those who are most vulnerable and most in need. https://t.co/hZQMPLfeJI", "date": "2019-12-02 03:31:36"}, "35": {"text": "On #WorldAIDSDay, we mourn the lives we've lost, stand with those living with HIV/AIDS, and set our eyes on a new era. I will use the powers of the presidency to tear down walls of exclusion and banish HIV/AIDS by 2030. https://t.co/7O4FnG4CYM", "date": "2019-12-01 20:30:17"}, "36": {"text": "Saddened by the loss of Hoosier William Ruckelshaus, who will be remembered for refusing to carry out the orders of a president trying to cover up his crimes. We will never all agree on every issue, but we should all strive to follow his example. https://t.co/nXJ9ejGkNI", "date": "2019-12-01 20:05:58"}, "37": {"text": "RT @RevDrBarber: After morning worship, @wilsonhartgrove &amp; I will host a conversation on addressing poverty in America, along w/ fusion pol…", "date": "2019-12-01 13:09:26"}, "38": {"text": "RT @PeteForAmerica: Support small businesses. https://t.co/UJ7yKkZwuG", "date": "2019-11-30 20:12:59"}, "39": {"text": "Small businesses begin as acts of hope and go on to fuel our economy. This #SmallBusinessSaturday, support veteran, women, and minority-owned small businesses, and help open new doors of opportunity for their owners, our communities, and our country.", "date": "2019-11-30 15:24:02"}, "40": {"text": "RT @PeteForAmerica: This is about empowering the next generation. https://t.co/DpUJTqL7XW", "date": "2019-11-30 02:00:46"}, "41": {"text": "This Black Friday, thank the department store clerk who gave up Thanksgiving dinner with her family for overtime pay, the warehouse employee working an extra shift to fulfill online orders, and the ride-share driver without workplace protections. It's time for #UnionsForAll.", "date": "2019-11-29 14:51:33"}, "42": {"text": "Thanksgiving is an opportunity for Americans to come together—as families, friends, and as a nation. \n\nToday I'm especially thankful for the sacrifices of those in uniform—protecting us abroad so that we may celebrate at home.\n\nFrom my family to yours, happy Thanksgiving.", "date": "2019-11-28 13:58:24"}, "43": {"text": "RT @PeteForAmerica: Dorothy is 101 years old. Once a nurse, the costs of long-term care have drained her life savings and left her with few…", "date": "2019-11-28 02:20:29"}, "44": {"text": "RT @PeteForAmerica: This week, @PeteButtigieg sat down with Barb and Vicky, two women navigating our broken long-term services system. All…", "date": "2019-11-28 02:20:19"}, "45": {"text": "Today, as we travel to be with family or friends or begin to set the table for Thanksgiving dinner, let’s focus on the values we share and the hopes we carry to build a better future for our families, our communities, and our country. https://t.co/fPRdc0p1zC", "date": "2019-11-27 18:24:37"}, "46": {"text": "If we are going to defeat Donald Trump, we need a nominee who can credibly call out his corruption. That's why I've released my tax returns in both the public and private sectors. Any candidate who claims they can beat Trump should lead by example. https://t.co/Fju2ZIAjQ9", "date": "2019-11-26 21:02:54"}, "47": {"text": "RT @PeteForAmerica: “I am determined to usher in a new era for older Americans that upholds the unshakable promise that every American shou…", "date": "2019-11-26 14:19:30"}, "48": {"text": "RT @PeteForAmerica: At 77, Ms. Bernice is still working. Having taken care of her aging mother only a few years ago, she knows how much sac…", "date": "2019-11-25 21:25:59"}, "49": {"text": "RT @PeteForAmerica: It’s time that Social Security recognized caregiving as work: https://t.co/IVBmNoNCyt https://t.co/lDsK7t1MC2", "date": "2019-11-25 21:25:53"}, "50": {"text": "RT @PeteForAmerica: 20 million seniors currently choose a private Medicare option and @PeteButtigieg's plan protects their future: https://…", "date": "2019-11-25 21:25:51"}, "51": {"text": "RT @IndivisibleTeam: https://t.co/ZWQWiflqX4", "date": "2019-11-25 15:28:43"}, "52": {"text": "RT @PeteForAmerica: .@PeteButtigieg is about to speak with @IndivisibleTeam live about his vision for the future of our country. Tune in 📺…", "date": "2019-11-25 14:14:49"}, "53": {"text": "Today, I’m announcing a comprehensive plan to usher in a new era for older Americans. One that empowers them to age and retire with dignity—while equipping them and their families with a sense of security over their futures. https://t.co/eGBuI9MnuB", "date": "2019-11-25 12:09:08"}, "54": {"text": "RT @PeteForAmerica: ICYMI: Last week, @PeteButtigieg discussed empowering our nation's HBCUs at @Morehouse, took part in the #DemDebate, me…", "date": "2019-11-25 02:25:32"}, "55": {"text": "RT @IndivisibleTeam: Are you excited for a conversation between @PeteButtigieg and Indivisible? So are we! Make sure you join us Monday mor…", "date": "2019-11-25 00:19:28"}, "56": {"text": "This president is robbing our nation of its values and our service members of their honor.\nhttps://t.co/H9LKe0wo7S", "date": "2019-11-24 01:36:40"}, "57": {"text": "RT @PeteForAmerica: \"People like me and people not at all like me...making it possible for me to be standing here wearing this wedding ring…", "date": "2019-11-23 17:20:50"}, "58": {"text": "RT @PeteForAmerica: This week, @PeteButtigieg visited @Morehouse to discuss his commitment to empowering our nation's HBCUs through a $50 b…", "date": "2019-11-23 02:32:02"}, "59": {"text": "@TheRevAl Thank you for having me, @TheRevAl, and for the important work you and the @NationalAction team do every day.", "date": "2019-11-23 00:37:41"}, "60": {"text": "Donald Trump has been repeatedly manipulated by our adversaries. He has allowed them to purchase the silence of the American president.\n\nAs I just told @JakeTapper, that will not happen when I am in office. https://t.co/hUc9UxOiht", "date": "2019-11-23 00:16:45"}, "61": {"text": "I applaud the bravery of the Iranian protestors and I stand with them as they once again rise up to demand change. The Iranian government must take action to improve the lives of its citizens, rather than resorting to violence and censorship to repress protests.", "date": "2019-11-22 20:57:19"}, "62": {"text": "RT @PeteForAmerica: “The president clearly has no strategy.”\n\n—@PeteButtigieg https://t.co/YGlOTV0Ieg", "date": "2019-11-22 20:51:06"}, "63": {"text": "RT @PeteForAmerica: “I'm not only running to defeat Donald Trump. I am running to prepare for the day that begins when Donald Trump has lef…", "date": "2019-11-22 02:16:45"}, "64": {"text": "RT @PeteForAmerica: “We are going to have to unify a nation that is as divided as ever and, while doing it, address big issues that didn’t…", "date": "2019-11-22 00:31:37"}, "65": {"text": "RT @PeteForAmerica: Are you keeping up with @PeteButtigieg’s day in Atlanta? Follow him on @Snapchat for the latest updates. https://t.co/z…", "date": "2019-11-21 22:30:33"}, "66": {"text": "Thank you for the warm welcome, Atlanta. Appreciated the opportunity to share what’s in my heart and to hear from Georgians this morning about the issues most important to them and their families. https://t.co/6qc5qBITC1", "date": "2019-11-21 18:44:29"}, "67": {"text": "Thank you @FairFightAction for having me at your Atlanta office today, and for your leadership on voting rights. We must work together to fight voter suppression and keep every voter on the rolls. https://t.co/Xt6YSX3okB", "date": "2019-11-21 16:43:38"}, "68": {"text": "RT @CBSNews: .@PeteButtigieg says #DemDebate should have touched on Trump's pardoning of war criminals: \"I can't think of something worse f…", "date": "2019-11-21 05:24:26"}, "69": {"text": "@PeteForAmerica @Snapchat @instagram I just stepped off the #DemDebate stage. If you’re with me, please chip in and let’s keep going: https://t.co/rYoEiIdhiR https://t.co/JITBsd6FwS", "date": "2019-11-21 05:15:40"}, "70": {"text": "RT @PeteForAmerica: .@PeteButtigieg just stepped off the @MSNBC and @washingtonpost #DemDebate stage—and people are saying he won. Read the…", "date": "2019-11-21 04:57:46"}, "71": {"text": "I’m not only running to defeat Donald Trump, I’m running to launch the era that must come next. I’m inviting progressives, moderates, and future former Republicans to join us in building that era—an era characterized by belonging, not by exclusion. #DemDebate https://t.co/vYeP1nkWbg", "date": "2019-11-21 04:34:51"}, "72": {"text": "RT @PeteForAmerica: No one should ever feel like a stranger in their own country. \n\n#DemDebate https://t.co/voKp5ve8rV", "date": "2019-11-21 04:11:30"}, "73": {"text": "Washington experience is not the only experience that matters. There’s more than 100 years of Washington experience on this stage, and where are we as a country? #DemDebate https://t.co/TtXszfuhHS", "date": "2019-11-21 04:10:53"}, "74": {"text": "As a mayor who has seen the consequences of systemic racism on my neighbors, as a person whose faith teaches me to stand with the marginalized, and as someone whose rights have been expanded by people who are like me and not like me, I'm determined to get this right. #DemDebate https://t.co/zWxXmQYLzY", "date": "2019-11-21 04:09:13"}, "75": {"text": "RT @PeteForAmerica: It's time to bring America into the 21st century and that starts with taking our security seriously. \n\n#DemDebate https…", "date": "2019-11-21 04:06:26"}, "76": {"text": "We need federal leadership to establish voting rights for the 21st century. #DemDebate https://t.co/bf2DlGdGks", "date": "2019-11-21 04:03:50"}, "77": {"text": "RT @PeteForAmerica: .@PeteButtigieg is commanding the #DemDebate stage. Catch up on what people are saying! \n\nhttps://t.co/KoTAmAF62e", "date": "2019-11-21 03:52:43"}, "78": {"text": "RT @PeteForAmerica: Our farmers have a crucial role to play in combating climate change.\n\nRead @PeteButtigieg's plan for empowering rural A…", "date": "2019-11-21 03:31:41"}, "79": {"text": "We do not have a 21st century security strategy coming from this president. After all, he’s relying on 17th century defense mechanisms, like building a wall. As president, I will focus on the threats of the future. #DemDebate https://t.co/vuNchP1mAN", "date": "2019-11-21 03:30:57"}, "80": {"text": "This president doesn’t care one bit about farmers. #DemDebate https://t.co/n0Jg68ZJY5", "date": "2019-11-21 03:14:39"}, "81": {"text": "RT @PeteForAmerica: Let's be bigger → https://t.co/Zwh9l7JBLa\n\n#DemDebate https://t.co/ST0v498ash", "date": "2019-11-21 03:13:53"}, "82": {"text": "Whether it’s his trade war or small-refinery waivers, this president keeps asking farmers to take one for the team. As president, I will recruit farmers and rural Americans to help solve our nation’s greatest challenges. #DemDebate https://t.co/YrNxx3UJ5s", "date": "2019-11-21 03:12:10"}, "83": {"text": "RT @PeteButtigieg: Once again, this president is attempting to fix a mess created by his own reckless policies. And once again, it’s too li…", "date": "2019-11-21 03:01:56"}, "84": {"text": "RT @NBCNews: Pete Buttigieg: \"We've still got to act on health care, kids learning active shooter drills before they learn to read...Those…", "date": "2019-11-21 02:54:10"}, "85": {"text": "RT @votevets: “I also wore the uniform of this country and know what’s at stake in decisions made in the Oval Office and Situation Room” —@…", "date": "2019-11-21 02:49:54"}, "86": {"text": "RT @PeteForAmerica: The big issues cannot wait → https://t.co/aVKxve62V6 https://t.co/tv08tDYSXK", "date": "2019-11-21 02:47:46"}, "87": {"text": "What we do to better lives in a Midwestern town might look small to Washington politicians. But where I’m from, it’s the partisan fighting in Washington that looks small. #DemDebate https://t.co/GJdp60aEVd", "date": "2019-11-21 02:43:16"}, "88": {"text": "We have an opportunity to make real progress on health care, gun safety, and immigration. But only if we galvanize—not polarize—the American people. #DemDebate https://t.co/7I6czaDZsy", "date": "2019-11-21 02:29:00"}, "89": {"text": "We must confront Donald Trump for his wrongdoings. That means impeachment. But we must do more. I’m running to be the president who will stand amid the rubble of his presidency, pick up the pieces, and unify a divided nation. #DemDebate https://t.co/vdjUf567QI", "date": "2019-11-21 02:21:01"}, "90": {"text": "RT @PeteForAmerica: People across the country submitted videos wishing @PeteButtigieg good luck. With a team like this, anything is possibl…", "date": "2019-11-21 01:43:53"}, "91": {"text": "I’m about to take the #DemDebate stage. \n\nMy team in South Bend will tweet for me while I’m out there, so follow along here and at @PeteForAmerica. I hear we've also got plans for @Snapchat and @Instagram, so stay tuned. Here we go.", "date": "2019-11-21 01:40:08"}, "92": {"text": "We launched @PeteForAmerica with little more than hope in our hearts and bold ideas for a better future. Since then, nearly 700,000 Americans have invested in our campaign for change. You've gotten us here. I am profoundly grateful and I hope I make you proud tonight.", "date": "2019-11-21 01:40:08"}, "93": {"text": "RT @PeteForAmerica: https://t.co/dIbT7QMrtN", "date": "2019-11-21 01:32:11"}, "94": {"text": "Focused. https://t.co/timse9YAWK", "date": "2019-11-20 18:41:59"}, "95": {"text": "This election will be the fight of our lives. But after that fight ends, the real work begins. \n\nI’m running to be the president who will stand amid the rubble, gather up the pieces of our divided nation, and lead us toward a better future. https://t.co/VAjKy7vqkE", "date": "2019-11-20 14:15:14"}, "96": {"text": "Proud of Hoosier teachers and allies for their massive show of support for public education today in Indiana. When we better honor and compensate our educators, the future will be brighter for all Americans. #RedForEd https://t.co/L8yxkpYOUC", "date": "2019-11-20 03:25:48"}, "97": {"text": "At least 22 transgender and gender non-conforming people have been killed in America this year. Tonight, I’m thinking of them and those whose deaths may never be reported. We must all commit to building a country where transgender Americans are safe, equal, and free. https://t.co/mUfDdBLWCD", "date": "2019-11-20 03:12:02"}, "98": {"text": "Latinas in America earn just 54 cents on the dollar. That’s not enough to invest in an education, provide for a family, or achieve the American Dream. As we recognize tomorrow’s #LatinaEqualPayDay, we must acknowledge our duty to ensure an economy that works for everyone.", "date": "2019-11-20 01:58:50"}, "99": {"text": "RT @PeteForAmerica: ICYMI: Yesterday at @Morehouse, @PeteButtigieg unveiled his plan to invest $50 billion in our nation's HBCUs: https://t…", "date": "2019-11-19 22:27:58"}, "100": {"text": "Instead of providing free college tuition for the children of millionaires and billionaires, I will open doors of opportunity for Americans who choose not to go to college with massive investments in apprenticeships, workforce training, and lifelong learning programs.", "date": "2019-11-19 18:07:34"}, "101": {"text": "As president, I will strengthen paths to college for students from working and middle-class families with historic investments in HBCUs, expanded Pell Grants, and tuition-free public college: https://t.co/wzkiqlSgch https://t.co/pihZRX11Gq", "date": "2019-11-19 18:07:32"}, "102": {"text": "Like his service, Lt. Col Vindman’s testimony demonstrates not just courage but real love for our country and its freedoms. \n\nNow, the character of our country is on the line.", "date": "2019-11-19 15:36:49"}, "103": {"text": "There will come a day when Donald Trump is no longer in office.\n\nI am running to be the president who can stand on the rubble, pick up the pieces of our divided nation, and guide us toward a better future—united as one United States of America. https://t.co/jC4YoqGcG7", "date": "2019-11-19 13:56:00"}, "104": {"text": "The Trump administration’s statement on West Bank settlements is not only a significant step backward in our efforts to achieve a two-state solution to the Israeli-Palestinian conflict, it is the latest in a pattern of destructive decisions that harm our national interests. https://t.co/1RFBv7O1bZ", "date": "2019-11-18 23:17:30"}, "105": {"text": "RT @SEIU: Glad to see @PeteButtigieg address the need to make higher ed jobs good, union jobs.  In a country as rich as ours, choosing to t…", "date": "2019-11-18 21:40:34"}, "106": {"text": "RT @PeteForAmerica: HBCUs have been empowering Black students for generations. We must ensure they have the funding to continue creating ou…", "date": "2019-11-18 20:54:45"}, "107": {"text": "Cost should never be a barrier to a brighter future for anyone in our country—whether someone chooses to go to college or not. The plan I'm unveiling today makes affordable college and workforce programs available to all. https://t.co/WpIP9sU8oq", "date": "2019-11-18 19:08:55"}, "108": {"text": "RT @PeteForAmerica: Our plan makes college affordable for everyone, including DACA recipients: https://t.co/TptgZemFJ3\nhttps://t.co/JvVYeFG…", "date": "2019-11-18 19:04:01"}, "109": {"text": "RT @PeteForAmerica: Systemic racism and chronic underfunding have left too many HBCUs vulnerable. Our new plan commits $50 billion to HBCUs…", "date": "2019-11-18 17:07:10"}, "110": {"text": "RT @PeteForAmerica: “Our ability....to sustain and expand our middle class, and to make sure children have a better life than their parents…", "date": "2019-11-18 15:37:54"}, "111": {"text": "Our future will be shaped in many ways by the education we make available to all Americans—whether they choose to go to college or not. Today, I’m proud to announce a plan to open new horizons by bringing opportunity within reach: https://t.co/A2GZkxReg9 https://t.co/fhjhOxz55I", "date": "2019-11-18 12:09:51"}, "112": {"text": "China is waging a shocking, merciless campaign to erase the religious and ethnic identity of millions. The United States has a responsibility to speak out. This president’s silence has a cost. https://t.co/y7tPxKhBjN", "date": "2019-11-17 19:08:12"}, "113": {"text": "I am not just here to end the era of Donald Trump. I am here to launch the era that must come next—an era of hope and belonging. We can get there, together. https://t.co/RE46DUH5h6", "date": "2019-11-17 15:15:09"}, "114": {"text": "RT @PeteForAmerica: Win with hope. https://t.co/JI1ifDCg5Z", "date": "2019-11-17 02:11:50"}, "115": {"text": "The last image of Tua Tagovailoa's college football career—a career for which he deserved to be compensated. https://t.co/ONQi8IvsMq", "date": "2019-11-17 00:02:34"}, "116": {"text": "Proud to be the first candidate to file in the Palmetto State. Thank you, Rev. Ann McCants, for representing @PeteforAmerica. 105 days to go! https://t.co/4aXwvr7RVv", "date": "2019-11-16 23:34:22"}, "117": {"text": "RT @PeteForAmerica: 87 days until the New Hampshire primary. Are you on board? \n\nhttps://t.co/7xmc5lpms9 https://t.co/xpWSK70vTU", "date": "2019-11-16 23:19:50"}, "118": {"text": "RT @NDFootball: A series unlike any other. \n\nWe conclude the 93rd playing of this historic rivalry by singing Navy's alma mater side by sid…", "date": "2019-11-16 23:05:46"}, "119": {"text": "Chief Justice Mark Cady’s rulings changed lives, making more Americans more free and bringing hope to many. His service set an example for the nation, and I am profoundly grateful. My deepest condolences are with the Cady family, his community, and the people of Iowa. https://t.co/sBAFP8isZK", "date": "2019-11-16 18:23:14"}, "120": {"text": "There’s nothing pro-military about overruling our military justice system to prevent it from delivering accountability for war crimes. The president has again dishonored our armed services.", "date": "2019-11-16 16:39:07"}, "121": {"text": "Encouraged by today's news out of Texas. Governor Abbott should accept this recommendation and give Rodney Reed the new trial he deserves and justice demands.\nhttps://t.co/lyh4XnYqmW", "date": "2019-11-15 22:58:33"}, "122": {"text": "Amb. Yovanovitch is a profile in patriotism and courage. All Americans owe a debt of gratitude to her and the career diplomats and public servants who serve with honor and now find themselves under a spotlight they didn’t seek. For them, the national interest always comes first.", "date": "2019-11-15 22:18:13"}, "123": {"text": "This isn't just about this president. It's about the presidency. It's about the future of our republic. https://t.co/jgUbxOJ2vs", "date": "2019-11-15 15:48:49"}, "124": {"text": "RT @PeteForAmerica: Picture that morning. https://t.co/ytAzYEDnT2", "date": "2019-11-15 14:53:41"}, "125": {"text": "@AdyBarkan @rachael_scar Congratulations, Ady and Rachael, on welcoming Willow into your family! We’re thrilled for you and all of us at @PeteForAmerica are sending our best.", "date": "2019-11-15 13:55:36"}, "126": {"text": "A 16-year-old girl.\n\nA 14-year-old boy.\n\nMy heart breaks for their families, the Santa Clarita community, and our country. America is sacrificing a generation to the devastating effects of gun violence because our leaders in Washington lack the will to save lives. We must act.", "date": "2019-11-15 02:56:54"}, "127": {"text": "RT @PeteForAmerica: Something is happening in Nevada. https://t.co/YUpAWLNB8p", "date": "2019-11-15 01:37:31"}, "128": {"text": "I will be a commander in chief who keeps America’s promise to those who kept their promise to serve our nation. https://t.co/zUpHJuve0L", "date": "2019-11-15 00:20:48"}, "129": {"text": "RT @PeteForAmerica: There’s only 100 days until the Nevada Caucus, and our movement is getting bigger every day. Show you support and commi…", "date": "2019-11-14 21:31:25"}, "130": {"text": "We don’t yet have all the details of the horrifying events in Santa Clarita. But we do know that in America today, children are scared to go to school. Parents and teachers are terrified. And that can’t stand. It is time to hold the NRA and our leaders in Washington accountable.", "date": "2019-11-14 17:35:56"}, "131": {"text": "Left without remedy, an injustice does not heal. It compounds. As president, I’ll increase funding for HBCUs and minority-serving institutions by $50 billion, because we have a national obligation to invest in the next generation of Black American leaders.\nhttps://t.co/8xcuO7VvQN", "date": "2019-11-13 21:33:45"}, "132": {"text": "RT @PeteForAmerica: When it comes to increasing access to health care, @PeteButtigieg is offering Americans something new: a guarantee and…", "date": "2019-11-13 21:00:27"}, "133": {"text": "I’m proud to stand with @MaryKayHenry and @SEIU workers in the #FightFor15. It is time for #UnionsForAll. https://t.co/sJF9n87jr9", "date": "2019-11-13 19:01:38"}, "134": {"text": "I strongly condemn the rocket attacks on the citizens of southern and central Israel. Israel has a right to defend itself against acts of terror that set back any progress towards peace and will only serve to inflame the humanitarian situation in Gaza.", "date": "2019-11-13 16:07:36"}, "135": {"text": "I am running to be the president who will stand amid the rubble, gather up the pieces of our divided nation, and lead us toward a better future. https://t.co/CQ9eoiqLCn", "date": "2019-11-13 15:34:46"}, "136": {"text": "Today, Sikhs worldwide are celebrating the 550th birth anniversary of Guru Nanak, the founder of Sikhism. Sikh Americans have made our nation stronger, and I hope you will join me in wishing our Sikh friends and neighbors a joyful celebration.", "date": "2019-11-13 00:45:00"}, "137": {"text": "RT @PeteForAmerica: It's #NationalRunforOfficeDay, and we need a new generation of leaders who know that the challenges we face are about m…", "date": "2019-11-12 20:38:12"}, "138": {"text": "RT @PeteForAmerica: Serving in the Marine Corps fundamentally changed @CatAOConnor life and inspired her to advocate for veterans in need o…", "date": "2019-11-12 17:50:26"}, "139": {"text": "RT @PeteForAmerica: #HomeIsHere and you belong. https://t.co/KA36PPWH5C", "date": "2019-11-12 16:35:23"}, "140": {"text": "RT @PeteForAmerica: Women in uniform deserve to know that the VA is prepared to support them: https://t.co/qY2qB9pBkQ\nhttps://t.co/5GrzjqJF…", "date": "2019-11-12 15:08:26"}, "141": {"text": "RT @PeteForAmerica: “When you raise your right hand and vow to give everything to your country, America commits to taking care of you and y…", "date": "2019-11-12 15:07:45"}, "142": {"text": "@CityofSouthBend Thanks to our crews for keeping South Bend streets safe to drive—and thanks to residents for your patience and understanding as leaf crews and trucks temporarily switch over for snow duty!", "date": "2019-11-12 14:20:20"}, "143": {"text": "RT @PeteForAmerica: “The women and men who come home from war are not unblemished heroes or broken souls...They are the greatest asset that…", "date": "2019-11-12 03:19:40"}, "144": {"text": "RT @Chas10Buttigieg: Glad to have our friends @davidwaxmuseum in South Bend tonight playing in the same spot they did for our wedding ❤️ ht…", "date": "2019-11-12 02:40:25"}, "145": {"text": "RT @PeteForAmerica: During his #VeteransDay address, @PeteButtigieg veered from his prepared remarks to offer our nation's Vietnam veterans…", "date": "2019-11-12 02:04:07"}, "146": {"text": "RT @PeteForAmerica: This afternoon, during his #VeteransDay address, @PeteButtigieg recalled meeting South Bend high school students who ha…", "date": "2019-11-12 01:13:24"}, "147": {"text": "RT @PeteForAmerica: Organizations like @VCP_HQ are doing the work to ensure that those who serve the homeland have a home when they come ba…", "date": "2019-11-11 22:31:37"}, "148": {"text": "RT @PeteForAmerica: Veteran health care is not a favor, it's a promise that Washington has broken countless times. That’s why @PeteButtigie…", "date": "2019-11-11 21:12:23"}, "149": {"text": "RT @PeteForAmerica: We’re live from Rochester, New Hampshire, where @PeteButtigieg is delivering a #VeteransDay address. Tune in: https://t…", "date": "2019-11-11 18:36:20"}, "150": {"text": "RT @PeteForAmerica: This afternoon, @PeteButtigieg will honor our nation's veterans with an address in Rochester, New Hampshire. Tune in at…", "date": "2019-11-11 17:00:46"}, "151": {"text": "I appreciate this reporter’s swift and honest correction of a misquote on my views of the Obama presidency. From health care to DADT repeal to the rescue of the auto industry, my appreciation of the great leadership of Barack Obama comes from a very personal place. https://t.co/eWvSDtcpTQ", "date": "2019-11-11 12:12:42"}, "152": {"text": "This Veterans Day, we pause to honor the courage and sacrifice of all those who've stepped up to serve. Let us also reflect on the promises our country must make to them in return. Fellow veterans, I am proud to stand with you: https://t.co/WAR4khZphL https://t.co/xvHqHww4Rk", "date": "2019-11-11 11:39:07"}, "153": {"text": "@JasonKander I blame the father.", "date": "2019-11-11 02:19:38"}, "154": {"text": "RT @PeteForAmerica: One nation. https://t.co/DsF9VrpzkP", "date": "2019-11-11 00:33:16"}, "155": {"text": "RT @PeteForAmerica: ICYMI: This past week, @PeteButtigieg toured Iowa and New Hampshire aboard our all-access, on-the-record bus tour, stop…", "date": "2019-11-11 00:11:16"}, "156": {"text": "Ready for the road ahead. https://t.co/HIr8gUT8QR", "date": "2019-11-10 21:28:01"}, "157": {"text": "This week, the Supreme Court will hear oral arguments in a crucial case for DREAMers across our country. If you or someone you know is a DACA holder, please know that I am with you. You belong. And now is the time to check your eligibility for renewal: https://t.co/pUQzYcZT74 https://t.co/NkcXouBH4t", "date": "2019-11-10 19:47:45"}, "158": {"text": "Fellow veterans take note: the President of the United States has formally confessed to illegally misdirecting charitable funds from an event he claimed was a benefit for veterans. How many more affronts to flag and uniform will we tolerate? https://t.co/ZyvEYoBV8D", "date": "2019-11-08 18:29:35"}, "159": {"text": "Rodney Reed is set to be executed on November 20th in Texas—despite new evidence that could prove his innocence. For justice to be served, the truth should be out. Rodney Reed deserves a new trial. If you live in Texas, call Governor Abbott to demand one: 512-686-5729", "date": "2019-11-08 14:02:37"}, "160": {"text": "The death penalty in America is not only a cruel practice, it furthers systemic racism and has taken too many Black lives. It cannot deliver equal or true justice—it's time for it to end. For proof, we need to look no further than the case of Rodney Reed. https://t.co/0vVoWsnq6x", "date": "2019-11-08 14:02:36"}, "161": {"text": "We need an economy that delivers more. As president, I won't just measure success by looking at the size of the stock market or GDP—I'll look to you. Today, I'm announcing a plan to raise incomes, lower costs, and build a brighter future for all Americans. https://t.co/yEHC43el71", "date": "2019-11-08 12:19:22"}, "162": {"text": "I respect the office of the presidency. But, as I just told @ChrisCuomo, this president has done nothing to command my respect—and I don’t believe he has done enough to command yours.\nhttps://t.co/ktGjqh18yk", "date": "2019-11-08 03:49:15"}, "163": {"text": "RT @PeteForAmerica: On the road again 🚌\nNext stop, New Hampshire! https://t.co/qrfZd9Mhs4", "date": "2019-11-07 20:54:03"}, "164": {"text": "RT @PeteForAmerica: We trust the American people to decide what’s best for their families—while lowering health care costs so care is affor…", "date": "2019-11-07 17:00:18"}, "165": {"text": "RT @PeteForAmerica: “As Mayor @PeteButtigieg spoke, something else happened that I had not experienced in quite some time. A tingle began r…", "date": "2019-11-07 16:22:04"}, "166": {"text": "Voting is a right, not a privilege. I stand with New Hampshire college students, @ACLU_NH, and those who believe in democracy in the fight against HB 1264, a law intended to confuse and intimidate young citizens out of voting. All Americans deserve to have their rights protected.", "date": "2019-11-06 23:08:58"}, "167": {"text": "Labor rights are under attack across the country. In Cedar Rapids, more than 500 @RWDSU workers are demanding fair wages and better working conditions from @GeneralMills. I am proud to stand with them and all workers in the fight for fair contracts and workplace protections.", "date": "2019-11-06 22:15:59"}, "168": {"text": "RT @PeteForAmerica: The issues facing people with disabilities are too urgent to be sidelined: https://t.co/2oXvwcpr85\nhttps://t.co/9iofbHz…", "date": "2019-11-06 21:43:00"}, "169": {"text": "From securing additional funding for schools to effectively combating New Hampshire’s substance use disorder crisis, Mayor Craig has addressed Manchester’s challenges head-on. We need more leaders like her—and it’s why she was re-elected. Congratulations, @JoyceCraigNH! https://t.co/gZwchoTrVB", "date": "2019-11-06 16:09:39"}, "170": {"text": "There is no such thing as a permanently red state. Thank you to every organizer and supporter whose acts of hope made last night possible. You helped to elect @AndyBeshearKY in Kentucky and flip the Virginia legislature. Congratulations to Democrats across the country!", "date": "2019-11-06 14:29:38"}, "171": {"text": "RT @PeteForAmerica: We will get there—together. https://t.co/IkvfjzY55s", "date": "2019-11-06 01:03:11"}, "172": {"text": "RT @PeteForAmerica: .@PeteButtigieg will ensure that 85% of children with intellectual and multiple disabilities can thrive in general educ…", "date": "2019-11-06 00:55:16"}, "173": {"text": "Big congratulations to James @MuellerforMayor and all of the South Bend Common Council members elected tonight! Great opportunities are ahead for continued progress and inclusive growth in our hometown.", "date": "2019-11-06 00:34:42"}, "174": {"text": "Climate catastrophe is on the horizon—whether this president believes it or not. As president, I will restore American credibility and leadership by rejoining the #ParisAgreement and engaging the world to tackle climate as the global security issue of our time. We can’t wait.", "date": "2019-11-05 22:05:57"}, "175": {"text": "RT @PeteForAmerica: 🗣️ Ve! \n🗣️ Vota! \n🗣️ https://t.co/bBxmkpMsqA https://t.co/NewJm1Fr3W", "date": "2019-11-05 20:54:54"}, "176": {"text": "RT @PeteForAmerica: 🗣️ Go\n🗣️ Vote!\n🗣️ https://t.co/bBxmkpMsqA https://t.co/yCbAN1HoBE", "date": "2019-11-05 20:54:50"}, "177": {"text": "This week marks the anniversaries of three of the deadliest mass shootings in American history: Fort Hood and Sutherland Springs, Texas; and Thousand Oaks, California.\n\nOur calendars are filling up with reminders of Washington’s failure to keep us safe. It’s time for change.", "date": "2019-11-05 15:51:36"}, "178": {"text": "Take it from me: state and local elections matter.\n\nI just voted here in South Bend. If you're in Indiana, Kentucky, Mississippi, New Hampshire, or Virginia, please get out there and vote. Click below to find a polling location near you. https://t.co/kvmLLOL19P", "date": "2019-11-05 13:22:59"}, "179": {"text": "RT @PeteForAmerica: ✅ #LJ19\n☑️ Iowa Caucus https://t.co/PNvPqFxXaU", "date": "2019-11-05 00:34:41"}, "180": {"text": "Don’t wait until next year’s presidential election to make your voice heard. Tomorrow, important state and local elections are happening across the country. Learn more—especially if you’re in IN, KY, MS, NH, or VA—and make a plan to vote. https://t.co/kvmLLOL19P", "date": "2019-11-04 23:41:42"}, "181": {"text": "RT @PeteForAmerica: With @PeteButtigieg on his second Iowa Bus Tour, now is the perfect time to relive the first one. Together, we can win…", "date": "2019-11-04 22:56:02"}, "182": {"text": "RT @PeteForAmerica: This afternoon, this president formally began America’s withdrawal from the #ParisAgreement, a year-long process for a…", "date": "2019-11-04 21:26:41"}, "183": {"text": "RT @PeteForAmerica: A weekend to remember, brought to you by high hopes and the best organizers in Iowa. https://t.co/Ys3WFkExim", "date": "2019-11-04 20:09:37"}, "184": {"text": "RT @PeteForAmerica: A different kind of campaign for a different kind of candidate. https://t.co/pmidCH67uN", "date": "2019-11-04 16:18:10"}, "185": {"text": "Let's make history and begin a new era—together. https://t.co/zHtkSHWx7q", "date": "2019-11-03 23:25:08"}, "186": {"text": "RT @PeteForAmerica: https://t.co/43MNZ4t3ui", "date": "2019-11-03 23:15:04"}, "187": {"text": "RT @PeteForAmerica: November 3, 2019: Build a movement.\nNovember 3, 2020: Win the era. https://t.co/uGkdqCmAyo", "date": "2019-11-03 17:53:23"}, "188": {"text": "Auditor @RobSandIA did not steer us wrong with the hometown dining tips. Ridiculously good Ronnie’s Rolls from Ruby’s to start the day off right in Decorah, among other local treats. Will have to come back! https://t.co/tuowtCz0QS", "date": "2019-11-03 16:31:37"}, "189": {"text": "I am not just here to end the era of Donald Trump. I am here to launch the era that must come next—one of hope and belonging. https://t.co/0qpa8b7MKU", "date": "2019-11-03 00:38:43"}, "190": {"text": "RT @PeteForAmerica: A president. https://t.co/G6d94cJyfo", "date": "2019-11-02 23:41:42"}, "191": {"text": "RT @PeteForAmerica: People with disabilities are too often asked to navigate a world that was not built with them in mind. That’s why @Pete…", "date": "2019-11-02 14:14:47"}, "192": {"text": "Our country is stronger when we draw on the talents and capacity of every American. As president, I will work with advocates to create a new era of inclusion and belonging for people with disabilities. https://t.co/ByjEeFPVRk", "date": "2019-11-02 13:21:39"}, "193": {"text": "Thank you, Iowa! Let's go make history. #LJ19 https://t.co/ahHG504JFp", "date": "2019-11-02 03:09:21"}, "194": {"text": "I am ready to galvanize an American majority that is longing for change, done with division, and prepared to act. Iowa, are you with me? #LJ19 https://t.co/1rUIyDaOig", "date": "2019-11-02 02:21:48"}, "195": {"text": "I just stepped off the #LJ19 stage. If you’re with me, please chip in—and let’s go make history. https://t.co/rYoEiIdhiR", "date": "2019-11-02 01:09:42"}, "196": {"text": "RT @PeteForAmerica: Watch history unfold 👇\nhttps://t.co/4TZLRkbmxi", "date": "2019-11-02 00:18:55"}, "197": {"text": "I’m about to take the #LJ19 stage for a night that will keep us on track toward winning the nomination. I hope I make you proud. My team will tweet for me while I'm on stage. Follow along and watch live here: https://t.co/U2kaNdHtAl", "date": "2019-11-02 00:14:16"}, "198": {"text": "Tonight, we’re back for #LJ19, our biggest Iowa event yet. I’ve got my family, those same friends, thousands of supporters by my side—and you. I am profoundly grateful to you, every @PeteForAmerica volunteer, and the more than 600,000 individual supporters who've gotten us here.", "date": "2019-11-02 00:14:16"}, "199": {"text": "Nine months ago, a few friends and I arrived in Iowa for my first trip of this campaign. We started in Ames and finished right here in Des Moines, where I met with a few dozen folks for coffee. That trip—like many I've taken since—was an act of hope.", "date": "2019-11-02 00:14:16"}, "200": {"text": "RT @PeteForAmerica: @marisolssamayoa @PeteButtigieg @BenHarper @Rodericka17 .@PeteButtigieg's pre-LJ rally is over but the night has just b…", "date": "2019-11-01 23:58:12"}, "201": {"text": "Running for office is an act of hope. I’m grateful to @BetoORourke for his leadership and for offering hope to Americans across our country. I know he will continue to fight for a safer and brighter future where all belong. https://t.co/hdueS7sfF1", "date": "2019-11-01 23:12:13"}, "202": {"text": "RT @PeteForAmerica: @marisolssamayoa We’re moments away from our pre-LJ rally with @PeteButtigieg and @BenHarper. Deputy Research Director…", "date": "2019-11-01 21:04:46"}, "203": {"text": "RT @PeteForAmerica: 🗣️BOOT \n🗣️EDGE\n🗣️EDGE https://t.co/Jszr8Kg0Mf", "date": "2019-11-01 20:05:12"}, "204": {"text": "RT @PeteForAmerica: “A new culture of belonging is the sort of thing that only the powers of the presidency can deliver. Not the legal powe…", "date": "2019-11-01 19:30:52"}, "205": {"text": "RT @PeteForAmerica: Iowa Rule #54: Make a few friends https://t.co/zHUzSZEfP5", "date": "2019-11-01 19:18:22"}, "206": {"text": "RT @PeteForAmerica: Something special is happening in Iowa—and we’re just getting started! https://t.co/X60aPcCmPS", "date": "2019-11-01 17:31:26"}, "207": {"text": "Ready for #LJ19. https://t.co/M76ZBfqML8", "date": "2019-11-01 16:36:07"}, "208": {"text": "RT @PeteForAmerica: Iowa Rule #43: Always play to win! https://t.co/eN3CGVaDIi", "date": "2019-11-01 14:35:06"}, "209": {"text": "RT @PeteForAmerica: What’s the Liberty-Justice Dinner? It’s only one of the biggest events in Iowa politics! @marisolssamayoa breaks down t…", "date": "2019-11-01 14:33:58"}, "210": {"text": "155 years ago, in the midst of the Civil War, Nevada was admitted to the Union. Their quest for statehood is a reminder that even at our most divided there is strength in unity. Happy #NevadaDay from all of us at @PeteForAmerica.", "date": "2019-11-01 01:07:56"}, "211": {"text": "RT @PeteForAmerica: Mobilize hope. https://t.co/N5KOfwGbWS", "date": "2019-11-01 00:19:02"}, "212": {"text": "RT @PeteForAmerica: Gearing up for #LJ19? Don’t miss a beat. Tag @PeteForAmerica to share your best moments with all of #TeamPete. And foll…", "date": "2019-11-01 00:18:54"}, "213": {"text": "Women are held to a different standard. Washington continues to prove it. We must work together to build lasting power for women in our politics, our economy, and our society. https://t.co/1KcB4uJGIY", "date": "2019-11-01 00:18:27"}, "214": {"text": "RT @PeteForAmerica: America needs a fresh start. https://t.co/beqNLBXMv5", "date": "2019-10-31 23:19:52"}, "215": {"text": "Thank you, @AdyBarkan, for lifting our stories and courageously using your own to advocate for better health care in America. https://t.co/BIJba26m20", "date": "2019-10-31 20:00:18"}, "216": {"text": "Game on. https://t.co/lyQtsAm7Wp", "date": "2019-10-31 19:05:48"}, "217": {"text": "RT @PeteForAmerica: Curiosity—to understand the perspective of all Americans, to learn not just what, but why things are happening—is a pre…", "date": "2019-10-31 17:53:13"}, "218": {"text": "This president took an oath to protect and defend the Constitution. So did every member of Congress. This president violated that oath, betraying our country and leaving our representatives with no choice but to uphold their own. Congress must move forward with impeachment.", "date": "2019-10-31 15:36:59"}, "219": {"text": "Today was one for the books. We're officially on the ballot in New Hampshire. Now let's go win. https://t.co/7tyZOawKbw", "date": "2019-10-31 02:36:04"}, "220": {"text": "Digital platforms should accept their responsibility for truth in advertising, or they shouldn’t be in the business at all. If they run a political ad shown to be false, it should be removed—just like a TV station would do. We must act to protect our democracy in the digital age.", "date": "2019-10-31 01:53:17"}, "221": {"text": "RT @PeteForAmerica: First. https://t.co/7ocpQh12hU", "date": "2019-10-30 23:49:14"}, "222": {"text": "@NotifyLA My thoughts continue to be with all those in the paths of these life-threatening wildfires—from Easy to Getty to Kincade. Thank you to the firefighters and public servants working to keep California safe. We must act now to prevent climate catastrophe. https://t.co/Phz1L2fmUn", "date": "2019-10-30 21:28:26"}, "223": {"text": "RT @PeteForAmerica: It's official: @PeteButtigieg is the first major candidate to join the ballot for New Hampshire's first-in-the-nation p…", "date": "2019-10-30 17:58:06"}, "224": {"text": "History will remember those who stood up to defend our republic, and the congressional Republicans who stood in their way.", "date": "2019-10-30 02:55:18"}, "225": {"text": "Lt. Col. Alexander Vindman is an American patriot who should be honored for his courage—in a war zone and in a congressional hearing room. It's time for congressional Republicans to summon just an ounce of his courage by putting country ahead of party and supporting impeachment.", "date": "2019-10-30 01:11:31"}, "226": {"text": "Seven years ago today, Hurricane Sandy made landfall in NY, claiming hundreds of lives and inflicting billions of dollars in damages. It was the second-costliest hurricane America had ever seen...until Harvey. Climate disasters are worsening and we're running out of time to act. https://t.co/BPI36oipbO", "date": "2019-10-29 22:23:20"}, "227": {"text": "It’s past time to end the assault on reproductive freedom in our country. As president, I will act to safeguard the constitutional right to safe and legal abortion and related care. And together, we will #StopTheBans. https://t.co/PjLMn9ZuMY", "date": "2019-10-29 21:28:02"}, "228": {"text": "Good. https://t.co/mRyUuQX5s8", "date": "2019-10-29 21:22:53"}, "229": {"text": "RT @PeteForAmerica: Change is coming. https://t.co/gbFHYmlvGm", "date": "2019-10-29 01:03:25"}, "230": {"text": "My thoughts are with all those in the paths of the wildfires ravaging California. We can't wait to fortify our communities from the devastating effects of climate change—and we must act before it’s too late. LA, stay safe and follow @NotifyLA for #GettyFire updates. https://t.co/LvC9312zke", "date": "2019-10-28 21:21:35"}, "231": {"text": "Kay Hagan provided the 60th and decisive vote for the Affordable Care Act—knowing she could lose her seat in the Senate. She served with a brand of courage sorely missing in today's Washington. My deepest condolences are with her family, friends, and the people of North Carolina.", "date": "2019-10-28 19:32:14"}, "232": {"text": "John Conyers fought for our country on the fields of war, on the frontlines of the civil rights movement, and in the halls of Congress. From MLK Day to the Congressional Black Caucus, his contributions cannot be forgotten. My deepest condolences are with his family and community.", "date": "2019-10-28 00:27:39"}, "233": {"text": "Happy #Diwali to all those celebrating across America and around the world. May the Festival of Lights remind us that knowledge eventually wins over ignorance, and good ultimately triumphs over evil. https://t.co/Lj438udYgK", "date": "2019-10-27 21:09:55"}, "234": {"text": "Today marks one year since the deadliest anti-Semitic attack in U.S. history, when a white supremacist with a gun stormed Pittsburgh’s Tree of Life Synagogue, killing eleven and injuring six. May their memory be a blessing—and a reminder that our leaders must act.", "date": "2019-10-27 19:32:27"}, "235": {"text": "This is a blow against ISIS and an important step in the fight against stateless terrorism. Credit should go to all who were involved; above all to the brave Americans in uniform and intelligence professionals who risked their lives to complete this mission. Today, we honor them. https://t.co/DYYaotLN6D", "date": "2019-10-27 17:54:24"}, "236": {"text": "RT @PeteForAmerica: Not only did @PeteButtigieg launch a new policy this week that would build women’s power, but he debuted that policy in…", "date": "2019-10-26 19:16:54"}, "237": {"text": "Let’s do this. https://t.co/yd4O5YK83L", "date": "2019-10-26 18:35:59"}, "238": {"text": "It’s past time to recognize that our criminal justice system is unfair, and in many ways, racist. Today, I’m detailing a bold plan to transform the criminal legal system into one that truly secures justice and benefits all Americans. https://t.co/UWK1v4yipp", "date": "2019-10-26 13:25:44"}, "239": {"text": "RT @PeteForAmerica: To all the women fighting to be heard in their workplaces, their communities, and our country, #TeamPete stands with yo…", "date": "2019-10-26 01:46:03"}, "240": {"text": "Encouraged to hear @GM has reached an agreement with the @UAW, ending the longest automotive strike in 50 years. To all those who took to the picket line, your sacrifices paid off, and your protests reminded the nation of the urgent need to deliver #UnionsForAll. https://t.co/bmDFSbLBYY", "date": "2019-10-25 21:24:17"}, "241": {"text": "In South Bend, we refused to make officers double as ICE agents because it reduces trust, makes communities less safe, and it's just plain wrong. I applaud the @LVMPD for ending its 287-G agreement, and as president, I’ll end the program altogether. https://t.co/NPivNii2iz", "date": "2019-10-25 21:09:27"}, "242": {"text": "RT @PeteForAmerica: Our National Policy Director, @SonalRShah knows we have an obligation to empower women at every level. That’s why we’ve…", "date": "2019-10-25 19:36:07"}, "243": {"text": "RT @PeteForAmerica: For millions of women and girls in America, the stakes in this upcoming election could not be higher. That's why @JessO…", "date": "2019-10-25 19:02:30"}, "244": {"text": "RT @PeteForAmerica: “One of my biggest advocates as I thought about running for office—a leader who inspired me in my journey to public ser…", "date": "2019-10-25 19:00:53"}, "245": {"text": "RT @PeteForAmerica: Our campaign is built by women like @NinaSophia81—and so are our policies. That's why @PeteButtigieg just unveiled a bo…", "date": "2019-10-25 15:15:41"}, "246": {"text": "RT @PeteForAmerica: Millions of women like @Arielle_Moyee are juggling both professional success and motherhood by themselves. @PeteButtigi…", "date": "2019-10-25 13:57:03"}, "247": {"text": "RT @PeteForAmerica: Terri made a point to meet with every presidential candidate, but @PeteButtigieg stuck with her because of his commitme…", "date": "2019-10-25 13:25:26"}, "248": {"text": "@AdyBarkan We both believe every American has the right to health care. We just diverge on how to make it a reality. The current rules of our politics might say this means we shouldn't talk to each other—but it’s better that we exchange ideas and bear in mind our common goal.", "date": "2019-10-25 01:18:37"}, "249": {"text": "Tonight I’m in New Hampshire where I’ll speak about my comprehensive new plan to build lasting economic, political, and social power for women in America. Watch live: https://t.co/Geni8WAei4", "date": "2019-10-25 00:01:00"}, "250": {"text": "RT @PeteForAmerica: Vivianna is a survivor in every sense of the word. @PeteButtigieg's plan ensures that all women, especially women of co…", "date": "2019-10-24 23:40:44"}, "251": {"text": "I sat down with @AdyBarkan for a personal and substantive conversation about how to best reach our shared goal of providing every American with quality, affordable health care. Thanks again for having me, Ady. I appreciate you and your work.\n https://t.co/21t6oggqMm", "date": "2019-10-24 23:30:48"}, "252": {"text": "RT @PeteForAmerica: We cannot solve America's problems with one hand tied behind our backs. Our new plan ensures every woman is empowered t…", "date": "2019-10-24 22:49:20"}, "253": {"text": "RT @PeteForAmerica: Access to reproductive care is one of the biggest issues for voters like Dara—that’s why @PeteButtigieg has built a pla…", "date": "2019-10-24 20:31:07"}, "254": {"text": "RT @PeteForAmerica: Society forces too many women to shrink themselves—to be seen and not heard. It's time to build a world where every wom…", "date": "2019-10-24 19:48:44"}, "255": {"text": "A big thanks to my friend @TimRyan for his service and passion. Tim is a tireless fighter for working families and the industrial communities we both come from. I look forward to working with him in Washington to build an economy that works for all Americans. https://t.co/SLxlHW3Iua", "date": "2019-10-24 18:10:46"}, "256": {"text": "RT @PeteForAmerica: When racism and sexism intersect, the damage to women of color is compounded—that’s why @PeteButtigieg's plan closes th…", "date": "2019-10-24 16:46:39"}, "257": {"text": "RT @PeteForAmerica: Senior Advisor @JessOConnell sat down with @PeteButtigieg to talk about our new policy to build power—and a better futu…", "date": "2019-10-24 15:35:54"}, "258": {"text": "RT @AdyBarkan: \"The ability to communicate is so essential to feeling human.\" \n\nLater today — my interview with @PeteButtigieg. Tune in. ht…", "date": "2019-10-24 15:21:12"}, "259": {"text": "Every woman has the right to live free from violence, harassment, and discrimination. As president, I will work to secure safe communities for all women. That's why today—on #PurpleThursday—I'm sharing my plan to build lasting power for women in America. https://t.co/hImaesDCso", "date": "2019-10-24 14:31:51"}, "260": {"text": "RT @PeteForAmerica: The freedom of women is bound up in the freedom of all Americans: https://t.co/KU5YeD9PfE https://t.co/A9tjcvnJvj", "date": "2019-10-24 13:14:35"}, "261": {"text": "It’s time for a president who understands that freedom for women doesn’t mean incremental progress—it means lasting power. Today, I’m proud to announce a plan to help secure economic, political, and social equality for all women in America: https://t.co/hImaesDCso https://t.co/BP5Lnm7T5a", "date": "2019-10-24 10:39:19"}, "262": {"text": "Everything about my experience in the military was abundantly real, from the boredom to the danger. \n\nNow shall we talk about Donald Trump’s experiences with military service? https://t.co/WVTsvLbzhk", "date": "2019-10-24 02:18:07"}, "263": {"text": "This conversation was personal as well as substantive, and I look forward to sharing it with all of you. Thank you for having me, @AdyBarkan. https://t.co/1g0rWKOyCK", "date": "2019-10-23 21:00:31"}, "264": {"text": "@Culinary226 @stationcasinos @unitehere Thank you for having me. I'm grateful to your members for the services they provide and proud to stand with you in the fight for health care and economic justice.", "date": "2019-10-23 20:56:13"}, "265": {"text": "I used work in a SCIF, as a military officer. The importance of keeping it secure (i.e. from cell phone signals) was drilled into us so deeply that I’d have bad dreams about accidentally leaving my phone in the pocket of my uniform. This behavior is an embarrassment. https://t.co/20EVgwzNbv", "date": "2019-10-23 19:11:00"}, "266": {"text": "Ambassador Taylor confirmed what this president and his chief of staff have already admitted: quid pro quo and abuse of power. We know what he offered and what he wanted in return. \n\nThe only question now is one of integrity. It's time for Republicans to support impeachment.", "date": "2019-10-23 15:07:45"}, "267": {"text": "This is scientifically and medically absurd—and morally repugnant. https://t.co/WgBIuhHQVh", "date": "2019-10-22 23:33:59"}, "268": {"text": "This isn't just bad news for Syrian Kurds, it's bad news for America—brought to you by the president of the United States. His betrayal of our allies and our values is emboldening our adversaries, destroying our credibility, and weakening our national security. https://t.co/BUTIOa8Dgp", "date": "2019-10-22 22:00:22"}, "269": {"text": "The history of lynching in America is one of murderous torture and violent death, motivated by white supremacy, tolerated or even celebrated by ordinary people. \n\nTo equate this with a Constitutional process, underway to hold a lawless president accountable, is disgusting.", "date": "2019-10-22 16:25:39"}, "270": {"text": "RT @PeteForAmerica: From drinks in the park to slow jamming the news, these are our favorite late night moments from the campaign. \nhttps:/…", "date": "2019-10-22 16:02:53"}, "271": {"text": "RT @FallonTonight: Mayor @PeteButtigieg on his campaign message https://t.co/kW9c1lx2uk #FallonTonight https://t.co/KEEJ2cVxL8", "date": "2019-10-22 04:20:55"}, "272": {"text": "RT @FallonTonight: Mayor @PeteButtigieg on his \"Medicare for All Who Want It\" plan. More with Mayor @PeteButtigieg on #FallonTonight https:…", "date": "2019-10-22 02:43:35"}, "273": {"text": "Thanks for having me, @jimmyfallon! \n\nCatch us tonight at 11:35 ET on @NBC. https://t.co/TTOcXuq9Xh", "date": "2019-10-22 01:04:33"}, "274": {"text": "This commander in chief is robbing our troops of their honor. If you take away a soldier’s honor, you might as well take away their armor next. https://t.co/hYA3wnZ0jr", "date": "2019-10-21 21:31:28"}, "275": {"text": "RT @PeteForAmerica: You won't want to miss @FallonTonight!\n\nTune in tonight—and find @PeteButtigieg on @Snapchat for more behind-the-scenes…", "date": "2019-10-21 21:01:24"}, "276": {"text": "@AndreaJPhillips Thank you for participating, Andrea, and for being an important voice on this issue in your race. Together, we can bring real progress on this issue.", "date": "2019-10-21 20:34:47"}, "277": {"text": "You can’t uphold your oath to protect and defend the Constitution if you think it’s phony. https://t.co/gkoJ9uCkGd", "date": "2019-10-21 20:32:26"}, "278": {"text": "RT @PeteForAmerica: .@PeteButtigieg has a plan to restore fairness and balance to our economy—so that every worker can share in America's g…", "date": "2019-10-21 15:30:23"}, "279": {"text": "RT @PeteForAmerica: Pennsylvania is ready for a new era. \nhttps://t.co/KJdXaK1EoB", "date": "2019-10-21 14:15:00"}, "280": {"text": "RT @GiffordsCourage: .@PeteButtigieg was in high school when the Columbine shooting happened. 20 years later, not enough has changed.\n\nWatc…", "date": "2019-10-21 13:47:39"}, "281": {"text": "RT @PeteForAmerica: ICYMI: This past week, our Boot Pledge Pledge Weekend of Action was met with success, @PeteButtigieg won the fourth deb…", "date": "2019-10-21 00:23:15"}, "282": {"text": "RT @PeteForAmerica: This morning, @PeteButtigieg sat down with @CNNSOTU, @MeetThePress, and @FoxNewsSunday, where he talked about foreign p…", "date": "2019-10-20 21:18:33"}, "283": {"text": "RT @PeteForAmerica: \"Imagine the sun rising on the morning after this president leaves office. We will be relieved. But we will also be div…", "date": "2019-10-19 18:01:56"}, "284": {"text": "Santa Clara County families and children depend on the services @SCCgov workers provide—those workers should be treated fairly and with respect. I stand in solidarity with @SEIU521 because it’s time to #ProtectSantaClaraCounty and provide #UnionsForAll. https://t.co/D6ahgBQyU6", "date": "2019-10-19 15:22:43"}, "285": {"text": "This president is systematically destroying American alliances and American values, robbing our troops of their honor, and weakening our democracy at its core. One way or another, he must be removed from office.\n\n“The fate of our Republic depends upon it.”\nhttps://t.co/W4uIM8WOPl", "date": "2019-10-19 02:03:23"}, "286": {"text": "Denied a living wage and quality health care, the @Teamsters25 have been on strike for nearly two months against @RepublicService. Their strike is an urgent reminder of why we need #UnionsForAll, and I stand with them.", "date": "2019-10-19 00:17:41"}, "287": {"text": "“The stars don't look bigger, but they do look brighter.” —Sally Ride https://t.co/dEJD6IJbAA", "date": "2019-10-18 16:19:48"}, "288": {"text": "RT @PeteForAmerica: We need a president that will restore U.S. credibility and bring us together to tackle our biggest challenges. On Tuesd…", "date": "2019-10-18 01:17:22"}, "289": {"text": "The purpose of the presidency is not the glorification of the president. https://t.co/FZHMuZqbKG", "date": "2019-10-17 21:53:31"}, "290": {"text": "RT @PeteForAmerica: Volunteers win elections → https://t.co/7xmc5lpms9 https://t.co/qb37GHJAHy", "date": "2019-10-17 20:49:35"}, "291": {"text": "Picture it. https://t.co/5xBusDy6QJ", "date": "2019-10-17 18:13:22"}, "292": {"text": "“I want justice, oceans of it. I want fairness, rivers of it. That’s what I want.” —@RepCummings, a man of courage and faith \n\nMy deepest sympathies are with the Cummings family and his community. Let us honor him by insisting on justice and integrity in leadership, as he did.", "date": "2019-10-17 14:50:11"}, "293": {"text": "Thank you, Madam Speaker, for literally standing up for our country. https://t.co/qu2c80zvKn", "date": "2019-10-17 01:56:36"}, "294": {"text": "RT @PeteForAmerica: We won the #DemDebate. Now help us win the era: https://t.co/ZabR8Cu9SP https://t.co/2ZVkOzvVW9", "date": "2019-10-17 00:28:28"}, "295": {"text": "RT @PeteForAmerica: BIG UPDATE: @PeteButtigieg’s #DemDebate didn’t just blow us away, it accelerated our movement.\n \nIn the last 24 hours,…", "date": "2019-10-16 22:24:22"}, "296": {"text": "RT @PeteForAmerica: ICYMI: @PeteButtigieg is in it for all of us. https://t.co/XjARq2rjOO", "date": "2019-10-16 20:24:10"}, "297": {"text": "@PeteForAmerica @Snapchat @instagram I just stepped off the #DemDebate stage. I hope I made you proud. If you’re with me, please chip in and let’s keep going. https://t.co/rYoEiIdhiR", "date": "2019-10-16 03:38:53"}, "298": {"text": "The purpose of the presidency is not the glorification of the president. It is the unification of the American people. #DemDebate https://t.co/EI1lMu6Y83", "date": "2019-10-16 03:18:27"}, "299": {"text": "RT @PeteForAmerica: Together, we can accomplish anything. #DemDebate https://t.co/VjobPjTeIo", "date": "2019-10-16 03:11:40"}, "300": {"text": "RT @PeteForAmerica: It's not the polls—it's the policy.\n\n#DemDebate https://t.co/412dCNN5yu", "date": "2019-10-16 02:53:34"}, "301": {"text": "Imagine the sun rising on the morning after this president leaves office. We will be relieved, but we will be divided. And we will have big problems to solve. We must be ready to work together to build a brighter future. #DemDebate", "date": "2019-10-16 02:51:34"}, "302": {"text": "I don’t believe in going back to “normal.” That didn’t work. That’s part of how we got here in the first place. It’s time for something new. #DemDebate https://t.co/HemxNLBfGX", "date": "2019-10-16 02:45:03"}, "303": {"text": "It’s time to reform and depoliticize the Supreme Court. #DemDebate https://t.co/BKuoKfmXzD", "date": "2019-10-16 02:33:21"}, "304": {"text": "My policy decisions and my appointments to the bench will reflect the fact that I trust women to make their own decisions about their health. #DemDebate", "date": "2019-10-16 02:28:20"}, "305": {"text": "RT @PeteForAmerica: We cannot wait #DemDebate https://t.co/QA9EHqdY3L", "date": "2019-10-16 02:16:30"}, "306": {"text": "I’m focused on building a modern economy that works for everyone. #DemDebate", "date": "2019-10-16 02:08:18"}, "307": {"text": "We owe survivors real solutions. It is time to stop talking. It is time to act. #DemDebate https://t.co/QSXcn50E16", "date": "2019-10-16 01:50:07"}, "308": {"text": "The real obstacle to ending the era of mass shootings in our country isn’t on the #DemDebate stage. It’s the @NRA and its enablers in Washington. #DemDebate https://t.co/suN2YQqWtb", "date": "2019-10-16 01:47:48"}, "309": {"text": "I was in high school when Columbine happened. Years have passed, yet the only thing Washington politicians do consistently is fail to deliver. We owe it to our children to give them back their childhoods. We can’t wait. We need leaders ready to act. #DemDebate", "date": "2019-10-16 01:45:09"}, "310": {"text": "We can’t wait. People are dying in the streets right now. We can’t wait for universal background checks. We can’t wait for red flag laws. We can’t wait for purity tests. We just have to get things done. #DemDebate https://t.co/L8h9Wszh7x", "date": "2019-10-16 01:39:27"}, "311": {"text": "The world needs an American president. It does not have one right now. #DemDebate https://t.co/zwKw0PSdW8", "date": "2019-10-16 01:32:40"}, "312": {"text": "As an American, I’m outraged by this commander in chief's betrayal. As a veteran, I’m deeply disturbed to hear soldiers say he has robbed them of their honor. If you take away a soldier’s honor, you might as well take away their armor. That’s what he has done. #DemDebate https://t.co/FDx2pB4RpM", "date": "2019-10-16 01:24:07"}, "313": {"text": "The slaughter going on in Syria is not the consequence of American presence, it is the consequence of American withdrawal and betrayal. #DemDebate https://t.co/zeVL3hQp4W", "date": "2019-10-16 01:20:52"}, "314": {"text": "RT @PeteForAmerica: Are you watching @PeteButtigieg in tonight’s #DemDebate? Comment below with a photo from your watch party for a chance…", "date": "2019-10-16 01:11:05"}, "315": {"text": "Washington politicians are measuring the wrong thing.\n\nWhat good is it if the Dow goes up but middle-class families can't pay their bills? As president, my focus won't just be on the growth of the the stock market. It will be on the growth of your paycheck. #DemDebate", "date": "2019-10-16 01:03:23"}, "316": {"text": "Places like Lordstown, Ohio—where auto plants have closed—are examples of the broken promises this president has made to workers. Workers deserve a president who will keep their promises and put them back to work. #DemDebate https://t.co/6V3i0faPGr", "date": "2019-10-16 01:00:52"}, "317": {"text": "My plan, Medicare for All Who Want It, will get you covered and put you back in charge. It won’t raise your taxes or kick you off a plan you want to keep. Because I trust you to make the right health care decisions for yourself and your family. #DemDebate https://t.co/55Yo6f8Xdd", "date": "2019-10-16 00:44:47"}, "318": {"text": "A gig is a job and anyone doing a job is a worker. It’s time for fair wages and #UnionsForAll. #DemDebate https://t.co/4asHTTr2sw", "date": "2019-10-16 00:42:04"}, "319": {"text": "I trust you to make the right health care decisions for yourself and your family—and I have a plan to help you pay for it. #DemDebate https://t.co/FDIG2Td2rt", "date": "2019-10-16 00:30:51"}, "320": {"text": "One way or another, this presidency is going to come to an end. Picture what it will feel like. I’m running to be a president who will turn the page and unify a dangerously polarized country. #DemDebate https://t.co/e7UjKWAgbq", "date": "2019-10-16 00:21:27"}, "321": {"text": "Moving forward with impeachment is not just about this president, it’s about the presidency. Future generations will rightfully judge us for how we respond. #DemDebate", "date": "2019-10-16 00:05:26"}, "322": {"text": "This president should be impeached. #DemDebate", "date": "2019-10-16 00:02:22"}, "323": {"text": "My team in South Bend will tweet for me while I’m on stage. Stick here for live #DemDebate coverage, and follow @PeteForAmerica for more #TeamPete updates. We've also got plans for @Snapchat and @Instagram. Be sure to follow along and see you on the other side!", "date": "2019-10-15 23:36:34"}, "324": {"text": "Before I take the #DemDebate stage, a big thank you to our volunteers and the more than 580,000 individual donors who've powered our campaign. We’re uniting Americans to meet this moment because the stakes are too high. I hope I make you proud.", "date": "2019-10-15 23:36:34"}, "325": {"text": "RT @Chas10Buttigieg: Always proud to stand by your side, P. America is hurting, and I only hope you can do for our country what you’ve done…", "date": "2019-10-15 23:22:20"}, "326": {"text": "RT @PeteForAmerica: Before @PeteButtigieg takes the stage, we’re premiering our Debate Pre-Show on @YouTube. Tune in for exclusive content…", "date": "2019-10-15 22:58:01"}, "327": {"text": "Thank you, all. I'm proud to be your choice for president. https://t.co/yHlS7pNVkT", "date": "2019-10-15 22:14:05"}, "328": {"text": "RT @PeteForAmerica: We're building a grassroots movement to meet the urgency of this moment—580,000+ acts of hope at a time. #DemDebate htt…", "date": "2019-10-15 22:11:03"}, "329": {"text": "RT @PeteForAmerica: Want even more @PeteButtigieg before tonight’s #DemDebate? Make sure you’re subscribed to his @Snapchat for behind-the-…", "date": "2019-10-15 18:18:31"}, "330": {"text": "RT @PeteForAmerica: Two lucky winners and their guests got to share a slice of joy with @PeteButtigieg. Follow @PeteForAmerica on @YouTube…", "date": "2019-10-15 18:18:21"}, "331": {"text": "You deserve the freedom to choose an affordable health care plan that works for you and your family.\n\nMedicare open enrollment is underway. Enroll or learn more: https://t.co/StRd5OzFnw\n\nThen read about my plan to cut Rx drug costs for seniors on Medicare: https://t.co/GwVXnxLYbr https://t.co/miTYf6K61p", "date": "2019-10-15 16:39:46"}, "332": {"text": "RT @PeteForAmerica: When you trust voters, they trust you back: https://t.co/jOIRPpAGma https://t.co/ToVmiYx9Uf", "date": "2019-10-15 16:05:23"}, "333": {"text": "RT @PeteForAmerica: Need a refresher before tonight’s #DemDebate? Watch @PeteButtigieg’s highlights from the previous debate—then join the…", "date": "2019-10-15 14:03:16"}, "334": {"text": "I’ve got a health care plan to get you covered and put you back in charge. \n\nBecause I trust you to make the right health care decisions for yourself and your family. Learn more: https://t.co/VDTTpA0hVe https://t.co/lApgSa1NpS", "date": "2019-10-15 01:13:51"}, "335": {"text": "As an American, I’m outraged by this commander in chief's betrayal. As a veteran, I’m deeply disturbed to hear soldiers say he has robbed them of their honor. https://t.co/zRoMgZ8nl9", "date": "2019-10-14 23:09:46"}, "336": {"text": "RT @PeteForAmerica: Spread hope → https://t.co/7xmc5lGXQJ https://t.co/hVkqlmkZF3", "date": "2019-10-14 20:02:35"}, "337": {"text": "RT @PeteForAmerica: Our infrastructure is crumbling, and Native communities are paying the price. @PeteButtigieg has a plan to ensure clean…", "date": "2019-10-14 20:01:31"}, "338": {"text": "One week later, we see ISIS fighters escaping and Assad and Russia advancing. This president is not “ending an endless war,” he's fueling one. https://t.co/BDprmzydAg", "date": "2019-10-14 17:53:31"}, "339": {"text": "It's time to reset our relationships and interactions with Tribal Nations. Today, I’m announcing a plan to promote the rights of Tribal Nations and enhance opportunities for Native people to thrive: https://t.co/XvYewYzVvN https://t.co/nHZJzBp0Ye", "date": "2019-10-14 13:17:23"}, "340": {"text": "This president is systematically destroying American alliances and American values, resulting in a weaker America and a more chaotic world. https://t.co/uqsrgBCmLu", "date": "2019-10-13 20:39:01"}, "341": {"text": "There is no higher honor than serving our country. Happy 244th #USNavy birthday to my fellow @USNavy reservists, sailors, veterans, and their families across the fleet! Thank you for your service.", "date": "2019-10-13 18:35:32"}, "342": {"text": "America’s farmers feed the world and fuel our economy. Because of them, rural America is brimming with possibility. To our farmers, you have our thanks and support. Happy National Farmers Day!", "date": "2019-10-13 00:29:12"}, "343": {"text": "I was 16 when I saw the news. Matthew Shepard’s murder taught me and many in this country that homophobia kills. Let us honor his life by channeling pain into purpose and striving to build a country where all belong. https://t.co/HKmFuQoowb", "date": "2019-10-12 23:34:41"}, "344": {"text": "RT @PeteForAmerica: 4 days. \n9 stops. \n\nA whole lot of memories! https://t.co/INLi2P5BRr", "date": "2019-10-12 19:08:17"}, "345": {"text": "Glad you picked up—so many people are proud of you and we’re wishing you every success as mayor! https://t.co/ugudYIVPk6", "date": "2019-10-12 01:16:32"}, "346": {"text": "Elected at 41, Prime Minister @AbiyAhmedAli showed the world that hope can triumph over hostility by seeking lasting peace between Ethiopia and Eritrea. A new generation of global leaders is rising to advance peace and security. https://t.co/SWMpqKbBtC", "date": "2019-10-11 20:46:22"}, "347": {"text": "RT @PeteForAmerica: “You are loved. There is space for you here. And we promise that no matter where you find family, you will always be ab…", "date": "2019-10-11 20:10:37"}, "348": {"text": "Syrian Kurds put their lives on the line because they trusted America. This president broke that trust. He betrayed our allies and our values, and people will die because of it. The world deserves an American president who can be trusted.", "date": "2019-10-11 20:00:06"}, "349": {"text": "We were warned. \n\nNow it has begun: ISIS benefits from the president’s abandonment of our allies in Syria.\n\nThere will be more where this came from. https://t.co/tESjcEdRaE", "date": "2019-10-11 19:24:07"}, "350": {"text": "RT @PeteForAmerica: No coming out story is the same, but in nearly all of them is an act of hope #NationalComingOutDay\nhttps://t.co/cP65pvB…", "date": "2019-10-11 17:44:27"}, "351": {"text": "Coming out requires finding the courage to share your truth. It requires you to stand on the hope that you will be accepted, and the faith that you can overcome rejection. If today is your day, I am proud of you. Your future is bright. You belong. Happy #NationalComingOutDay!", "date": "2019-10-11 15:33:16"}, "352": {"text": "Coming out is difficult. It was for me, too. After serving overseas, I realized that every day is a gift. I did not want to live my life without knowing what it is like to be in love. Years later, I am running for president with my loving husband @Chas10Buttigieg by my side.", "date": "2019-10-11 15:33:15"}, "353": {"text": "They see a president banning trans service members from the military and attacking gay rights. They see queer-friendly businesses opening but can't forget Pulse. They see hate crimes rising. They see a country where they are still not fully free or safe—unsure if they belong.", "date": "2019-10-11 15:33:15"}, "354": {"text": "Twenty years ago, an awkward teenager at St. Joe High School in South Bend, Indiana, who didn’t know a single out LGBTQ+ student, never would have imagined how far we would come as a country. But what does our country look like to a closeted teen today? What future do they see?", "date": "2019-10-11 15:33:15"}, "355": {"text": "Our team makes me so proud every day. Thanks for speaking from the heart and for proving that everyone belongs. https://t.co/pLly4Su0eZ", "date": "2019-10-11 14:09:12"}, "356": {"text": "The Christian tradition that I belong to instructs me to identify with the marginalized. It tells me that the greatest thing any of us has to offer is love. Using my religion—any religion—as an excuse to harm others is an insult to faith. #EqualityTownHall https://t.co/rhZt3n7F59", "date": "2019-10-11 03:03:04"}, "357": {"text": "RT @Chas10Buttigieg: You belong. \nYou are loved. \nYou are welcome here. https://t.co/bpnSoZCJ4G", "date": "2019-10-11 02:15:44"}, "358": {"text": "My blood is not welcome in this country. That is based on prejudice, not science. And when I’m president, I will direct the FDA to revise the rules based on evidence and individual risk factors. #EqualityTownHall https://t.co/2lpdDbe8Xz", "date": "2019-10-11 02:11:42"}, "359": {"text": "The transgender military ban is an outrage. Service members who are willing to put their lives on the line for our country are having their careers threatened by a president who avoided serving when it was his turn. #EqualityTownHall https://t.co/BPE8oOWGlb", "date": "2019-10-11 01:49:29"}, "360": {"text": "There is no right or wrong way to be a member of the LGBTQ+ community. You belong. #EqualityTownHall https://t.co/D9hKD2K97L", "date": "2019-10-11 01:37:13"}, "361": {"text": "@HRC @CNN I just stepped off the @CNN + @HRC stage. If I made you proud, please chip in to support our campaign. With your help, I'll use my story, and the power of the presidency, to tear down walls and build a new era for the LGBTQ+ community. https://t.co/rYoEiIdhiR", "date": "2019-10-11 01:18:46"}, "362": {"text": "This morning, I announced a bold new plan to build a new era for LGBTQ+ Americans. In a few moments, I’ll take the stage at @HRC + @CNN’s #PowerOfOurPride #EqualityTownHall. Tune in and watch live here: https://t.co/9W41vixU9r", "date": "2019-10-11 00:29:31"}, "363": {"text": "RT @Chas10Buttigieg: Here we go.\nTune in to @CNN at 8:30ET to watch @PeteButtigieg at the @HRC #EqualityTownHall. ❤️ https://t.co/xVSbVcGJPl", "date": "2019-10-11 00:15:24"}, "364": {"text": "After serving overseas, I realized that every day is a gift. It made no sense to remain so trapped by expectations that I might never know what it is like to be in love. So I came out. And now I’m proud to use my voice to stand for equality for all.\nhttps://t.co/sG6hAZVsQV", "date": "2019-10-10 20:19:32"}, "365": {"text": "RT @Chas10Buttigieg: “LGBTQ+ people aren’t just bystanders in American history—they are drivers of it. They have pushed our country to meet…", "date": "2019-10-10 14:50:54"}, "366": {"text": "I will use my story, our energy, and the power of the presidency to tear down the walls that have excluded far too many LGBTQ+ people for far too long. Today, I am proud to share my plan for building a new era for LGBTQ+ Americans: https://t.co/GPVecSJWEx https://t.co/vSHDfeW4xk", "date": "2019-10-10 10:49:43"}, "367": {"text": "The Day of Atonement is a reminder that we can all do our part to build a better future for our communities and for our world. I hope all those observing Yom Kippur had an easy and meaningful fast. G’mar Chatimah Tovah.", "date": "2019-10-09 23:34:00"}, "368": {"text": "I'm thinking of Levi and @BernieSanders today. All of us are sending our deepest condolences to their family. https://t.co/OSdoj5G26h", "date": "2019-10-09 19:53:45"}, "369": {"text": "Congratulations, Mayor-elect @stevenlouisreed! A historic first for Montgomery, and a hopeful step forward for everyone working to further the movement that crystalized in your city nearly half a century ago. https://t.co/YWp0WMXQZP", "date": "2019-10-09 19:28:11"}, "370": {"text": "Thank you, Collin. We’re building a movement to meet this moment, and a future where all Americans belong. I'm proud to have you on our team. https://t.co/yPEJ1CjN8n", "date": "2019-10-09 19:05:45"}, "371": {"text": "RT @PeteForAmerica: Meeting the American promise means righting past wrongs: https://t.co/XnChJKQYCE https://t.co/nE7m3Eawii", "date": "2019-10-09 17:29:27"}, "372": {"text": "RT @PeteForAmerica: The reviews are in and @PeteButtigieg’s new prescription drug plan is the boldest and most aggressive plan to tackle ri…", "date": "2019-10-08 19:46:02"}, "373": {"text": "All Americans should have the freedom to live and work without discrimination. Today, the Supreme Court will hear three cases that challenge that basic right for LGBTQ+ people. We deserve a Court that sees everyone and rules in favor of equality—for our generation and the next.", "date": "2019-10-08 13:56:23"}, "374": {"text": "RT @PeteForAmerica: Children should be thinking about school, not how they’re going to pay for their future insulin needs. Our new prescrip…", "date": "2019-10-07 22:57:46"}, "375": {"text": "Today marks 18 years since the U.S. invaded Afghanistan.\n\nThere are now soldiers old enough to deploy who were born after September 11th. We should honor their courage and patriotism by putting an end to endless war. https://t.co/NIscnGPHit", "date": "2019-10-07 21:27:38"}, "376": {"text": "RT @PeteForAmerica: Out-of-pocket-costs for prescription drugs in @PeteButtigieg’s Medicare for All Who Want It plan are capped at less tha…", "date": "2019-10-07 20:36:08"}, "377": {"text": "This president’s shameful decision on Syria is the latest example of chaos masquerading as foreign policy. It goes against all military advice. It harms our national interests, emboldens our adversaries, and it will cost lives. The world urgently needs real American leadership.", "date": "2019-10-07 19:16:46"}, "378": {"text": "RT @PeteForAmerica: Pete’s plan invests in American drug manufacturing, fixing this security threat: https://t.co/ofWC9KumwC\n\nhttps://t.co/…", "date": "2019-10-07 17:36:33"}, "379": {"text": "RT @PeteForAmerica: Like too many Americans, Sarah’s daily medication costs more than food or gas. That’s not right. @PeteButtigieg has a p…", "date": "2019-10-07 17:36:21"}, "380": {"text": "RT @PeteForAmerica: Our new prescription drug plan ensures that quality, affordable medicine is within reach of every American—regardless o…", "date": "2019-10-07 16:02:02"}, "381": {"text": "RT @PeteForAmerica: Rob spends his days helping patients think about drug pricing and affordability. @PeteButtigieg's plan makes co-payment…", "date": "2019-10-07 13:45:34"}, "382": {"text": "We've reached a breaking point: Medications in the U.S. are more expensive than anywhere else in the world. That's why today I’m announcing Affordable Medicine for All, a plan to reduce Rx drug costs, take on drug companies, and encourage innovation: https://t.co/GwVXnxLYbr https://t.co/zIhBLBCWqg", "date": "2019-10-07 10:23:48"}, "383": {"text": "Joshua Brown showed us what real courage looks like. Now we must show him and his family what real justice looks like. His murder must be investigated. We deserve answers.", "date": "2019-10-07 00:47:26"}, "384": {"text": "Today would have been Fannie Lou Hamer's 102nd birthday. We must honor her legacy by fighting to end suppression—by breaking down the barriers that make it harder for Black Americans to vote. As president, I will do everything in my power to protect that fundamental right.", "date": "2019-10-07 00:01:27"}, "385": {"text": "RT @PeteForAmerica: ICYMI: This week @PeteButtigieg met thousands in Sacramento, talked with @GabbyGiffords and students from @AMarch4OurLi…", "date": "2019-10-06 23:26:11"}, "386": {"text": "We need a president who will never again allow the marginalized to be pitted against each other—a president who will stand on the rubble of what's been done to our most cherished norms and institutions and lead us into a better era where everyone's empowered and everyone belongs. https://t.co/6ON76lrLV2", "date": "2019-10-06 20:08:43"}, "387": {"text": "RT @PeteForAmerica: Immigrants aren’t the problem—they’re part of the solution. \nhttps://t.co/yFA9Y7UxvB", "date": "2019-10-06 20:00:36"}, "388": {"text": "I want it said of my candidacy and of my presidency, not only that we strengthened Black America, but that we helped all of America understand that this nation is not what we think it is until equality is real. https://t.co/HaEDgUJ2qy", "date": "2019-10-06 03:14:43"}, "389": {"text": "This case threatens Roe v. Wade and it threatens women's ability to make their own decisions about their health.\n\nAnd it shows exactly what's at stake in this election. We need a president who sees reproductive health as a national right, and is ready to protect that freedom. https://t.co/HJPFNKB4EQ", "date": "2019-10-05 03:20:10"}, "390": {"text": "Tax breaks for large corporations are depriving our schools and health clinics of $11 billion a year. We can't afford to keep funding corporations at the expense of our communities. I stand with @seiucalifornia + @WeAreCTA in support of the #SchoolsAndCommunitiesFirst Initiative. https://t.co/nK186Ru80Y", "date": "2019-10-05 01:50:57"}, "391": {"text": "Once again, this president is attempting to fix a mess created by his own reckless policies. And once again, it’s too little too late for the Iowans who've already lost their jobs. We deserve better. https://t.co/aM1nkBKXSk", "date": "2019-10-04 20:22:40"}, "392": {"text": "Promising China our silence on human rights abuses is a betrayal of our values. Asking China to undermine our election is a betrayal of the republic for which we stand. Nothing would be better for China, or more destructive to our democracy, than four more years of this.", "date": "2019-10-04 17:19:57"}, "393": {"text": "@SEIU1984 Congratulations to the workers of Rockingham County Rehabilitation and Nursing Center for voting to unionize and join @SEIU1984! This is an important step in building a fairer economy, ensuring your voices are heard, and recognizing your care for others.", "date": "2019-10-03 22:41:47"}, "394": {"text": "@BarackObama Happy anniversary! Any advice?", "date": "2019-10-03 18:42:15"}, "395": {"text": "This president sounds more like a tinpot dictator than the leader of the free world. https://t.co/w1LbMoJzd2", "date": "2019-10-03 17:36:33"}, "396": {"text": "RT @PeteForAmerica: We need judges that respect a woman’s right to make her own health decisions: https://t.co/DFf0uJmT89", "date": "2019-10-03 17:31:40"}, "397": {"text": "Our fight for an open Internet is just beginning. As president, I will make net neutrality the law of the land, expand Internet access and opportunity, and protect the free flow of ideas for future generations. https://t.co/zEsCJeMhTf", "date": "2019-10-03 13:26:38"}, "398": {"text": "@gracieminabox @Chas10Buttigieg https://t.co/tqrPXM148C", "date": "2019-10-03 02:20:01"}, "399": {"text": "Calling this president’s behavior childlike is an insult to children. https://t.co/DgQQQ6qckc", "date": "2019-10-03 00:08:57"}, "400": {"text": "RT @GabbyGiffords: Mayor @PeteButtigieg will tell you that news of a shooting is one of the worst phone calls a mayor can ever get. Thank y…", "date": "2019-10-02 22:02:32"}, "401": {"text": "I am proud to stand with the workers of Rockingham County Rehabilitation and Nursing Center and @SEIU1984. To build a fair and prosperous future for all, every worker deserves a union to fight for fair wages, labor protections, and benefits.", "date": "2019-10-02 22:01:55"}, "402": {"text": "America’s mayors are actively working to keep our communities safe from gun violence. But we’re working with our hands tied behind our backs because our leaders in Washington have failed to help. #2020GunSafety https://t.co/S58kNlwCKX", "date": "2019-10-02 20:10:36"}, "403": {"text": "The @NRA is not speaking for gun owners. They’re speaking for gun company executives. #2020GunSafety https://t.co/2fnY57ZMnC", "date": "2019-10-02 19:23:22"}, "404": {"text": "No child in America should be compelled to write a will because our leaders have failed to protect them from gun violence. #2020GunSafety https://t.co/4We3R6kCqt", "date": "2019-10-02 19:13:34"}, "405": {"text": "RT @GiffordsCourage: .@PeteButtigieg is right — dangerous people shouldn’t be armed. #DisarmHate #2020GunSafety https://t.co/1HSNRwyt6x", "date": "2019-10-02 18:13:43"}, "406": {"text": "Stopping gun violence takes courage. I’m about to step on stage at the #2020GunSafety Forum to talk about how we can end the tragic cycle of gun violence in our country. Tune in. https://t.co/w1Pjkq6Dw4", "date": "2019-10-02 17:04:35"}, "407": {"text": "Today we mark a year of missed opportunities to live our values, hold dictators accountable, and act with principle in the Middle East. Saudi journalist Jamal Khashoggi loved his country, and died for it. https://t.co/AAO1ntxndP", "date": "2019-10-02 16:42:21"}, "408": {"text": "All of us here at @PeteForAmerica are sending our best wishes for a speedy recovery to Senator @BernieSanders. We're thinking of him and his family today, and I look forward to seeing him back on the campaign trail very soon.", "date": "2019-10-02 15:11:15"}, "409": {"text": "Last week, Houston lost one of its finest. My deepest sympathies are with Deputy Sandeep Dhaliwal's family, his community, and his fellow officers. His life set an example of inclusion and joy that all public servants should aspire to meet. https://t.co/QicX2YKdP6", "date": "2019-10-02 13:51:20"}, "410": {"text": "RT @PeteForAmerica: HBCUs are responsible for 80% of Black judges and 25% of STEM degrees—it’s time we gave them the funding that they dese…", "date": "2019-10-01 21:35:52"}, "411": {"text": "Proud to see fellow veteran @danielfeehan enter the race for Minnesota’s 1st congressional district. Best of luck, Dan! https://t.co/dNbjQg3qmS", "date": "2019-10-01 21:33:30"}, "412": {"text": "“We must adjust to changing times and still hold to unchanging principles.\" —Jimmy Carter\n\nNow more than ever, we need leaders morally prepared for the future. Jimmy Carter has shown that strength through a lifetime of public service. Happy 95th birthday, Mr. President. https://t.co/2hte492Eka", "date": "2019-10-01 19:14:50"}, "413": {"text": "It’s been two years since 58 lives were taken and more than 700 people were injured at a concert in Las Vegas. Two years and not one federal law to save more lives. Enough. On #1October, let us honor the victims by summoning the courage to act. #VegasStronger", "date": "2019-10-01 17:55:31"}, "414": {"text": "Protesters in Hong Kong are risking their lives to defend democracy and demand freedom. Meanwhile, here at home, this president’s party is destroying the democratic norms that made America a beacon of freedom for the world. https://t.co/Eb8NwshRSS", "date": "2019-10-01 15:17:47"}, "415": {"text": "RT @PeteForAmerica: This is your campaign. \n\nTogether, we will win. https://t.co/cH1Tp20NpD", "date": "2019-10-01 13:54:03"}, "416": {"text": "I am profoundly grateful to every single person who has pitched in to power our campaign. Together, we’re building a movement that’s big enough, and hopeful enough, to do things differently and win. Thank you. https://t.co/zLjVuOENN4", "date": "2019-10-01 10:01:35"}, "417": {"text": "I believe America deserves our optimism, our courage, and our hope. If you’re with me, please chip in before midnight: https://t.co/rYoEiIdhiR https://t.co/h4it9VfWO9", "date": "2019-10-01 02:10:47"}, "418": {"text": "Channing’s death is a tragedy, and we must work to build a future deserving of his memory. My deepest condolences are with his family and friends. If you're struggling with belonging or considering harming yourself or others, please contact the @TrevorProject at 866-488-7386. https://t.co/3uVwg1ZJHj", "date": "2019-10-01 01:04:12"}, "419": {"text": "Every woman should be able to make decisions about their own health regardless of their income. The urgency of this moment demands we act to end Hyde, and it calls on us to deliver reproductive justice for all women. #BeBoldEndHyde", "date": "2019-10-01 00:28:12"}, "420": {"text": "If you agree: https://t.co/rYoEiIdhiR https://t.co/P38XCVTKE8", "date": "2019-09-30 23:51:00"}, "421": {"text": "We decided early on you wouldn’t hear too much from me about our fundraising—only when it matters. It matters right now. How much we raise before tonight's deadline will determine where we go and what we do in the coming months. If you can, please chip in: https://t.co/rYoEiIdhiR https://t.co/VIN8onA8cs", "date": "2019-09-30 22:08:38"}, "422": {"text": "I believe we can change the trajectory of our country and be proud of how we did it. If you’re with me, please chip in before tonight’s Q3 fundraising deadline. https://t.co/rYoEiIdhiR https://t.co/mA2LlH7fcg", "date": "2019-09-30 20:19:16"}, "423": {"text": "Moving forward with impeachment isn’t just about holding this president accountable. It’s about holding ourselves accountable to preserve the integrity of our constitutional system. https://t.co/CDmH2PFvOz", "date": "2019-09-30 19:03:58"}, "424": {"text": "RT @PeteForAmerica: We’re in it to win it.\n\nhttps://t.co/7F52gkVyZP", "date": "2019-09-30 18:58:07"}, "425": {"text": ".@PeteForAmerica organizers inspire me every day. We’re building a movement to meet the urgency of this moment, and the hope and joy they bring to what we do is a big reason why we’ll win. Please chip in before midnight tonight to support their hard work: https://t.co/rYoEiIdhiR https://t.co/vAUBGglslB", "date": "2019-09-30 16:07:13"}, "426": {"text": "Thanks, Mom! https://t.co/gKA1mfKMM2", "date": "2019-09-30 01:30:57"}, "427": {"text": "RT @PeteForAmerica: ICYMI: This past week, @PeteButtigieg kicked off the #ButtigiegBusTour, met a BEEliever in Elkader, got caught in the W…", "date": "2019-09-29 22:51:33"}, "428": {"text": "This evening, as Jews in America and around the world come together to celebrate Rosh Hashanah, let us reflect on the past year and offer hope for a brighter and more caring future. From me and @Chas10Buttigieg, warmest wishes for a happy and sweet new year. #ShanahTovah! https://t.co/QtUfwdLtXg", "date": "2019-09-29 21:18:18"}, "429": {"text": "Fueled by a blend of bold ideas. https://t.co/JTsPgFYSUR", "date": "2019-09-29 19:54:09"}, "430": {"text": "RT @PeteForAmerica: #PhaseThree isn’t just building strength—it’s building family: https://t.co/nlCtLwU9c4 https://t.co/sm1zuR8U7E", "date": "2019-09-29 18:32:40"}, "431": {"text": "There is an American majority that supports a progressive agenda on issues like health care. And the way to make that agenda a reality is not with “my way or the highway” politics but by galvanizing those Americans around Medicare for All Who Want It. https://t.co/tddHZtHo1R", "date": "2019-09-29 16:20:40"}, "432": {"text": "The answer is clear. https://t.co/TOzSU5avlc", "date": "2019-09-28 23:38:15"}, "433": {"text": "Yes. https://t.co/8oV0l6jcaZ", "date": "2019-09-28 21:13:27"}, "434": {"text": "I'm proud to be the son of Anne Montgomery.\nhttps://t.co/3XyFDVjqVR", "date": "2019-09-28 20:48:39"}, "435": {"text": "I’m profoundly grateful to those who’ve invested in our vision for change. It’s your support that makes everything we do in this campaign possible. If you're with me, please consider chipping in before Monday's end-of-quarter fundraising deadline.\nhttps://t.co/ipmRAg8Gis", "date": "2019-09-27 21:37:14"}, "436": {"text": "RT @PeteForAmerica: .⁦@PeteButtigieg⁩ just wrapped up a great discussion with ⁦@SRuhle⁩ at #TribFest19.\n\nIf you like what you heard, chip i…", "date": "2019-09-27 20:45:25"}, "437": {"text": "Dr. Christine Blasey Ford is a profile in courage. One year later, I still believe her. https://t.co/ufqGKm7QKr", "date": "2019-09-27 18:21:08"}, "438": {"text": "RT @PeteForAmerica: Thank you for sharing your story, Bridgette, and inspiring the culture of belonging our country desperately needs. http…", "date": "2019-09-27 17:05:39"}, "439": {"text": "RT @StopBigMoney: We need reform first before we can tackle all the big issues facing our country. Watch what @PeteButtigieg tells ECU's Pr…", "date": "2019-09-27 16:02:24"}, "440": {"text": "Gun violence is an American problem that hurts some Americans even more than the rest. Today's hearing on gun violence in communities of color was a historic step in addressing disparities. https://t.co/6PUavPxIqC", "date": "2019-09-27 00:04:44"}, "441": {"text": "Since its founding 50 years ago today, @NARAL has been on the front lines of the fight for reproductive freedom and justice. The urgency of this moment calls on each of us to support their patriotic work, and I am proud to fight alongside them. #NARAL50", "date": "2019-09-26 23:48:28"}, "442": {"text": "RT @PeteForAmerica: Republicans have a choice to make—this president or our country. https://t.co/30jLU3Y3wk", "date": "2019-09-26 22:07:07"}, "443": {"text": "Supporting a presidential campaign is an act of hope. We’re building this campaign one dollar—one act of hope—at a time. If you can, please chip in before Monday's end-of-quarter deadline. https://t.co/0h0FqH9wXy", "date": "2019-09-26 17:57:10"}, "444": {"text": "RT @PeteForAmerica: “This isn’t just about this president. This is about the American presidency.” \n\n—@PeteButtigieg https://t.co/OXkbilmmmA", "date": "2019-09-26 16:35:35"}, "445": {"text": "RT @PeteForAmerica: “This is a moment of truth for our country.” —@PeteButtigieg https://t.co/L6z5iRgvJ5", "date": "2019-09-26 13:13:02"}, "446": {"text": "RT @IAStartingLine: \"He’s trustworthy. I believe it. He really does have Midwest values,\" said one Boone resident at @PeteButtigieg's recen…", "date": "2019-09-26 00:34:05"}, "447": {"text": "The memo confirms what the president has already confessed. The facts aren’t in doubt, but the future of our democracy is. It is time for Republicans to do the right thing.", "date": "2019-09-25 22:56:34"}, "448": {"text": "This is a moment of truth. It’s a moment of truth for all Americans. And members of the Republican Party must now decide if they will defend our country or this president. https://t.co/kvehdZ0LAe", "date": "2019-09-25 18:00:07"}, "449": {"text": "Providing every single American with quality health insurance isn’t just my plan, it’s our cause. But while others say it’s Medicare for All or nothing, I say it's Medicare for All Who Want It. The choice should be yours. That's the difference. https://t.co/UqodCW3d5p", "date": "2019-09-25 13:52:34"}, "450": {"text": "This is a moment of truth. This isn’t just about this president. This is about the American presidency—and we need to draw the line. https://t.co/wZ2S20aIBr", "date": "2019-09-25 02:59:30"}, "451": {"text": "Los Estados Unidos merece algo mejor que esto. Tenemos que asegurar de que cada votante elegible esté registrado para votar. En este #NationalVoterRegistrationDay asegúrate de que tu familia, tus amigos y tú estén listos para votar ahora y en el 2020. https://t.co/2337Yzfj2D", "date": "2019-09-24 20:08:02"}, "452": {"text": "America deserves better than this. That means making sure every eligible voter is registered to vote. On this #NationalVoterRegistrationDay, make sure you, your friends, and your family are ready to vote now and in 2020. https://t.co/2337Yzfj2D", "date": "2019-09-24 20:08:02"}, "453": {"text": "RT @PeteForAmerica: “Picture a presidency where when you turn on the news and you see the White House, your blood pressure goes down a litt…", "date": "2019-09-24 19:06:19"}, "454": {"text": "RT @PeteForAmerica: “The best hope we have for dealing with climate and a whole lot of other issues is the moral urgency of young people.”…", "date": "2019-09-24 16:00:55"}, "455": {"text": "It takes courage to be visible, especially as our country grapples with a crisis of belonging that disproportionately affects the LGBTQ+ community. I want everyone celebrating #BiVisibilityDay to know that we see you, we are with you, and you belong.", "date": "2019-09-24 02:15:48"}, "456": {"text": "RT @PeteForAmerica: When the stakes are this high, there is no plan bee. https://t.co/8CWYfG64D3", "date": "2019-09-24 00:15:54"}, "457": {"text": "Thanks for your questions, everyone! That was fun—let’s do it again soon. In the meantime, check out our site to find out where I stand on the issues that matter most to you. https://t.co/Ks81ofslRJ", "date": "2019-09-23 22:43:37"}, "458": {"text": "@IowaJamie Sign up and get to know our wonderful organizers!", "date": "2019-09-23 22:33:08"}, "459": {"text": "@LeniDiamond I’d say neoliberalism is the political-economic consensus that has governed the last forty years of policy in the US and UK. Its failure helped to produce the Trump moment. Now we have to replace it with something better.", "date": "2019-09-23 22:31:18"}, "460": {"text": "@RDU4Pete It’s useful, time-honored, and dignified.", "date": "2019-09-23 22:24:53"}, "461": {"text": "@GoodGuyPete2020 Negativity is part of politics, but we also have a chance to make sure people hear our true stories. Voices from SB are especially important since outside media don’t always know the context, so please keep it up!", "date": "2019-09-23 22:22:40"}, "462": {"text": "@Max_S_Harris I don’t know... you tell me, Max", "date": "2019-09-23 22:19:26"}, "463": {"text": "@NBNaturePainter I wouldn’t be running if I didn’t believe we can turn things around. That’s what I mean when I say running for office is an act of hope!", "date": "2019-09-23 22:18:32"}, "464": {"text": "@RevDrDickMove No it’s large", "date": "2019-09-23 22:14:38"}, "465": {"text": "@NateB323AZ Not as much as I’d like! Finished a moving novel called Godric by Fred Beuchner. Now reading Giovanni’s Room by Baldwin and also immersed in Sidney Blumenthal’s forthcoming Lincoln volume", "date": "2019-09-23 22:13:22"}, "466": {"text": "@zhudigrandmoon NY Strip", "date": "2019-09-23 22:09:46"}, "467": {"text": "@SevenDicey Kid A", "date": "2019-09-23 22:09:27"}, "468": {"text": "@joshvires I’m so sorry to hear this. It’s unacceptable, and this is why we need better coverage (I.e. Medicare for All Who Want It) and action to reduce prescription costs through negotiation and regulation.", "date": "2019-09-23 22:08:08"}, "469": {"text": "@hwan_up10 Major reform needed to reduce mass incarceration and deliver a more just system. Learn more about the CJR component of our Douglass Plan at https://t.co/hZ66tTOXho", "date": "2019-09-23 22:06:51"}, "470": {"text": "@Sptlightstar Lead on climate.\nSupport democracy.\nKeep our promises.", "date": "2019-09-23 22:06:01"}, "471": {"text": "@TylerGarret2 Nice!", "date": "2019-09-23 22:05:09"}, "472": {"text": "@RomancePete Agreed! As a candidate from the middle America I believe I can provide the coattails needed to support good Democratic House and Senate candidates to be partners in governing", "date": "2019-09-23 22:04:50"}, "473": {"text": "@AllisonLantero We certainly need reform on all of the above. I also believe a national popular vote will help people know their vote matters in presidential elections regardless of where they live.", "date": "2019-09-23 22:04:05"}, "474": {"text": "@PeteFacts2020 All appealing but for bus purposes, definitely jerky", "date": "2019-09-23 22:02:46"}, "475": {"text": "@OneEclecticMom All I can say is when you go to “just see” a dog, you might as well have adopted already. Cc @Chas10Buttigieg", "date": "2019-09-23 22:02:17"}, "476": {"text": "@trans4pete I think it helps to appeal to someone’s sense of compassion. Let friends and family know how this administration has negatively impacted you personally and why our lives would be better with better leadership in the WH", "date": "2019-09-23 22:00:52"}, "477": {"text": "@mikeystangz I’ve gotten to know several great mayors from Canada and believe we can strengthen the relationship to make good things happen on both sides of the border. Needless to say I don’t consider Canada a national security threat!", "date": "2019-09-23 22:00:01"}, "478": {"text": "@sabrinasbeatle Stay tuned", "date": "2019-09-23 21:58:07"}, "479": {"text": "@internet_gnome You don’t have to be old enough to vote to make a difference. We need volunteers of all ages for help both in person and organizing people you know to get involved and persuade voters. Thanks for your support!", "date": "2019-09-23 21:56:58"}, "480": {"text": "@DavidGMcGreevy One thing I heard is “how much longer are we supposed to take one for the team?” Farmers are clearly being hurt by the tariffs—one today told me he’s still storing last year’s beans and is not happy with this president.", "date": "2019-09-23 21:56:03"}, "481": {"text": "@barrelproofxxx I’d say Stanford but apparently Cardinal in this context is an adjective and not a bird. Maybe @CoryBooker can explain", "date": "2019-09-23 21:55:06"}, "482": {"text": "@blakeells I’d say Creedence Clearwater Revival. In related news, also learning @Bencjacobs has some interesting and controversial views on Led Zeppelin.", "date": "2019-09-23 21:52:04"}, "483": {"text": "@OldAlchemist Great point—and based on the GOP’s behavior, if Democrats don’t do something on deficits then no one will! Limited deficit spending can play a constructive role at times, but we need much more fiscal responsibility in government.", "date": "2019-09-23 21:46:38"}, "484": {"text": "@Ldyandrea Thanks! I bet someone is already on it. (Though on closer inspection I think it was a yellowjacket.)", "date": "2019-09-23 21:40:08"}, "485": {"text": "@KelleyF107 @GretaThunberg I would encourage her to look at our bold plan to ensure America becomes a net-zero emissions economy by 2050, and let her know that in that year I look forward to celebrating with her what we have achieved in the US and globally, thanks in no small part to her moral leadership!", "date": "2019-09-23 21:31:45"}, "486": {"text": "Hey, everybody—I’m here on the bus with my team and the press, and for the next 15 minutes, I’m taking your questions. Ask me anything by replying to this thread and using the #ButtigiegBusTour hashtag. Let’s get started!", "date": "2019-09-23 21:30:04"}, "487": {"text": "We’re about 30 minutes away from me taking your questions live. Look forward to hearing what’s on your mind. Talk soon!", "date": "2019-09-23 21:09:36"}, "488": {"text": "Climate catastrophe is on the horizon because our leaders have spent more than 30 years repeating the same debate rather than fighting our common challenge. They have failed us and we can't wait any longer. It's time to act. https://t.co/qHuBKyCChj", "date": "2019-09-23 20:58:22"}, "489": {"text": "Hello from day two of the #ButtigiegBusTour—we’re traversing the state with the press on board. It’s all access. No questions off the table. Everything on the record. And today I’m inviting you to join us. Come back around 5:30 pm ET for a live Twitter Q&amp;A. Looking forward to it! https://t.co/tDx3iKlFLC", "date": "2019-09-23 20:09:27"}, "490": {"text": "This is what the end of American global leadership looks like. https://t.co/OmxrIDZYr9", "date": "2019-09-23 16:45:12"}, "491": {"text": "Climate change—the global security challenge of our era—demands more than 15 minutes of a president's time. History will remember this president for his failure to lead, and it will remember us for what we do next.", "date": "2019-09-23 16:45:03"}, "492": {"text": "We keep sending politicians to Washington to fight for us. But when they get there, they seem more interested in the part about fighting than the part about us. It's time we tackle our challenges together—because we have to. https://t.co/pACjbp9K5P", "date": "2019-09-23 15:23:58"}, "493": {"text": "RT @PeteForAmerica: ICYMI: This past week, @PeteButtigieg shared a new approach for disaster preparedness, met with voters in South Carolin…", "date": "2019-09-22 23:50:04"}, "494": {"text": "RT @PeteForAmerica: We’ve got hope in our hearts and fire in our (very full) bellies after yesterday’s Iowa #SteakFry. What a blast! https:…", "date": "2019-09-22 18:18:21"}, "495": {"text": "This president’s actions are a betrayal of American democracy. We deserve better.", "date": "2019-09-22 17:02:01"}, "496": {"text": "RT @PeteForAmerica: High hopes and high ceilings required. https://t.co/sgHRF7ZkpF", "date": "2019-09-22 16:28:52"}, "497": {"text": "RT @IAStartingLine: And here’s the @PeteButtigieg bus pulling into the Boone County event. Buttigieg is doing an on-the-record bus trip wit…", "date": "2019-09-22 15:15:43"}, "498": {"text": "RT @PeteForAmerica: THREAD: Watch @PeteButtigieg’s full speech from today’s Iowa #SteakFry 👇 https://t.co/iGq7VzPJF8", "date": "2019-09-22 13:54:54"}, "499": {"text": "Picture it. https://t.co/ARTw6699d9", "date": "2019-09-21 23:08:34"}, "500": {"text": "RT @edokeefe: DES MOINES — Big day at the Polk County Democrats Steak Fry — lots of photo and video and hot takes elsewhere. But undeniably…", "date": "2019-09-21 23:08:32"}, "501": {"text": "I believe we can change the trajectory of our country and be proud of how we did it. I believe we will, and we’ll say it all started in Iowa. Thank you to all who turned out for the @PolkDems Iowa #SteakFry! https://t.co/pxXe0TR3JY", "date": "2019-09-21 22:08:58"}, "502": {"text": "https://t.co/NyHanB1L4X", "date": "2019-09-21 22:07:31"}, "503": {"text": "https://t.co/BC6vsjRExH", "date": "2019-09-21 22:00:23"}, "504": {"text": "https://t.co/ytz7nRqkY6", "date": "2019-09-21 21:47:28"}, "505": {"text": "We win when we offer leadership from a new generation—with new ideas that meet the moment, bring us together, and call on our country to be better than it’s been. https://t.co/vyYcZsQIzI", "date": "2019-09-21 21:35:15"}, "506": {"text": "RT @PeteForAmerica: “I’m proud of you.” —@PeteButtigieg⁩ to supporters at the Iowa #SteakFry https://t.co/OsvcjBUOzl", "date": "2019-09-21 21:05:00"}, "507": {"text": "RT @PeteForAmerica: .@PeteButtigieg is getting ready to take the stage at the @polkdems Iowa #SteakFry! Watch live: https://t.co/7B7sPzIjao…", "date": "2019-09-21 19:33:37"}, "508": {"text": "RT @PeteForAmerica: What's on tap? A new era. https://t.co/dIPnMusf4E", "date": "2019-09-21 18:27:18"}, "509": {"text": "RT @PeteForAmerica: The steaks are high and @PeteButtigieg is serving up new ideas. https://t.co/UWEA8nZmXU", "date": "2019-09-21 18:03:15"}, "510": {"text": "RT @PeteForAmerica: @PeteButtigieg Update: No slides at the Iowa #SteakFry, but plenty of food! https://t.co/Tjrm1Z8Jmo", "date": "2019-09-21 17:48:46"}, "511": {"text": "RT @PeteForAmerica: @PeteButtigieg Something special is happening. https://t.co/QJVzCVuoLp", "date": "2019-09-21 17:23:12"}, "512": {"text": "RT @PeteForAmerica: Here’s ⁦@PeteButtigieg⁩ on stage at the #SteakFry. Follow him on ⁦@Snapchat⁩ right now to be the first to join him from…", "date": "2019-09-21 16:49:41"}, "513": {"text": "RT @PeteForAmerica: .⁦@PeteButtigieg⁩ takes the stage at the #SteakFry!\n\nA blue wave is coming next November, and it begins with a sea of y…", "date": "2019-09-21 16:12:20"}, "514": {"text": "RT @PeteForAmerica: .@PeteButtigieg is ready for the #SteakFry! \n\n(@Snapchat users saw this first. Follow the mayor on Snap now, and stick…", "date": "2019-09-21 14:48:50"}, "515": {"text": "Just stepped off the stage. Thank you @glaad, @TheAdvocateMag, @gazettedotcom, and @OneIowa for the honor of speaking at this historic event.", "date": "2019-09-21 01:48:11"}, "516": {"text": "At a moment when LGBTQ rights are under assault, it's never been more important to speak up. I'm about to take the stage at the #LGBTQforum. Watch live at 8:10 pm CT: https://t.co/P0hNgkm97e", "date": "2019-09-21 00:57:26"}, "517": {"text": "RT @PeteForAmerica: Don’t miss @PeteButtigieg at the LGBTQ Presidential Forum tonight at 8:10PM CT! \nhttps://t.co/ClZKVtZwTm", "date": "2019-09-20 23:30:37"}, "518": {"text": "Two years after Hurricane Maria, too many Puerto Ricans are still waiting for help. We failed our fellow citizens. As president, I will work to ensure our government is there for all Americans. And when storms return, Puerto Ricans will be ready, because they won’t be alone. https://t.co/olyP20tkAJ", "date": "2019-09-20 20:27:12"}, "519": {"text": "Today marks the eighth anniversary of the repeal of Don’t Ask, Don’t Tell. As president, I will fight to ensure those in uniform are never denied equal treatment because of who they are or whom they love.\nhttps://t.co/ByWM8M2b9Q", "date": "2019-09-20 19:11:07"}, "520": {"text": "This is too big and too urgent. The climate czar has to be the President of the United States. #ClimateForum2020 https://t.co/zLDvdaYxIG", "date": "2019-09-20 18:56:32"}, "521": {"text": "Students around the world are coming together to raise the alarm bells of climate change. Now we need to elect leaders courageous enough to bring us together to fight it. I support the #ClimateStrike.", "date": "2019-09-20 15:03:31"}, "522": {"text": "Sounds like they‘re afraid of you having a choice, which is just more evidence that we need a public alternative to the corporate plans: Medicare for All Who Want It. https://t.co/FCMx5toVlo", "date": "2019-09-20 02:28:20"}, "523": {"text": "Sometimes politics is simple. Either you believe in democratic representation for all citizens or you don’t. If you do, D.C. should be a state. https://t.co/1WWUkqIkAE", "date": "2019-09-20 02:08:05"}, "524": {"text": "RT @PeteForAmerica: Nobody, especially our rural seniors, should pay $42,000 a year for coverage. Medicare for All Who Want It can out-comp…", "date": "2019-09-19 23:50:53"}, "525": {"text": "RT @PeteForAmerica: Under @PeteButtigieg’s new Medicare for All Who Want It plan, families will receive better coverage at lower––or even f…", "date": "2019-09-19 23:28:47"}, "526": {"text": "Anyone who lets the words “Medicare for All” escape their lips should be honest and straightforward about the details. My plan costs $1.5 trillion. And we'll pay for it by rolling back corporate tax breaks—not by raising taxes on the middle class. https://t.co/VDTTpA0hVe https://t.co/LXELvWuIVF", "date": "2019-09-19 21:57:16"}, "527": {"text": "RT @PeteForAmerica: A plan for our future: https://t.co/C7FPYJ4k7m https://t.co/R5dymdR0wX", "date": "2019-09-19 21:26:18"}, "528": {"text": "RT @PeteForAmerica: It’s about trusting Americans to make their own decisions: https://t.co/C7FPYJ4k7m https://t.co/rOKgWvw2xq", "date": "2019-09-19 19:47:06"}, "529": {"text": "Medicare for All Who Want It is a bold new approach to meet our nation’s urgent health care challenges. It brings down costs, guarantees coverage for everyone, puts power into the hands of each American, and creates a healthier future for us all. https://t.co/UsSbSygy4e", "date": "2019-09-19 19:23:57"}, "530": {"text": "RT @neeratanden: This is a really important health care plan that addresses the main concerns people have- coverage and costs. It also show…", "date": "2019-09-19 17:21:43"}, "531": {"text": "RT @PeteForAmerica: 12 year olds shouldn't worry about what would happen to them if their parents lost coverage. @PeteButtigieg's plan will…", "date": "2019-09-19 17:01:02"}, "532": {"text": "My deepest condolences are with the Clyburn family. Future generations will benefit from Emily's fierce commitment to public education, her love for South Carolina, and a lifetime of activism that began alongside her husband Jim in an Orangeburg courthouse in 1960. https://t.co/prgkrgj6Tm", "date": "2019-09-19 16:33:53"}, "533": {"text": "RT @PeteForAmerica: We pay $5,000 more for health care per person than other developed countries. And yet, we’re less healthy. We need a ne…", "date": "2019-09-19 16:07:04"}, "534": {"text": "RT @PeteForAmerica: Medicare for All Who Want It will put affordable, quality insurance within reach of all Americans without forcing peopl…", "date": "2019-09-19 13:18:07"}, "535": {"text": "Health care is a human right. But in America, it's too expensive, too complicated, and too frustrating. I’m proposing a bold new approach—Medicare for All Who Want It—that lowers costs, creates real choices, and covers everyone: https://t.co/ysQIbtMGJD https://t.co/RWdq5Qhnbb", "date": "2019-09-19 10:56:21"}, "536": {"text": "The authorization to use military force in Afghanistan is 18 years old today, as old as some of the soldiers we now send to do battle there. We owe it to them to put an end to endless war, and as commander in chief, I will.", "date": "2019-09-18 23:32:30"}, "537": {"text": "I was in high school when Columbine happened. Years have passed, yet the only thing Washington politicians do consistently is fail to deliver. We owe it to our children to give them back their childhoods. We need leaders ready to deliver that change now. https://t.co/OIv5eD7hIt", "date": "2019-09-18 21:54:10"}, "538": {"text": "Rather than playing hardball with people’s lives, GM needs to recognize its responsibilities to its workers, pay them fairly, and stop misusing its temporary workers. https://t.co/q5GbuuWLLk", "date": "2019-09-18 20:43:53"}, "539": {"text": "Mayors know better than anyone why we need a new approach to politics—one that focuses on the everyday and puts community over partisan ideology. Proud to have the support of my fellow local leaders. https://t.co/8ZMZ2BIwgV", "date": "2019-09-18 12:30:47"}, "540": {"text": "My policy decisions and my appointments to the bench will reflect the fact that I trust women to make their own decisions about their health. Thank you @CecileRichards and @Supermajority for leading the way to empower women in America. https://t.co/MAf6iAsobn", "date": "2019-09-18 00:45:48"}, "541": {"text": "Selena is as American as anybody in this country. She and other DREAMers are an essential part of our nation's story, and we need common sense immigration reform that gives them a real pathway to citizenship. https://t.co/G0DeEX1IiA", "date": "2019-09-17 16:43:37"}, "542": {"text": "Risk in the region has increased in no small part due to the Administration's erratic, go-it-alone approach to Iran and failure to use U.S. leverage to resolve the war in Yemen. We must focus on a diplomatic strategy to resolve the war and reduce risk of miscalculation with Iran. https://t.co/O52i1o48F8", "date": "2019-09-17 14:29:43"}, "543": {"text": "We can’t stop natural disasters from striking, especially as we face the growing threat of climate catastrophe. But we can control how we prepare for and recover from them. \n\nToday, I'm proud to announce my plan for a new approach to disaster preparedness. https://t.co/PQkS87HAFi", "date": "2019-09-17 12:06:34"}, "544": {"text": "Congratulations to Fiesta Henderson Casino workers for voting to unionize and be represented by @Culinary226 and Bartenders Union Local 165. Time for @StationCasinos to join them at the table and deliver on fair wages, good health care, and job security. https://t.co/bbBCKRthsX", "date": "2019-09-16 23:50:37"}, "545": {"text": "RT @PeteForAmerica: “I believe a lot of people voted for this president not because they think he's a good person but because he was promis…", "date": "2019-09-16 19:20:30"}, "546": {"text": "I'm proud to stand with the hardworking members of @UAW in their fight for fair wages, health care, and job security. @GM should do right by the workers who fuel its profits. https://t.co/3XF8OswRRn", "date": "2019-09-16 02:11:55"}, "547": {"text": "Great to help @PhilforVirginia kickoff canvassing today, just weeks before VA elections. The presidency isn't the only office that matters, we need to elect Dems at all levels. We're just 4 seats away from flipping the VA legislature—let's help them do it: https://t.co/a3bT6KO1WL https://t.co/YX14JzZPIY", "date": "2019-09-15 19:28:00"}, "548": {"text": "Four Black girls lost their lives fifty-six years ago in Birmingham at the hands of white supremacist terrorism. Now, racist terrorist attacks are claiming lives in El Paso, Charleston, and Charlottesville. We cannot morally afford to repeat the past. We must act.", "date": "2019-09-15 18:32:10"}, "549": {"text": "There is an American majority that agrees we need universal health care, gun safety, immigration reform—pretty much everything our party is advancing. We have to gather that majority to win this election and unify our country. https://t.co/Pf8lhJfoK9", "date": "2019-09-15 16:48:57"}, "550": {"text": "Medicare for All Who Want It will create a public alternative, but unlike the Sanders-Warren vision it doesn’t dictate it to the American people and risk further polarizing them. https://t.co/V7uuA8z0Y9", "date": "2019-09-15 16:18:16"}, "551": {"text": "I trust the American people to make their health care decisions for themselves. https://t.co/2f6ZXJUsd3", "date": "2019-09-15 15:43:51"}, "552": {"text": "I left Afghanistan five years ago today, and I thought I was one of the very last troops there. We are still there and we are still debating how to get out—it's time to end endless wars. https://t.co/GiZqwkcXbL", "date": "2019-09-15 15:28:20"}, "553": {"text": "The American people are divided at the very moment we need to come together. But with ideas bold enough to meet our greatest problems and big enough to unify the American people, we can meet the challenges of our time. https://t.co/f848RqS8bI", "date": "2019-09-14 23:28:04"}, "554": {"text": "So glad for the chance to spend time with friends who have changed what was possible in politics, faith, and business, and to gain wisdom from their stories. https://t.co/GP2clzQquH", "date": "2019-09-14 16:57:13"}, "555": {"text": "At a crossroads in my life, I trusted the people of South Bend, and they trusted me back.\n\nAt this crossroads in American history, let’s trust the American people by speaking to our common aspirations instead of our divides. https://t.co/JomHhFJkxJ", "date": "2019-09-14 15:26:12"}, "556": {"text": "From health care, to gun violence, to the climate crisis—we can solve our greatest problems with new ideas bold enough to meet our challenges and big enough to bring people together to get them done. https://t.co/pWj42Ub2T1", "date": "2019-09-14 01:20:19"}, "557": {"text": "I trust YOU to make the right health care choice for yourselves and your family. https://t.co/iCpsimaK3d", "date": "2019-09-13 23:10:42"}, "558": {"text": "Since it didn’t come up in tonight’s #DemDebate, at this moment when women’s reproductive freedom is under attack, I wanted to say I trust women to make their own decisions about their health. It’s important we all keep taking about it.", "date": "2019-09-13 04:13:35"}, "559": {"text": "Just stepped off the #DemDebate stage. I made the case for why it’s time to break with the past and push forward new ideas—bold enough to meet our challenges and big enough to bring people together to get things done. If I made you proud, chip in now: https://t.co/R0exsDGPhc https://t.co/e39r7O0Tqr", "date": "2019-09-13 03:57:02"}, "560": {"text": "Trust can be reciprocated. Part of winning is knowing what’s worth more to you than winning—and that’s what we need in the presidency right now. #DemDebate https://t.co/Bg9nmob1uH", "date": "2019-09-13 03:15:32"}, "561": {"text": "To bring about a better future, we have to know what we’re about. This election is not about anyone running for office, it’s about making things better for the people who trust us with their lives. Together, we will win a better era for our country. #DemDebate https://t.co/tii4Waj5MY", "date": "2019-09-13 02:55:18"}, "562": {"text": "RT @PeteForAmerica: “I wasn’t interested in not knowing what it was like to be in love any longer.” — @PeteButtigieg #DemDebate https://t.c…", "date": "2019-09-13 02:50:44"}, "563": {"text": "RT @GMA: .@PeteButtigieg: \"If we want to get the results that we expect for our children, we have to support and compensate the teaching pr…", "date": "2019-09-13 02:31:11"}, "564": {"text": "#DemDebate https://t.co/M4Xv7WRO3E", "date": "2019-09-13 02:31:06"}, "565": {"text": "We've got to respect teachers the way we do soldiers and pay them like we do doctors. #DemDebate https://t.co/lLDiYJn6KX", "date": "2019-09-13 02:23:19"}, "566": {"text": "We need a Secretary of Education who believes in public education. #DemDebate https://t.co/KOPsAu6ZGN", "date": "2019-09-13 02:22:11"}, "567": {"text": "RT @PeteForAmerica: It’s that simple. #DemDebate https://t.co/vlDJhQRlqS", "date": "2019-09-13 02:18:22"}, "568": {"text": "#DemDebate https://t.co/Q1XjN2jg7E", "date": "2019-09-13 02:17:20"}, "569": {"text": "RT @PeteForAmerica: How to avoid endless war? \n\nLet’s not start them. #DemDebate https://t.co/1QO68G0k5X", "date": "2019-09-13 02:15:33"}, "570": {"text": "We have a president who seems to treat troops as props. As a military officer the first thing that goes through your mind, the first time you make eye contact with somebody you’re responsible for in uniform is do not let them down. This president does that, I will not. #DemDebate https://t.co/fSGXvLHT7d", "date": "2019-09-13 02:15:19"}, "571": {"text": "We can tackle the crisis of climate change while empowering rural Americans. #DemDebate https://t.co/2aBZazDaP9", "date": "2019-09-13 02:10:54"}, "572": {"text": "When I left Afghanistan in 2014, I thought I’d be one of the last people turning out the lights. But we’re still there––and we’re now risking casualties of those who weren’t even born when 9/11 happened. #DemDebate https://t.co/8IVmCeYF1b", "date": "2019-09-13 01:58:19"}, "573": {"text": "President Trump said he'd like to see me make a deal with Xi Jinping. I'd like to see him make a deal with Xi Jinping. We need an actual strategy and real leadership. https://t.co/HM5lvSvmLi", "date": "2019-09-13 01:47:47"}, "574": {"text": "We have an opportunity to build an American majority around immigration reform, but we can’t allow this to continue to be the same debate with the same arguments and the same clever lines, often amongst the same people. The stakes are too high. https://t.co/DLdhah9W3Y", "date": "2019-09-13 01:37:17"}, "575": {"text": "Bumping this. https://t.co/SthJ2DqA7p", "date": "2019-09-13 01:34:30"}, "576": {"text": "We keep sending politicians to Washington hoping they’ll fight for us, but when they get there, they seem more interested in the fighting part than the us part. We urgently need a new approach. #DemDebate https://t.co/IeMfKgEH7c", "date": "2019-09-13 01:20:45"}, "577": {"text": "We have to act urgently to reverse the damage done by systemic racism. Read my plan: https://t.co/T0WKZ3cQo5 #DemDebate https://t.co/vyWgqzto6h", "date": "2019-09-13 01:12:48"}, "578": {"text": "Inaction on gun violence traumatized an entire generation and threatens to traumatize another, yet Washington fails to act. Lives depend on us standing up to the NRA and white nationalist domestic terrorism. Read my plan to defeat this epidemic: https://t.co/wSBfcBSApY #DemDebate", "date": "2019-09-13 01:08:41"}, "579": {"text": "Systemic racism preceded this president and even when we defeat him it will be with us—that's why we need a systemic approach. https://t.co/T1WCTEeKly", "date": "2019-09-13 01:04:54"}, "580": {"text": "RT @PeteForAmerica: Replacing decades-old racist policies with neutral ones isn’t enough to deliver equality. We can do better -- and we ca…", "date": "2019-09-13 00:57:35"}, "581": {"text": "We need a new approach to health care—that's why I'm proposing Medicare For All Who Want it. I trust the American people to make the right choice for themselves. #DemDebate https://t.co/7kBgU8NWar", "date": "2019-09-13 00:50:53"}, "582": {"text": "RT @NBCNewsGraphics: Quotes from the #DemDebate --&gt; this one from @PeteButtigieg https://t.co/TVHV8LEmKY", "date": "2019-09-13 00:41:20"}, "583": {"text": "RT @PeteForAmerica: Isn’t it time we elected a politician that cares about all of us? #DemDebate https://t.co/DaBdZwdzdz", "date": "2019-09-13 00:36:35"}, "584": {"text": "Imagine what we could achieve today with ideas that are bold enough to solve the problems of our time and big enough to unify the American people. #DemDebate https://t.co/Ep3cEu0OU5", "date": "2019-09-13 00:24:08"}, "585": {"text": "RT @Chas10Buttigieg: Here we go, #TeamPete! A few ways you can help tonight: \n1. Follow @PeteForAmerica for updates from the team and RT to…", "date": "2019-09-13 00:04:40"}, "586": {"text": "I’m signing off and handing the keys over to my team in South Bend. They'll be tweeting #DemDebate coverage from this account throughout the night, and over on @PeteForAmerica, where we’ll share #PhaseThree watch party tweets from across the country. See you on the other side!", "date": "2019-09-12 23:49:17"}, "587": {"text": "Before I take the debate stage, a big thank you to everyone who's gotten us here. Supporting a presidential campaign is an act of hope for a better future, and you’ve placed yours in one that’s entirely different. I am profoundly grateful, and I’ll do my best to make you proud.", "date": "2019-09-12 23:49:17"}, "588": {"text": "RT @PeteForAmerica: We’re in @PeteButtigieg’s corner because America is running out of time! #DemDebate https://t.co/ChixPTTylS", "date": "2019-09-12 22:56:31"}, "589": {"text": "RT @PeteForAmerica: Phase Three.\n\n#DemDebate Three.\n\nAre you in? → https://t.co/4g0iK1Z0pq https://t.co/4xWiswdZ5z", "date": "2019-09-12 21:33:56"}, "590": {"text": "RT @PeteForAmerica: We've flipped the switch. \n\nIt’s time for #PhaseThree. https://t.co/GJg8UtxCkH", "date": "2019-09-12 17:26:55"}, "591": {"text": "@PeteForAmerica @Chas10Buttigieg @Lis_Smith @HariSevugan", "date": "2019-09-12 17:01:51"}, "592": {"text": "On one of our worst days, our country found its best self. And on this day, it is within us to find it once more. We must #NeverForget. https://t.co/39IgTOqlS7", "date": "2019-09-11 11:35:20"}, "593": {"text": "This president’s reckless trade war has already cost Americans 300,000 jobs, and if it continues, that number could climb to 900,000 by the end of next year. He isn’t up to the job.\nhttps://t.co/SItIYIFGoo", "date": "2019-09-11 03:39:10"}, "594": {"text": "We all owe a debt of gratitude to these brave women. Your stories remind us why we must trust women to make decisions about what’s right for them and their families—and why laws designed to ignore science and punish women are plain wrong. https://t.co/ItskWWbLbu", "date": "2019-09-11 03:30:22"}, "595": {"text": "Very funny, @united https://t.co/6RZuvXXGBz", "date": "2019-09-10 21:55:13"}, "596": {"text": "This president’s unsteady judgment is reflected in both his hiring and firing of national security advisors. His first pleaded guilty to lying to the FBI about his contacts with Russia, and his last led us into Iraq. America deserves better.", "date": "2019-09-10 21:19:42"}, "597": {"text": "RT @thehill: \"I'm running for President because I believe our country is running out of time.\"\n\n@PeteButtigieg speaks at Congressional Hisp…", "date": "2019-09-10 21:16:55"}, "598": {"text": "RT @nowthisnews: DEMS TALK LATINX ISSUES: 2020 presidential candidates Sen. Cory Booker, South Bend Mayor Pete Buttigieg, fmr. HUD Sec. Jul…", "date": "2019-09-10 20:22:31"}, "599": {"text": "RT @PeteForAmerica: #PhaseThree. If you're with us too, text IOWA to 25859. https://t.co/nanX3hhjr7", "date": "2019-09-10 18:42:09"}, "600": {"text": "It's Election Day in North Carolina. If you're ready for leadership that puts country over party and people over ideology, then @McCreadyForNC needs your help—and your vote.\n\nVolunteer: https://t.co/EfOWaCdSD1 \nDonate: https://t.co/By1Um5mefi\nVote: https://t.co/iyjmoZOf0q", "date": "2019-09-10 15:06:19"}, "601": {"text": "RT @PeteForAmerica: Our kids deserve a Secretary of Education who supports public education and @PeteButtigieg is committed to giving that…", "date": "2019-09-09 20:12:10"}, "602": {"text": "RT @PeteForAmerica: “@PeteButtigieg talks often about a crisis of belonging in this country, and every interaction I’ve had with Pete for A…", "date": "2019-09-09 19:00:38"}, "603": {"text": "RT @HIVPlusMag: An #HIV policy survey was sent by @ActNowEndAIDS to all major presidential candidates. Here's @PeteButtigieg's response. cc…", "date": "2019-09-09 18:53:48"}, "604": {"text": "RT @GiffordsCourage: 2020 candidates agree: We must do more to protect our kids from gun violence. Watch the first video in our new #GunSaf…", "date": "2019-09-09 15:19:27"}, "605": {"text": "RT @PeteForAmerica: Welcome to #PhaseThree! Last week, we announced a plan to combat climate change, got @PeteButtigieg on @Snapchat, launc…", "date": "2019-09-09 01:16:01"}, "606": {"text": "Sunday evening in South Bend means bath time for Buddy https://t.co/YFgg8h3vsB", "date": "2019-09-09 01:12:49"}, "607": {"text": "@PeteForAmerica Cornhole", "date": "2019-09-07 23:29:32"}, "608": {"text": "RT @WMUR9: .@PeteButtigieg arrives to an excited crowd ready to greet him at Kalivas Park in Manchester. “We will win N.H.” he says as he t…", "date": "2019-09-07 19:44:51"}, "609": {"text": "A big thank you to the hundreds of @PeteForAmerica supporters who turned out this morning for #NHDems2020! https://t.co/xbvIikTmPq", "date": "2019-09-07 17:44:48"}, "610": {"text": "America, the future doesn't have to be a dark place. I believe we can beat the odds and break with the past. I believe we can summon the courage to come together in common purpose to tackle our greatest challenges. And I believe it all starts with an act of hope. Are you with me? https://t.co/L1GEiXkM8u", "date": "2019-09-07 17:29:29"}, "611": {"text": "The answer to this president is not playing his game or going on his show. It is a laser focus on improving everyday lives and doing it in the name of shared values that light the way to a better future. https://t.co/XLJ7UVqYPy", "date": "2019-09-07 17:05:21"}, "612": {"text": "We need ideas big enough to meet this moment—but it's not enough to think up good policy. We've got to unify Americans around solutions or nothing will actually get done. https://t.co/cHUgIuYlHx", "date": "2019-09-07 16:50:55"}, "613": {"text": "I just stepped off the #NHDems2020 stage. If you're with me, text HOPE to 25859. https://t.co/PuY7suDufD", "date": "2019-09-07 15:49:43"}, "614": {"text": "RT @PeteForAmerica: \"The purpose of the presidency is not the glorification of the president, it is in pulling Americans together in common…", "date": "2019-09-07 15:19:48"}, "615": {"text": "RT @PeteForAmerica: \"We need ideas big enough to meet the challenges of our moment. But it’s not enough to think up a good policy. We have…", "date": "2019-09-07 15:19:40"}, "616": {"text": "RT @PeteForAmerica: .@PeteButtigieg is taking the stage. Tune in! https://t.co/5iD4pzTiPm", "date": "2019-09-07 14:59:55"}, "617": {"text": "RT @PeteForAmerica: If you’re not following ⁦@PeteButtigieg⁩ on ⁦@Snapchat⁩, you’re missing out. Follow along for behind-the-scenes content…", "date": "2019-09-07 13:28:13"}, "618": {"text": "RT @votevets: “There’s more to patriotism than hugging the flag — sometimes literally.” - @PeteButtigieg #votevets2020", "date": "2019-09-07 12:20:04"}, "619": {"text": "RT @amandawgolden: .@PeteButtigieg tells me “there’s a different level of energy right now” outside of the New Hampshire Democratic State C…", "date": "2019-09-07 12:17:54"}, "620": {"text": "RT @chrismeagher: Good morning from New Hampshire! https://t.co/d5FeyH7YTF", "date": "2019-09-07 11:34:27"}, "621": {"text": "RT @PeteForAmerica: Heading to tomorrow's convention? Capture your #PhaseThree excitement by tagging @PeteForAmerica and tweeting your #Tea…", "date": "2019-09-06 22:10:25"}, "622": {"text": "We need real solutions, not further polarization. It’s time we come together to conquer our most urgent challenges and move our country forward. https://t.co/QUNr0zoz6o", "date": "2019-09-06 13:14:13"}, "623": {"text": "RT @cthagod: We have Mayor @PeteButtigieg on @breakfastclubam next hour!! Click here to stream us live!!!  https://t.co/ORFoHtVUJh", "date": "2019-09-06 10:29:56"}, "624": {"text": "I figure this kid will have a good story to tell. https://t.co/JPspc3UT5X", "date": "2019-09-06 05:18:34"}, "625": {"text": "When you make peace with somebody, you make peace with your enemy—that's what it means to come to the table, and that's what needs to happen in Afghanistan. It’s time to leave. https://t.co/DuFpqGRI0x", "date": "2019-09-06 04:49:07"}, "626": {"text": "Environmental stewardship isn't just about taking care of the planet, it's about taking care of our neighbors. https://t.co/1o5HcUdMdg", "date": "2019-09-06 04:34:56"}, "627": {"text": "RT @colbertlateshow: In 5 mins, we have another 2020 presidential candidate stopping by, don’t miss Mayor @PeteButtigieg! #LSSC https://t.c…", "date": "2019-09-06 03:50:15"}, "628": {"text": "RT @StopBigMoney: Mayor @PeteButtigieg on why we need #ReformFirst to address climate change. https://t.co/U5O1dk3RmJ", "date": "2019-09-06 03:34:12"}, "629": {"text": "RT @votevets: We'll be hearing from @PeteButtigieg at the @NHDems Veterans and Military Families Presidential Forum presented by VoteVets o…", "date": "2019-09-06 02:39:24"}, "630": {"text": "RT @senatorduff: Proud and excited to announce my endorsement of @PeteButtigieg as our next President. I’ve known Pete for almost a decade.…", "date": "2019-09-06 00:38:33"}, "631": {"text": "RT @colbertlateshow: TONIGHT: Democratic presidential candidate and Afghan war veteran @PeteButtigieg shares his thoughts on the right way…", "date": "2019-09-06 00:18:51"}, "632": {"text": "RT @colbertlateshow: TONIGHT: Presidential candidate @PeteButtigieg and host of the @TheGNShow, @grahnort! #LSSC https://t.co/LfwS1yz1FP", "date": "2019-09-05 23:05:34"}, "633": {"text": "RT @nypost: Mayor Pete Buttigieg talks politics and pizza in city tour with The Post https://t.co/sI93X7AeJa https://t.co/H9DPdKnMW3", "date": "2019-09-05 22:41:13"}, "634": {"text": "RT @PeteForAmerica: Each new Iowa office we open isn’t just a place to organize; it’s a home for everybody who believes we need a new appro…", "date": "2019-09-05 21:08:50"}, "635": {"text": "Stay tuned... https://t.co/SKKv431ybz", "date": "2019-09-05 18:03:17"}, "636": {"text": "I’m thinking of everyone in the path of Hurricane #Dorian. If you're in the Carolinas today, please be safe and pay attention to warnings and guidance from local officials. https://t.co/whZkRjWS5b", "date": "2019-09-05 16:34:00"}, "637": {"text": "RT @ServeUSA2gether: @PeteButtigieg in @TaskandPurpose: \"I am determined to help repair the division in our nation's social fabric through…", "date": "2019-09-05 15:46:02"}, "638": {"text": "RT @HRC: .@HRC Foundation is proud to announce pro-equality champion and 2020 presidential candidate @PeteButtigieg will join our Democrati…", "date": "2019-09-05 14:40:23"}, "639": {"text": "RT @PeteForAmerica: We're in a different phase of this campaign. Momentum is building—and we need you with us. Text PHASE THREE to 25859 to…", "date": "2019-09-05 13:33:00"}, "640": {"text": "RT @CNNPolitics: \"I feel sorry for the President,\" Pete Buttigieg says on President Trump appearing to show an altered Hurricane Dorian tra…", "date": "2019-09-05 13:11:05"}, "641": {"text": "If our presidency is not in good shape, our country is not in good shape. https://t.co/LC2y3JxeTp", "date": "2019-09-05 13:05:52"}, "642": {"text": "RT @CAPAction: \"This is a life or death issue. And the president is busy drawing with a Sharpie on a hurricane map.\" —@PeteButtigieg on com…", "date": "2019-09-05 12:52:10"}, "643": {"text": "The climate debate, fundamentally, is about how we're treating each other. https://t.co/yOHkPrgHUu", "date": "2019-09-05 12:43:35"}, "644": {"text": "RT @NewDay: Tune in: Mayor @PeteButtigieg joins us live on New Day\nhttps://t.co/Tk64moV9b1 https://t.co/L2gFLhZPOY", "date": "2019-09-05 12:25:06"}, "645": {"text": "RT @PeteForAmerica: \"Imagine what it would mean if a net-zero emissions cattle farm were as big a symbol of American achievement in fightin…", "date": "2019-09-05 04:13:09"}, "646": {"text": "RT @PeteForAmerica: \"Rural Americans can be such a huge part of the solution.\" —@PeteButtigieg #ClimateTownHall https://t.co/3L8is2RiUC", "date": "2019-09-05 04:13:06"}, "647": {"text": "RT @PeteForAmerica: We need to reduce the influence of fossil fuels in America.\n\n“If the only way we can clear that up is with a constituti…", "date": "2019-09-05 03:44:16"}, "648": {"text": "RT @PeteForAmerica: Roles in our economy are shifting and we need to be honest that this is about more than money, it’s about identity. Job…", "date": "2019-09-05 03:44:11"}, "649": {"text": "RT @PeteForAmerica: \"I bet He thinks it's messed up.\" \n\n— @PeteButtigieg https://t.co/OGDyeL22iC", "date": "2019-09-05 03:44:07"}, "650": {"text": "RT @PeteForAmerica: Washington can’t stop arguing about the diagnosis. What we need is someone who is able to start treating the patient. #…", "date": "2019-09-05 03:43:58"}, "651": {"text": "Just wrapped up @CNN's #ClimateTownHall. Follow @PeteForAmerica, where my team has been tweeting videos and facts about my plan to unite our country to meet the urgent challenges of climate change. And if you're with me, chip in: https://t.co/BcV3FgdkTN", "date": "2019-09-05 03:27:29"}, "652": {"text": "RT @PeteForAmerica: SPOTTED: @PeteButtigieg on his way to tonight's #ClimateTownHall https://t.co/epSjzittLs", "date": "2019-09-05 00:34:31"}, "653": {"text": "RT @PeteForAmerica: You've still got time to read @PeteButtigieg’s bold, new plan to meet the challenges of climate change before tonight's…", "date": "2019-09-04 23:41:05"}, "654": {"text": "RT @PeteForAmerica: When it comes to our changing climate, too many Americans have been overlooked—or pitted against each other—for too lon…", "date": "2019-09-04 22:05:08"}, "655": {"text": "RT @PeteForAmerica: \"With a bold national agenda that harnesses the power of every American, the Battle Born State can continue to lead the…", "date": "2019-09-04 20:31:07"}, "656": {"text": "RT @PeteForAmerica: From soil management technology to billions invested in innovation funds, @PeteButtigieg's new climate policy will ensu…", "date": "2019-09-04 19:55:03"}, "657": {"text": "RT @LCVoters: “Climate change is not just happening on the coasts… It’s happening everywhere and it’s happening now.”\n\n@PeteButtigieg will…", "date": "2019-09-04 19:11:39"}, "658": {"text": "RT @CAPAction: .@PeteButtigieg rolled out his climate plan, which he calls a \"national project.\" Key points: \n\n- Net-zero emissions by 2050…", "date": "2019-09-04 19:06:11"}, "659": {"text": "RT @PeteForAmerica: Implementing a plan to tackle our shared climate crisis means tapping into the power of rural communities. @PeteButtigi…", "date": "2019-09-04 19:02:23"}, "660": {"text": "RT @PeteForAmerica: “When we tell our children and grandchildren about what we did in this moment, we must tell them that we worked togethe…", "date": "2019-09-04 18:58:28"}, "661": {"text": "We have faced few crises like the threat posed by our changing climate. But the magnitude of the crisis can also galvanize us to rise to the occasion and build a safer, healthier, and more prosperous world. Let’s come together to meet it. \nhttps://t.co/mhaEuWcGIo", "date": "2019-09-04 17:49:44"}, "662": {"text": "RT @PeteForAmerica: Climate change is a threat to our crops, economy, and way of life. Text CLIMATE to 25859 to read @PeteButtigieg’s plan…", "date": "2019-09-04 15:15:50"}, "663": {"text": "Today, I released a bold plan to tackle climate change by bringing our country together. Because we can't wait. Tonight at 10 pm ET, I'll be on @CNN to talk about it—tune in. https://t.co/KZyIr0x2Mf", "date": "2019-09-04 15:01:21"}, "664": {"text": "RT @PeteForAmerica: “Someday soon I hope to have children. I want to look back and tell them that we beat the odds on climate change and bu…", "date": "2019-09-04 13:34:58"}, "665": {"text": "RT @LCVoters: .@PeteButtigieg's Mobilizing America: Rising to the Climate Challenge Plan outlines a path to reach net-zero climate pollutio…", "date": "2019-09-04 13:21:00"}, "666": {"text": "RT @bcrodriguez: Today @PeteButtigieg released a plan focused on addressing climate change. He references Pacific Junction on his issues pa…", "date": "2019-09-04 12:10:08"}, "667": {"text": "RT @PeteForAmerica: With climate catastrophe on the horizon, we've reached a make-or-break moment in our history. Text CLIMATE to 25859 to…", "date": "2019-09-04 11:59:57"}, "668": {"text": "RT @IAStartingLine: New from @PeteButtigieg: How the climate crisis is impacting rural America, and how Iowans would be part of the solutio…", "date": "2019-09-04 11:46:19"}, "669": {"text": "RT @voxdotcom: By 2050, Pete Buttigieg will be 68, younger than several other 2020 Democratic presidential contenders are right now. He has…", "date": "2019-09-04 11:41:29"}, "670": {"text": "RT @CNNOpinion: .@PeteButtigieg: Someday soon I hope to have children. I want to look back and tell them that we beat the odds on climate c…", "date": "2019-09-04 11:33:29"}, "671": {"text": "RT @BuzzFeedPol: Pete Buttigieg Wants To Make Solving The Climate Crisis “A National Project” https://t.co/AgQd7sBMfz", "date": "2019-09-04 11:31:30"}, "672": {"text": "For too long D.C. has chosen denial and obstruction as we’re faced with the imminent catastrophic effects of climate change. But science compels us to act—and we're running out of time. Today, I'm announcing a plan to unite America to meet this challenge. https://t.co/4KFD800NKq", "date": "2019-09-04 10:52:16"}, "673": {"text": "RT @PeteForAmerica: ✅ Learn the name \n✅ Break expectations\n☑️ Meet the moment\n\n#PhaseThree is here. Let’s go win. https://t.co/z6ityGa4ZP", "date": "2019-09-04 01:02:58"}, "674": {"text": "RT @WMUR9: .@WMUR9 #fitn news: 12-term state Rep. @SusanAlmy14 - chair of @NHHouseofReps Ways/Means Committee - endorses @PeteButtigieg for…", "date": "2019-09-04 00:45:15"}, "675": {"text": "Workers should be able to bargain without fear of losing their jobs. I'm proud to stand with @MachinistsUnion  workers in Indiana as they fight to save their jobs and secure better pay. https://t.co/NvFAizGhDu", "date": "2019-09-03 21:28:07"}, "676": {"text": "RT @Chas10Buttigieg: As we begin to open 20 new offices in Iowa and 12 in New Hampshire, we’re also expanding our digital outreach. #PhaseT…", "date": "2019-09-03 15:25:14"}, "677": {"text": "RT @PeteForAmerica: Hyped for #PhaseThree?\n\nBecome a volunteer today → https://t.co/BlMpYtCAWN https://t.co/BB2ez3D2Zt", "date": "2019-09-03 14:43:12"}, "678": {"text": "20 new offices in Iowa, 12 new offices in New Hampshire, 1 new Twitter account for you to get all the updates—and the latest campaign news. #PhaseThree is here. Follow along with @PeteForAmerica! https://t.co/LQhdTlgHxm", "date": "2019-09-03 12:43:21"}, "679": {"text": "RT @NYDailyNews: OPINION | Indiana Mayor Pete Buttigieg reveals his Labor Day agenda on taking a new bold approach to strengthen unions.…", "date": "2019-09-02 21:22:55"}, "680": {"text": "RT @sinovic: Labor Unions fight for working families every day and are at the foundation of what makes our country great. Let's make Septem…", "date": "2019-09-02 18:00:22"}, "681": {"text": "If we’re going to build a fair and prosperous future for us all, we urgently need every worker in America to have the opportunity to get ahead—and that means taking a bold new approach to strengthen unions for the next era. #UnionsForAll \nhttps://t.co/BgXYxmd3Kr", "date": "2019-09-02 17:41:26"}, "682": {"text": "RT @SEIU: From coast to coast, we're taking to the streets on #LaborDay to fight for#UnionsForAll because we need to solve BIG problems lik…", "date": "2019-09-02 17:23:03"}, "683": {"text": "Thank you to all who’ve invested in our campaign, and welcome to our new organizers. We’re ready—now let’s get to work! https://t.co/RBOW73QIjG", "date": "2019-09-02 16:41:49"}, "684": {"text": "This Labor Day, let's celebrate the achievements of organized labor—whose struggle won us the 40-hour work week, labor protections, and child and safety standards—and join the fight for #UnionsForAll. https://t.co/oYIlZFiJ9L", "date": "2019-09-02 15:13:27"}, "685": {"text": "Rather than meeting this crisis with the urgency it demands, lawmakers are weakening gun safety laws and putting corporate gun interests ahead of their own communities. It’s time to leave the @NRA and this failed approach in the dustbin of history. https://t.co/pVCgR1mQde", "date": "2019-09-01 22:28:28"}, "686": {"text": "Add Midland and Odessa to the list. We must act. https://t.co/McKocKCJcV", "date": "2019-09-01 18:56:52"}, "687": {"text": "RT @Readygov: ⚡️\"Getting Ready for Hurricane #Dorian\"\n\nA lot of great information has been shared this week on how to prepare for hurricane…", "date": "2019-09-01 13:52:14"}, "688": {"text": "Enough. Texas, my heart is with you. America, we must act.", "date": "2019-08-31 23:10:15"}, "689": {"text": "Now is still the time to prepare for Hurricane #Dorian. Florida, please make sure you’re following these steps to keep yourself or your loved ones safe. https://t.co/G3AAAmyvpA", "date": "2019-08-31 13:44:31"}, "690": {"text": "RT @ArlanWasHere: In this new bonus episode of YOUR FIRST MILLION, I interview Democratic presidential candidate @PeteButtigieg after moder…", "date": "2019-08-30 21:29:39"}, "691": {"text": "RT @Readygov: As you prepare for #Dorian, plan for your specific needs:\n\n✅ Include medication in your emergency kit\n✅ Charge assistive devi…", "date": "2019-08-30 20:09:03"}, "692": {"text": "64 years ago this week, Emmett Till was tortured, murdered, and dumped in the Tallahatchie River. With hate still endangering lives in this country, his story needs to be told and remembered. https://t.co/GyrmstDFvu", "date": "2019-08-29 19:40:03"}, "693": {"text": "RT @bustle: .@PeteButtigieg avoided long-winded politician speak, and cut straight to the point about his plans for addressing the cost of…", "date": "2019-08-29 17:21:52"}, "694": {"text": "On this day in 1963, Martin Luther King Jr. led hundreds of thousands in marching for jobs and freedom. Great progress was made, but too much of his dream was deferred. In our time, we must act to make justice and freedom a reality for all.", "date": "2019-08-29 01:44:47"}, "695": {"text": ".@SenGillibrand is unafraid to meet the challenges of our time, whether it's advocating for service members, protecting reproductive rights, or keeping families together. I'm grateful for her leadership and strength—and I know she'll keep fighting for us all. Thank you, Senator. https://t.co/lXijWH8asm", "date": "2019-08-28 23:16:44"}, "696": {"text": "It's time for our government to defend Americans—and American values. Congress should exercise its oversight authority over DHS to ensure allocated funds are used for the purpose they were authorized for.", "date": "2019-08-28 21:54:10"}, "697": {"text": "Taking money Congress authorized to protect people facing disaster in order to indefinitely detain asylum seekers is unconscionable. It is unworthy of the presidency and unworthy of the United States. https://t.co/vHJYduZmMj", "date": "2019-08-28 21:54:09"}, "698": {"text": "The presidency is a sacred trust. Being president means standing with Americans when they need you most. It means sheltering them from the storm. And, above all, it means knowing that the American people are always more important than yourself.", "date": "2019-08-28 18:43:23"}, "699": {"text": "We need a Secretary of Education that believes in public education. https://t.co/PV9LlYAf4H", "date": "2019-08-28 16:28:53"}, "700": {"text": "Still can’t believe my luck. Thank you @Chas10Buttigieg for a magical first date and all that has come since. https://t.co/9KK5r5GbC4", "date": "2019-08-28 14:42:41"}, "701": {"text": "We've got a president who is actively undercutting Iowa farmers in favor of Big Oil—and he's doing it while his trade war with China decimates farmers' bottom lines. When I'm president, I'll end this administration’s abuse of small refinery exemptions. https://t.co/peDg0jjqKx", "date": "2019-08-28 01:08:17"}, "702": {"text": "This is a crisis of care—and a crisis of caring. We need to speak honestly about mental health and addiction, and act quickly to provide communities with the resources necessary to meet this national challenge. https://t.co/0f6VkzMcyg", "date": "2019-08-28 00:14:49"}, "703": {"text": "RT @GigWorkersRise: Thanks for stopping by, @PeteButtigieg. We appreciate you standing with drivers for AB5 and a union. \n\nYou said it corr…", "date": "2019-08-27 22:24:21"}, "704": {"text": "Today I proudly joined the @GigWorkersRise community in protesting for union rights because a gig is a job and a worker is a worker—and it’s past time to guarantee workplace protections and #UnionsForAll. https://t.co/A5mlVtLVIL", "date": "2019-08-27 21:09:55"}, "705": {"text": "RT @GigWorkersRise: .@PeteButtigieg stands with drivers.  \n@PeteButtigieg stands with drivers. \n@PeteButtigieg stands with drivers. \n@PeteB…", "date": "2019-08-27 20:57:45"}, "706": {"text": "RT @sfchronicle: Democratic presidential candidate @PeteButtigieg joined around 100 Uber drivers who circled the company’s Market St. headq…", "date": "2019-08-27 20:50:58"}, "707": {"text": "RT @SEIU: Mayor @PeteButtigieg marched with California gig workers outside @Uber HQ to fight for better pay, benefits, protections &amp; a path…", "date": "2019-08-27 19:58:45"}, "708": {"text": "RT @Chas10Buttigieg: A thread for this #TeacherTalkTuesday \n\nAcross the country, teachers and students are heading back to school. As a tea…", "date": "2019-08-27 13:10:12"}, "709": {"text": "Good. Drug manufacturers fueled our nation’s opioid crisis for profit—and we must hold them accountable. https://t.co/xfHyNGtWDE", "date": "2019-08-27 01:24:43"}, "710": {"text": "Happy #InternationalDogDay! https://t.co/K0qTfAFLwu", "date": "2019-08-26 22:38:26"}, "711": {"text": "We can't solve the urgent global challenges of our time without American leadership—and America can't lead when America doesn't show up. https://t.co/a4SHN5RHTO", "date": "2019-08-26 21:03:52"}, "712": {"text": "In 2019, paychecks should be equal, seats at the table should be balanced, health care decisions should be personal, and every vote should count. Equality can't wait, and every day should be #WomensEqualityDay.", "date": "2019-08-26 20:53:15"}, "713": {"text": "A year ago today we lost Senator John McCain. A Navy war hero, a statesman, and a patriot, he understood that the American project is bigger than any one person or party—and his legacy calls on each of us to protect it for future generations.", "date": "2019-08-25 22:53:02"}, "714": {"text": "RT @sdutIdeas: Presidential candidate @PeteButtigieg shares his plan for mental health care for America's veterans: https://t.co/vnzNuHQGfJ…", "date": "2019-08-25 16:13:19"}, "715": {"text": "RT @MeetThePress: WATCH: Can anything be done to prevent China from cracking down on Hong Kong protests? #MTP #IfItsSunday\n\n@PeteButtigieg:…", "date": "2019-08-25 13:53:24"}, "716": {"text": "RT @MeetThePress: Part of Trump's isolation in the G-7 summit, @petebuttigieg says, is \"you have world leaders coming together ... talking…", "date": "2019-08-25 13:53:12"}, "717": {"text": "My kind of ride. https://t.co/NPHj32raIm", "date": "2019-08-24 21:48:30"}, "718": {"text": "Today I asked Granite Staters to raise their hands if they or someone they know have been touched by our nation's mental health care and addiction crisis. I saw a room full of hands. We can no longer wait to act—that's why I just released a plan to meet this urgent crisis. https://t.co/vjyX2ozaf9", "date": "2019-08-24 01:37:32"}, "719": {"text": "Freedom means living free of discrimination because of who you are or whom you love. By arguing to legalize discrimination against LGBTQ+ Americans, this administration put themselves on the wrong side of history—and our values. As president, I'll sign the Equality Act into law. https://t.co/JJbGmpCmTD", "date": "2019-08-24 00:18:37"}, "720": {"text": "RT @RyanForRecovery: Thank you @PeteButtigieg for giving me a dose of hope today. It’s more than an #opioid crisis, it’s an #addiction cris…", "date": "2019-08-23 21:28:33"}, "721": {"text": "At this critical time in our nation's history, I'm grateful for good people who put their hand up and offer to serve. Congratulations on your announcement @Hickenlooper—and thank you for your continued leadership. https://t.co/6gdu1SsLrC", "date": "2019-08-23 21:20:00"}, "722": {"text": ".@SethMoulton is a patriot who defended our nation and our values as a Marine and as a Congressman.\n\nHe understands the urgency of this moment, and I'm grateful for his voice and for his service. https://t.co/21BOz9xhVv", "date": "2019-08-23 20:12:51"}, "723": {"text": "We're in the midst of a devastating opioid epidemic that is harming communities across the country. In a few moments, I'll be speaking live from Manchester, NH to unveil my new plan to tackle the crisis head on and reduce deaths of despair by 1 million.  https://t.co/SLIBA7ugC2", "date": "2019-08-23 17:44:13"}, "724": {"text": "RT @CHunschofsky: Our country needs to treat mental health like physical health. @PeteButtigieg has a comprehensive plan to improve mental…", "date": "2019-08-23 17:22:55"}, "725": {"text": "Young people are in the throes of America’s mental health crisis, and it’s not hard to understand why. But young people also have the power to address it, and now is the time. We can’t wait any longer. https://t.co/vcj5ydSBX9", "date": "2019-08-23 16:14:48"}, "726": {"text": "RT @ServeUSA2gether: \"To tackle the mental health issue, @PeteButtigieg pledges to \"dramatically\" expand the mental health &amp; addiction work…", "date": "2019-08-23 15:16:05"}, "727": {"text": "For too long, the Black community has been disproportionately impacted by America’s mental health care crisis. Now is the time to pursue transformative policies and save lives. We can’t wait any longer. https://t.co/SOK1OoWKN6", "date": "2019-08-23 14:49:11"}, "728": {"text": "RT @CAPAction: The opioid epidemic takes tens of thousands of lives per year in the U.S.\n\n@PeteButtigieg has a plan to change that. This mo…", "date": "2019-08-23 13:25:33"}, "729": {"text": "RT @TeenVogue: We talked to @PeteButtigieg about the mental health needs of young people, and how their influence matters now more than eve…", "date": "2019-08-23 13:18:47"}, "730": {"text": "RT @abgutman: Take a few minutes to read @PeteButtigieg’s plan on mental health and addiction. It is *exactly* the right framing of the cri…", "date": "2019-08-23 12:35:19"}, "731": {"text": "RT @CitizenCohn: Mayor Pete’s new addiction/mental health agenda has a bit of everything, from better coverage of opioid treatments to inve…", "date": "2019-08-23 12:29:41"}, "732": {"text": "RT @ASlavitt: NEW: Kudos to @PeteButtigieg for releasing a health plan about...health.\n\nI reviewed the details. Pete moves beyond the quest…", "date": "2019-08-23 12:23:51"}, "733": {"text": "America’s addiction and mental health care crisis has been building for decades—due to decades of neglect by political leaders in Washington. Today, I’m proposing a new approach that tackles this crisis with the urgency and care it deserves. https://t.co/U8F9DXJPC2", "date": "2019-08-23 11:41:26"}, "734": {"text": "Our country is in the midst of a mental health and addiction crisis, worsened by decades of stigma and political neglect. I’ll bring a new approach, rooted in commitment and community, to tackle this crisis with the urgency it deserves. https://t.co/spBoh5KH4X", "date": "2019-08-23 10:39:22"}, "735": {"text": "Fires like the one raging in the Amazon are a reminder not only of the urgency to act on climate change but also of the failure of our politics to meet the great challenges of our time. Politicians can no longer fiddle while the world burns. The time to act is now.", "date": "2019-08-22 22:25:39"}, "736": {"text": "This Black Women's Equal Pay Day, let's act on bold, real solutions to close the gap, like passing the Paycheck Fairness Act and investing in Black women entrepreneurs. Because we can only move forward toward a brighter, better America with justice and fairness for all.", "date": "2019-08-22 21:41:19"}, "737": {"text": "Black women earn just 61 cents for every dollar earned by white men. That means a Black woman doing the same job as her white male counterpart in 2018 wouldn't have caught up until now. This gap is the result of centuries of systemic racism, gender discrimination, and exclusion.", "date": "2019-08-22 21:41:19"}, "738": {"text": "It’s time to end the stigma associated with reproductive freedom. That begins by sharing stories, especially when they are difficult. Thank you to all those, including the @NARAL members I met yesterday, who’ve summoned the courage to share theirs. https://t.co/lar8HdsxXh", "date": "2019-08-22 17:13:56"}, "739": {"text": "A 30-minute phone call with the @NRA was all it took to remind this president who’s in charge. Apparently they have him by the...base. And that puts American lives at risk. https://t.co/i320CoWXBu", "date": "2019-08-22 16:34:59"}, "740": {"text": "At a moment when we have such a sustained assault on reproductive freedom, I believe it is vital that Democrats be vocal in standing up for women—and that men running for president be twice as vocal about this issue at this time. https://t.co/hwtXQeRcbN", "date": "2019-08-22 02:39:09"}, "741": {"text": "We’re facing a climate crisis, and we must summon the courage to confront it before it’s too late. Thank you, Governor Inslee, for demanding that America meet the urgency of the moment. https://t.co/1qYvBREzS3", "date": "2019-08-22 02:14:04"}, "742": {"text": "Politics is about who you fight for and whose lives you want to make better. Trump would raise costs for drivers, hurt farmers, and undermine the livelihood of auto workers—all to give Big Oil and their executives a windfall. That’s all you need to know.\nhttps://t.co/QA5BJoKGSf", "date": "2019-08-22 01:08:57"}, "743": {"text": "We’ve got to take a stand when Republicans target Title X funding. https://t.co/CgqbgyRis1", "date": "2019-08-21 23:13:26"}, "744": {"text": "@ilyseh Thank you for having me. Today's conversation was a reminder of the work yet to be done to achieve reproductive justice—and an urgent call on all of us to stand up to this administration's unprecedented attacks on women's rights and reproductive freedom.", "date": "2019-08-21 22:33:32"}, "745": {"text": "RT @NARAL: “I’m @PeteButtigieg. I’m a mayor, I’m a veteran, I’m a feminist, and I’m running for President.” #2020Election https://t.co/eYOG…", "date": "2019-08-21 17:54:55"}, "746": {"text": "I'm about to join @NARAL members in Iowa to discuss the urgency of this moment, and why we must come together to confront unprecedented attacks on women's rights and reproductive justice. I hope you'll tune in. \nhttps://t.co/KuDmAzNyTc", "date": "2019-08-21 16:38:47"}, "747": {"text": "We're in a moment of crisis, with women's rights and reproductive freedom facing unprecedented attacks. I'm proud to stand with organizations like @NARAL in this fight, and I can't wait for today's conversation. https://t.co/z281IiQG06", "date": "2019-08-21 15:34:09"}, "748": {"text": "The vast majority of Americans know we must act, and the vast majority of Americans agree on how. But nothing gets done because Washington is a captive to an unchecked corporate gun lobby. We can't wait anymore. Children are dying. Hate is rising. Now is the time to say enough. https://t.co/BjpT0oMWme", "date": "2019-08-20 23:44:30"}, "749": {"text": "400 years ago a ship carrying more than 20 enslaved Africans arrived in Virginia. On the anniversary of that fateful day, let us summon the courage to reckon with our past—and act boldly to break with the racial and economic structures that are its legacy. https://t.co/v1Lxb7NzFf", "date": "2019-08-20 20:00:48"}, "750": {"text": "Women’s rights are under attack. Today’s Title X development makes the work of organizations like @NARAL all the more urgent and necessary—and I’m proud to stand with them. See you on Wednesday. https://t.co/GOn2mQFeo7", "date": "2019-08-20 01:07:46"}, "751": {"text": "The current occupant of the White House is the symptom of much larger problems, and we need a new approach to solve them.\n\nI'm running for president because we’re running out of time to act. https://t.co/JwsDvpowjv", "date": "2019-08-19 21:00:28"}, "752": {"text": "This is an attack on women. Enforcing this new 'gag rule' will cost millions of women—especially low-income women of color—access to safe, affordable care. #IStandWithPP #ProtectX https://t.co/xoMgQDIPUG", "date": "2019-08-19 20:21:31"}, "753": {"text": "So glad to join @GoodwillIntl and our own Group Violence Intervention team to discuss the urgency of our work on preventing gun violence in South Bend and what our partnership has taught us. https://t.co/YlWkZVZ5Hv", "date": "2019-08-19 16:15:29"}, "754": {"text": "RT @IAStartingLine: \"They’re great. He’s better.” - one attendee at @PeteButtigieg's Burlington event last week on the rest of the Democrat…", "date": "2019-08-19 16:13:59"}, "755": {"text": "Right now, almost 18 years after September 11th, somebody is packing their bags for Afghanistan—and they're wondering why we're still there. It's time to bring our troops home. https://t.co/A2Kmae0fp7", "date": "2019-08-19 00:10:16"}, "756": {"text": "“The way to right wrongs is to turn the light of truth upon them.” —Ida B. Wells\n\nOn the 99th anniversary of the 19th Amendment's ratification, let us honor the suffragettes who fought for the right to vote—and join those working to protect and advance women's rights in our time.", "date": "2019-08-18 19:58:24"}, "757": {"text": "There is clearly no strategy for dealing with the trade war—a trade war this president started—in a way that will actually lead to results for American farmers or American consumers. https://t.co/qSW2jdXguB", "date": "2019-08-18 16:28:29"}, "758": {"text": "RT @CNNPolitics: Buttigieg on vowing to lift President Trump’s China tariffs: “There's no strategy with dealing with the trade war in a way…", "date": "2019-08-18 14:48:01"}, "759": {"text": "Bear and Buckeye are lucky to have found their forever home with the Ryans (and they’re long overdue for a visit with Buddy and Truman)! #ClearTheShelters https://t.co/dhWV3pLuDV", "date": "2019-08-17 21:40:49"}, "760": {"text": "This week, we made a visit to the Iowa State Fair, rolled out a plan to unleash the full potential of rural America, met with the Black Church PAC in Atlanta, and had a little fun along the way. \n\nICYMI, here’s a look back at our latest week on the trail. https://t.co/mQEAOtYuzO", "date": "2019-08-17 21:16:08"}, "761": {"text": "Buddy, Truman, and Olivia are reminders of how many loving, beautiful animals are waiting for forever homes in shelters across America. This #ClearTheShelters Day, open your home and your heart to a rescue animal in need: https://t.co/ur8X3QLume https://t.co/9Q8uL7HbSz", "date": "2019-08-17 19:21:59"}, "762": {"text": "Before @FirstDogsSB, there was Olivia. She found her way out of a pound into her forever home with me and my parents in South Bend. https://t.co/X2xOMCczt9", "date": "2019-08-17 19:21:55"}, "763": {"text": "Last year, @Chas10Buttigieg and I welcomed Buddy into our household and into our lives. Like his “brother” Truman, he quickly became a big source of joy. Rescue dogs have long been an important part of my life, and I'm with all those on board to #ClearTheShelters. https://t.co/jxfb4xO4pR", "date": "2019-08-17 19:21:53"}, "764": {"text": "I met an American hero. Thank you, @RepJohnLewis, for your courage, your grace, your optimism, and for making the #goodtrouble, the necessary trouble, to advance the cause of justice in our time. https://t.co/IaaBOQtUUa", "date": "2019-08-17 13:01:41"}, "765": {"text": "It was a good day. https://t.co/L56idcP3Oa", "date": "2019-08-16 03:07:35"}, "766": {"text": "This week I’m in Iowa, where I put forward a plan to unleash the potential of America’s heartland.\n\nRural communities are brimming with possibilities, and places like Tipton and Burlington can lead the way in helping to meet America's challenges. https://t.co/23J7cNHdTa", "date": "2019-08-15 21:21:04"}, "767": {"text": "Governor @Hickenlooper didn't enter this race to advance an ideology, he got in to serve others. That's why he first ran for mayor of Denver, and that's why Coloradans elected him governor—twice. I'm grateful for his commitment to public service. We need more leaders like him.", "date": "2019-08-15 19:00:04"}, "768": {"text": "Rules of the road for the #IowaStateFair:\n\n1. Eat everything ✔️\n2. Ride the slide ✔️ https://t.co/N8GRqnpy3p", "date": "2019-08-15 16:50:05"}, "769": {"text": "84 years ago today, we recognized that when we care for seniors and Americans who've lost their jobs, it provides all of us with greater security. As President, I’ll protect Social Security—not just as a lifeline for millions but as a national inheritance for future generations.", "date": "2019-08-15 03:15:27"}, "770": {"text": "Iowans are kind, decent, and welcoming people. Steve King doesn’t deserve the honor of representing them, and they deserve much better than Steve King. Let’s help replace him with someone who is as decent as they are. Join me in supporting @JDScholten: https://t.co/HNtMQFvEgI https://t.co/MyfcK8Qvef", "date": "2019-08-15 01:55:58"}, "771": {"text": "There are a lot of questions we don't have answers to right now. What we do know is that this will be a long night for too many families in Philadelphia. Our hearts are with them. Our resolve and commitment are with them in the long days to come.", "date": "2019-08-15 01:24:06"}, "772": {"text": "RT @DMRegister: Shortly after going down the Giant Slide with a 4-year-old, @PeteButtigieg joined the @DMRegister for a ride on the Sky Gli…", "date": "2019-08-14 17:15:16"}, "773": {"text": "With a renewed dedication to rural communities, smart investments, and innovative ideas, rural America can not only meet our national challenges—it can lead the way in tackling them.\nhttps://t.co/Z3WXptpcIw", "date": "2019-08-14 16:16:27"}, "774": {"text": "The people of Hong Kong deserve our support. At times like this it’s important for America to be a voice for peace, for human rights, for freedom, and for stability, and as president I’ll ensure that we stand up for these values. https://t.co/yzC17wYbpr", "date": "2019-08-14 13:24:52"}, "775": {"text": "I see people every day hurting because of this administration's trade wars, and now the Secretary of Agriculture is calling them whiners. American farmers work hard, and they're right to ask about their future when Trump's trade strategy keeps coming down on their backs. https://t.co/n2yru11MKE", "date": "2019-08-14 01:38:13"}, "776": {"text": "The president thinks we're all suckers. We've got a country where GDP is going up and life expectancy is going down, and his biggest solution is to pass a tax cut for corporations. https://t.co/M8j1YdU9s1", "date": "2019-08-14 00:42:28"}, "777": {"text": "@DJJudd #NewProfilePic", "date": "2019-08-14 00:40:33"}, "778": {"text": "@sophiarmichel @IowaStateFair Thanks and keep up the great work!", "date": "2019-08-14 00:26:04"}, "779": {"text": "RT @Emilylgoodin: Mayor @PeteButtigieg rides the giant slide with a little boy who asked him to ride with him #IowaStateFair https://t.co/h…", "date": "2019-08-13 22:31:25"}, "780": {"text": "RT @IAStartingLine: What it’s like to try to order a root beer float as a presidential candidate at the Iowa State Fair https://t.co/dWSW6O…", "date": "2019-08-13 22:27:45"}, "781": {"text": "RT @IAStartingLine: “What are you doing other than speaking?” a bus rider asks @PeteButtigieg \n\n“Well, eating, I suppose,” he replies\n\n#IaC…", "date": "2019-08-13 17:37:49"}, "782": {"text": "RT @DanRGlickman: While not endorsing in the primary, I do believe that Buttigieg's plan of action represents a comprehensive commitment to…", "date": "2019-08-13 15:52:52"}, "783": {"text": "RT @bcrodriguez: NEW: Ahead of Iowa visit, @PeteButtigieg rolls out policy aimed at helping rural America, in part through apprenticeships,…", "date": "2019-08-13 15:25:25"}, "784": {"text": "RT @JoshNBCNews: Former Iowa Gov Vilsack with praise this AM for Buttigieg rural economic plan: “His plan reinforces the Democratic message…", "date": "2019-08-13 13:09:45"}, "785": {"text": "This is a make-or-break moment in our history, and we need to meet it with the urgency it requires. Rural America can lead the way. Today, I'm proud to announce a plan to empower rural America and unlock its full potential. https://t.co/NglOpJZB5A", "date": "2019-08-13 11:49:05"}, "786": {"text": "Today, Muslims in communities across America and around the world will celebrate #EidAlAdha, marking the end of the Hajj. It's a moment for unity, prayer, and reflection. To all those celebrating, Eid Mubarak!", "date": "2019-08-11 17:29:20"}, "787": {"text": "I belong to the first generation where school shootings were routine. The second generation is now rising up to make sure there will not be a third. https://t.co/ujETngyB8f", "date": "2019-08-11 00:07:14"}, "788": {"text": "I’ve been hearing “never again” for most of my adult life. Enough. Dial 877-615-7198 to demand change. https://t.co/HwkW4SydWR", "date": "2019-08-10 15:39:06"}, "789": {"text": "RT @MomsDemand: “Keep speaking up.  My god, keep speaking up. It’s working!” - @PeteButtigieg\n\nMoms Demand Action volunteers are on it! We…", "date": "2019-08-10 15:07:44"}, "790": {"text": "We must think about what is happening amid the rise of domestic terrorism and the politics of fear—and we must act. Please join me in supporting organizations that are doing just that: https://t.co/BWrgF8CdkJ", "date": "2019-08-10 00:52:39"}, "791": {"text": "I'm also heartbroken for our country. Whether it was a child in Texas orphaned by a white supremacist's bullet or a child in Mississippi left parentless by a president's orders, we must stop and think about what is happening to children in our country.", "date": "2019-08-10 00:52:38"}, "792": {"text": "I'm heartbroken for Magdalena. No child should have to experience the fear of being ripped from her parents. https://t.co/Ss06AcxqzW", "date": "2019-08-10 00:52:38"}, "793": {"text": "RT @katybkoz: Today, @PeteButtigieg released a rural health plan, and it's so encouraging to see broad, national attention to investing in…", "date": "2019-08-09 18:09:42"}, "794": {"text": "RT @Essence: .@PeteButtigieg wants to help end the Black maternal health crisis. https://t.co/scmssCvIlc", "date": "2019-08-09 18:00:36"}, "795": {"text": "RT @josephax: Democratic presidential candidate Pete Buttigieg released a health care plan aimed at rural Americans and Native American tri…", "date": "2019-08-09 16:59:03"}, "796": {"text": "RT @vyurkevich: I've spent a lot of time with America's farmers - many without healthcare coverage - who say they need high speed internet,…", "date": "2019-08-09 16:58:42"}, "797": {"text": "RT @drJoshS: Impressed by @PeteButtigieg plan for rural *health* — with starting point that people in rural areas are dying too early from…", "date": "2019-08-09 16:58:17"}, "798": {"text": "It's time to break with the politics of the past and usher in a new era for rural America—that begins by securing its health. Today I’m proud to announce a plan to invest in too often overlooked communities and secure a healthy future for rural Americans. https://t.co/twi705R3W0", "date": "2019-08-09 11:23:15"}, "799": {"text": "This is the least @senatemajldr could do. Dial 877-615-7198 right now to tell your senators to get back to Washington and vote on common-sense gun safety legislation. https://t.co/tC45nV3ZFY", "date": "2019-08-08 23:34:17"}, "800": {"text": "RT @ABC: NEW: From intelligence analyst to a military \"Uber\": Inside Mayor Pete Buttigieg's Afghanistan deployment. https://t.co/W61VdESBiI…", "date": "2019-08-08 16:04:12"}, "801": {"text": ".@JenniferforAG has served our nation as a military officer and her community as a lawyer tackling poverty, criminal justice reform, and voting rights. Excited to see her clinch the nomination and continue her career of service as the Democratic nominee for Mississippi AG. https://t.co/s6JmbSYgEZ", "date": "2019-08-08 15:50:13"}, "802": {"text": "Neighbors are helping children as if there had been a natural disaster. But this is a policy disaster. It’s a disaster of choice, including the choice to harm these innocent children. Our nation will be judged for this. Time for a better way. https://t.co/4jABiDvkEy", "date": "2019-08-08 14:15:09"}, "803": {"text": "At this vulnerable moment in the history of our people, we see that moral leadership is a critical part of the presidency. What we need from a president is the ability to unify the country—and the ability to lead the way to keep us safe. https://t.co/LIQJBNFJnU", "date": "2019-08-08 03:07:13"}, "804": {"text": "I stand with @Culinary226 in its fight to unionize, and I back its members in demanding that @StationCasinos negotiates with them. This is a make or break moment for our country — we can't wait to make sure workers get fair pay, fair benefits, and basic respect.", "date": "2019-08-08 02:30:58"}, "805": {"text": "At times like this, it would be helpful if our country had a president.", "date": "2019-08-08 00:35:55"}, "806": {"text": "RT @AMarch4OurLives: At a @PeteButtigieg campaign event, young people from @mfolflorida got Mayor Pete to confirm that he’ll be at our Oct.…", "date": "2019-08-07 22:56:10"}, "807": {"text": "RT @Everytown: .@PeteButtigieg released a plan for gun safety that includes: \n\n✅ Requiring background checks on all gun sales\n✅ Passing a R…", "date": "2019-08-07 22:55:34"}, "808": {"text": "I'm in—see you in Nevada. https://t.co/TUjXJh951k", "date": "2019-08-07 20:36:47"}, "809": {"text": "Congratulations to Representative-elect @ross_wilburn! A former mayor and member of the Iowa National Guard, he will now serve the people of Iowa in new ways. https://t.co/fSDifVos7c", "date": "2019-08-07 16:21:33"}, "810": {"text": "Also, this happened https://t.co/Y3uGUmJwsb", "date": "2019-08-07 02:32:09"}, "811": {"text": "This #NationalNightOut Against Violence, South Bend community members, @southbendpolice, and other organizations join a nationwide commitment to support each other in making our neighborhoods and communities safe. Thanks to all who work for peace and safety. https://t.co/1339kz6obY", "date": "2019-08-07 00:20:22"}, "812": {"text": "Glad for the chance today to thank @SouthBendFire fighters for their action on two major fires just a few days apart in South Bend and hear about their experience—and thankful as always for the work our first responders do daily. https://t.co/F9E4sxcBJx", "date": "2019-08-06 22:04:18"}, "813": {"text": "Toni Morrison’s writing called America to understand the consequences of slavery and segregation, and challenged the world to wrestle with what it means to be beautiful and beloved. Like millions, I am better for having learned from her exquisite understanding of humanity.", "date": "2019-08-06 21:04:31"}, "814": {"text": "Mayor @CHunschofsky is right. The Senate could act right now to pass common-sense gun safety legislation that already cleared the House—reforms that the overwhelming majority of Americans support. Call your senators right now to demand a vote: 877-615-7198 https://t.co/4FL0MHhqvq", "date": "2019-08-06 19:11:48"}, "815": {"text": "Weapons like the one I carried in Afghanistan have no place on our streets or in our schools—least of all in the hands of white nationalists. https://t.co/h3pG9byF0o", "date": "2019-08-06 18:57:54"}, "816": {"text": "The old politics of cut-and-paste condemnation and inaction after every mass shooting won’t work—we need a new approach.\n\nToday, I’m announcing an action plan to combat the threat of white nationalist terrorism, abetted by weak gun laws and the gun lobby. https://t.co/RS7qH2IAI0", "date": "2019-08-06 11:47:15"}, "817": {"text": "Pete for America supporters made more than 10,000 calls in the first hour alone—and now we’re up to nearly 17,000 calls to the Senate.\n\nThank you. Call again tomorrow. Demand change. Here's the number: 877-615-7198 https://t.co/51ZSaKMdr9", "date": "2019-08-06 02:34:33"}, "818": {"text": "This president is amplifying white nationalist hate and @senatemajldr is blocking a bill that could disarm them. Dial 877-615-7198 to tell your Senators to pass gun safety reforms that the majority of Americans want.\n\nWe must act—for our futures, our loved ones, and our country.", "date": "2019-08-06 01:59:48"}, "819": {"text": "Today marks 7 years since an armed white nationalist killed 6 at a Sikh Temple in WI. Two days ago, a white nationalist killed 22 in El Paso. Hours later, a gunman killed 9 in Dayton. We are under attack by white nationalist terrorists, abetted by weak gun laws and the @NRA.", "date": "2019-08-06 01:59:48"}, "820": {"text": "J.D. offers leadership that reflects our common decency and common resolve. It's not just a stark contrast to Steve King's enabling of a hateful right-wing agenda—it's what Washington needs now more than ever. I’m excited to see him enter the race to represent #IA04. https://t.co/gna6p8Gmay", "date": "2019-08-05 20:54:18"}, "821": {"text": "Our country is under attack by white nationalist terrorism, abetted by weak gun laws and the gun lobby.\n\nIf we are serious about national security, we must be clear about the threat we face and the factors behind it. Our president has proven once again that he is not. https://t.co/ZrxWczKWtG", "date": "2019-08-05 17:04:27"}, "822": {"text": "RT @runforsomething: Check it out: so far 12 presidential candidates have signed the 2020 #DownBallotPledge. Take a look at this message fr…", "date": "2019-08-05 15:06:57"}, "823": {"text": "We live in the only country where this is routine, yet an overwhelming majority of Americans support gun safety measures that would save lives.\n\nIt shows you that the @NRA no longer speaks for gun owners, it speaks for gun corporations. https://t.co/8xDHn137cz", "date": "2019-08-04 22:10:51"}, "824": {"text": "This White House amplifies hate, and people who are in the grip of this hateful, extremist ideology feel validated from all the way at the top. https://t.co/PROkpquhSZ", "date": "2019-08-04 21:43:18"}, "825": {"text": "After 9/11, I joined thousands of other Americans in signing up to fight the threat to our nation. Now, in the face of white nationalist terror, our leaders must stand up to fight this threat to our national security.", "date": "2019-08-04 20:49:38"}, "826": {"text": "Our president isn't just failing to confront and disarm these domestic terrorists, he is amplifying and condoning their hate. https://t.co/TNNUXccxkW", "date": "2019-08-04 20:49:38"}, "827": {"text": "Will the President of the United States leave his golf resort, go back to Washington, address the nation, condemn—in no uncertain terms—white nationalism, and call for the Senate to convene tomorrow to enact at least the most basic gun safety reforms that most Americans want? https://t.co/GEVLkLuWei", "date": "2019-08-04 17:01:21"}, "828": {"text": "RT @CNNPolitics: 2020 presidential candidate Pete Buttigieg on the latest mass shootings: “Every time this happens we say never again. We s…", "date": "2019-08-04 14:53:31"}, "829": {"text": "RT @FoxNewsSunday: Chris asks @PeteButtigieg what can be done to stop these shooting situations, he says \"Washington has been captured by s…", "date": "2019-08-04 13:25:18"}, "830": {"text": "RT @FoxNewsSunday: Chris asks @PeteButtigieg about the shootings in the past 24 hours in #Elpaso and #Dayton. \"This is terrorism and we hav…", "date": "2019-08-04 13:13:34"}, "831": {"text": "How many more?", "date": "2019-08-04 11:28:53"}, "832": {"text": "America is under attack from homegrown white nationalist terrorism. That ideology is evil. It is being condoned at the highest levels of our government. And today it inspired a gunman to claim at least 20 lives in #ElPaso.\n\nEnough is enough. We have an obligation to act. https://t.co/5kiKFkjSi7", "date": "2019-08-04 00:49:23"}, "833": {"text": "Our country is under attack from white nationalist terrorism, inspiring murder on our soil and abetted by weak gun laws. If we are serious about national security, we must summon the courage to name and defeat this evil.", "date": "2019-08-03 23:57:14"}, "834": {"text": "RT @EPPOLICE: Blood needed urgently. Multiple injured transported to various hospitals. Blood donation centers Vitalent Blood Services at 4…", "date": "2019-08-03 21:15:35"}, "835": {"text": "My grandmother used to take me to Cielo Vista Mall. Now it’s one more mass shooting scene. How many more must grieve before we act? #ElPaso", "date": "2019-08-03 19:20:10"}, "836": {"text": "“Love takes off masks that we fear we cannot live without and know we cannot live within.” #JamesBaldwin would be 95 today and his work and words are as urgent and timely as ever.", "date": "2019-08-03 02:27:56"}, "837": {"text": "RT @nowthisnews: 'The Republican Party 20 years ago ran away from [David Duke]. Today, they are supporting naked racism in the White House.…", "date": "2019-08-03 02:20:40"}, "838": {"text": "Separating children from their parents based on HIV status, in defiance of guidance from @HHSGov, is another display of ignorance and cruelty by this administration. Every migrant child separated must be identified and reunited. https://t.co/RZXt1XxUqd", "date": "2019-08-02 20:38:16"}, "839": {"text": "The president’s “strategy” is to threaten taxes on US workers, farmers, and allies while hurting America's ability to compete globally. Trump should be betting on America and working with our allies to put pressure on China, not the other way around. https://t.co/Z3NKHw7cBa", "date": "2019-08-02 19:02:39"}, "840": {"text": "Hey, Las Vegas, I’ll be in town today! I’m joining @dinatitus at First Friday to meet with voters—and to hear some live music. Hope to see you there! https://t.co/kFugf8kVVd", "date": "2019-08-02 15:00:01"}, "841": {"text": "I hope I made you proud on Tuesday.\n\nIf you're with me, text DEBATE to 25859. https://t.co/ZtvR4U4Gqo", "date": "2019-08-02 13:20:24"}, "842": {"text": "I was proud to support fellow veteran @GinaOrtizJones as she nearly unseated Will Hurd last year in one of Texas’s most competitive Congressional districts. Delighted that she‘s stepping up again in what will now be an open seat. https://t.co/HU5tvibb3R", "date": "2019-08-02 02:09:34"}, "843": {"text": "RT @UFCW: “A gig is a job and a worker is a worker.” - @PeteButtigieg recognizing the importance of making sure that all jobs are good jobs…", "date": "2019-07-31 23:50:16"}, "844": {"text": "This is a make or break moment in our nation’s history. #DemDebate https://t.co/0XBZPRs71Y", "date": "2019-07-31 16:02:49"}, "845": {"text": "RT @JustinGomezABC: .@PeteButtigieg joining union workers in downtown Detroit this morning. “You should not have to fight for a union and $…", "date": "2019-07-31 14:26:12"}, "846": {"text": "RT @nowthisnews: Mayor @PeteButtigieg said Republicans will criticize whatever progressives say — so it's time Democrats 'stop worrying' ab…", "date": "2019-07-31 14:19:57"}, "847": {"text": "Detroit is looking good this morning. Early start as we head to @NewDay and @Morning_Joe to discuss last night’s debate and the road ahead! https://t.co/p3ANd79RzE", "date": "2019-07-31 10:36:45"}, "848": {"text": "I just got off the stage from the #DemDebate. If you agree that we need to break with the past and focus on real, practical solutions, please consider making a contribution to our campaign tonight: https://t.co/qSZVDvt0h4 https://t.co/4xR6UOa1r6", "date": "2019-07-31 04:06:56"}, "849": {"text": "We can do this, if and only if we are ready to walk away from what hasn’t worked with bold action.\n\nIf you're with me, text PETE to 25859. #DemDebate https://t.co/X4aQx5k3Xz", "date": "2019-07-31 02:53:42"}, "850": {"text": "I don’t care how old you are—I care about your vision. We cannot have a vision that amounts to back to \"normal.\" It’s the only reason we got this president, that \"normal\" didn’t work. #DemDebate https://t.co/uGIVdlv2Dq", "date": "2019-07-31 02:33:36"}, "851": {"text": "We must put an end to endless wars and refocus on future threats. #DemDebate https://t.co/BQf9Jtvnc5", "date": "2019-07-31 02:28:56"}, "852": {"text": "If men and women in the military have the courage to serve, members of Congress ought to have to summon the courage to vote on whether they should be there. #DemDebate https://t.co/bY1GpgwJwT", "date": "2019-07-31 02:27:06"}, "853": {"text": "There are people who go through more jobs in a week than my parents went through in their lifetimes. It’s why I propose we allow gig workers to unionize.\n\nThe gig is a job, and a worker is a worker. #DemDebate https://t.co/ChLquuoogC", "date": "2019-07-31 02:12:56"}, "854": {"text": "This is about a moment when the economy is changing before our eyes. #DemDebate https://t.co/0oCgysrMyQ", "date": "2019-07-31 02:08:26"}, "855": {"text": "Pete has a plan to restore fairness in our economy, raise incomes, and ensure that workers have the predictable hours, wages, and support they deserve: https://t.co/92A1sVlkix #DemDebate https://t.co/7KBb0F5TCf", "date": "2019-07-31 02:02:16"}, "856": {"text": "Reminder: a tariff is a tax on American workers. #DemDebate", "date": "2019-07-31 01:55:08"}, "857": {"text": "If we don’t tackle racial injustice, it will upend the American Project in my lifetime. #DemDebate https://t.co/rowXn9CmtL", "date": "2019-07-31 01:48:55"}, "858": {"text": "We need economic empowerment, housing equity, better health, criminal justice reform, and so many other measures, all at once, in order to tackle systemic racism in our lifetime. Read more about the Douglass Plan: https://t.co/R1o8AU7QF5 #DemDebate https://t.co/hpROfUMD1a", "date": "2019-07-31 01:45:17"}, "859": {"text": "Nominate me and we will have a different conversation with American voters. #DemDebate https://t.co/cIJbO3ULEY", "date": "2019-07-31 01:38:59"}, "860": {"text": "It's long overdue to take bold, decisive action on climate change. #DemDebate https://t.co/xlImUy4ym4", "date": "2019-07-31 01:35:32"}, "861": {"text": "It's time to treat climate change like the national emergency it is. I support a Green New Deal — we need bold action to eliminate greenhouse gas emissions while creating new, high-paying jobs. #DemDebate https://t.co/eJJXDJRQ7l", "date": "2019-07-31 01:28:34"}, "862": {"text": "This is a country that once changed its Constitution so you couldn’t drink, and changed it back because we changed our minds. You’re telling me we can’t reform our democracy in our time? We have to, or we will be having the same argument 20 years from now. #DemDebate https://t.co/ELTf8uR4Iq", "date": "2019-07-31 01:20:22"}, "863": {"text": "Our democracy is the most important thing we've got. #CNNDebate https://t.co/o4AbdXlppD", "date": "2019-07-31 01:20:10"}, "864": {"text": "I was a junior when the Columbine shooting happened. I am the first generation to see school shootings. We have produced the second generation. We dare not allow there to be a third. #DemDebate https://t.co/EK2fZDm8du", "date": "2019-07-31 01:14:48"}, "865": {"text": "I was at an event and a 13-year-old asked me what we were going to do about school safety, and then began shaking and crying. We can talk about these policies, but we already know the policies. 90% of Americans want something to happen. Washington can’t do it. #DemDebate https://t.co/UCllPWuMbH", "date": "2019-07-31 01:06:10"}, "866": {"text": "If we embrace a far-left agenda, they’re going to say we’re a bunch of crazy socialists. If we embrace a conservative agenda, they’re going to say we’re a bunch of crazy socialists. So let’s stand up for the right policy, go up there, and defend it. #DemDebate https://t.co/5bkwuC1wLl", "date": "2019-07-31 00:55:19"}, "867": {"text": "If we embrace a far-left agenda, they’re going to say we’re a bunch of crazy socialists. If we embrace a conservative agenda, they’re going to say we’re a bunch of crazy socialists. So let’s stand up for the right policy, go up there, and defend it. #DemDebate https://t.co/vt6RhQ7sQr", "date": "2019-07-31 00:52:54"}, "868": {"text": "If you don’t have health coverage, you’re paying too much for care. If you do have health coverage, you’re paying too much for care. #DemDebate https://t.co/YNjS2l7sky", "date": "2019-07-31 00:36:33"}, "869": {"text": "I’m running for president because our country is running out of time. #DemDebate https://t.co/TKjHGBAglf", "date": "2019-07-31 00:32:17"}, "870": {"text": "We are not going to be able to meet this moment by recycling the same arguments, policies, and politicians that have dominated Washington for as long as I've been alive. #DemDebate https://t.co/GK2z7FdTTt", "date": "2019-07-31 00:29:28"}, "871": {"text": "Getting in the zone. #CNNDebate https://t.co/8f9j9v2mEG", "date": "2019-07-30 23:16:42"}, "872": {"text": "Ready. \n\nTune in tonight at 8 pm ET for the #CNNDebate. https://t.co/Ahkrn8xrsU", "date": "2019-07-30 17:06:57"}, "873": {"text": "RT @CNN: \"I'm not scared of this President,\" Democratic presidential candidate Pete Buttigieg tells @ChrisCuomo.\n\n\"This is a guy who was wo…", "date": "2019-07-30 16:26:19"}, "874": {"text": "Thanks @PatrickMurphyPA for your support for our campaign and for your service to our country. See you here in Detroit! https://t.co/jXHzKx30K4", "date": "2019-07-30 00:32:38"}, "875": {"text": "Last night, Gilroy became the latest community to suffer the tragic consequences of inaction on gun violence. We can't keep pretending that this is normal. Our gun laws are failing to keep our families and our communities safe and must change.\nhttps://t.co/DGH7t6uZHr", "date": "2019-07-29 23:29:04"}, "876": {"text": "RT @VictoryFund: Former Under Secretary of the U.S. Army @PatrickMurphyPA just endorsed @PeteButtigieg! \n\n\"Unlike @realDonaldTrump, who has…", "date": "2019-07-29 21:34:20"}, "877": {"text": "RT @rweingarten: .@PeteButtigieg's plan opens with bargaining rights for for all American workers - including gig economy, fast food worker…", "date": "2019-07-29 19:25:56"}, "878": {"text": "Delighted to see my friend and fellow Navy veteran Adam Hattersley enter the race to represent Florida’s 15th congressional district. https://t.co/jcZLeNpWy2", "date": "2019-07-29 18:29:30"}, "879": {"text": "RT @CNN: Presidential candidate Pete Buttigieg says he is determined to knit together the country's social fabric through a new call to nat…", "date": "2019-07-29 17:15:35"}, "880": {"text": "RT @washingtonpost: How Pete Buttigieg went from war protester to \"packing my bags for Afghanistan\" https://t.co/f87vzseFO3", "date": "2019-07-29 14:10:36"}, "881": {"text": "RT @StopBigMoney: Mayor @PeteButtigieg is committed to tackling #ReformFirst as President. He’s got a plan to overturn Citizens United, cre…", "date": "2019-07-29 14:09:35"}, "882": {"text": "The president’s continuing racist attacks on the American city of Baltimore are part of his project to divide America: white versus black, rural versus urban. A president should serve all Americans. This one is busy weakening our country.", "date": "2019-07-29 12:43:56"}, "883": {"text": "Over 33 million American workers would benefit from making the minimum wage a living wage. It’s time to stop measuring our economic progress by abstract numbers like GDP. In my administration, I will measure our success by your paycheck. https://t.co/0klx1akpLA", "date": "2019-07-27 22:14:45"}, "884": {"text": "RT @SShawFL: I have seen up close the transformation that is possible when Americans walk away from the past and into a new era of possibil…", "date": "2019-07-27 18:56:39"}, "885": {"text": "It is time for American employers to do right by American workers.\n\nText WAGES to 25859 to read my new plan for a changing economy. https://t.co/opCkFZ1TIx", "date": "2019-07-27 01:14:29"}, "886": {"text": "Amen. https://t.co/JkNvmomzBc", "date": "2019-07-26 22:54:20"}, "887": {"text": "Hospital workers are on the front lines of patient care. I stand with the 85,000 @seiu_uhw workers who are organizing for fair wages and better working conditions.", "date": "2019-07-26 22:35:57"}, "888": {"text": "RT @rweingarten: ✅Public Service Freedom to Negotiate Act\n✅Public Safety Employer Employee Cooperation Act\n✅Sick Leave\n✅Paid family leave\n✅…", "date": "2019-07-26 22:24:40"}, "889": {"text": "Tune in now to watch live as Mayor Pete discusses his new policy proposal, 'Empowering Workers in a Changing Economy,' live from Ankeny, IA. https://t.co/APug0yVZVL", "date": "2019-07-26 21:00:07"}, "890": {"text": "RT @MaryKayHenry: .@PeteButtigieg's plan includes multi-employer bargaining, giving workers a seat at the table with big corporations to ho…", "date": "2019-07-26 18:38:32"}, "891": {"text": "RT @Lily_NEA: Unions are the pathway to the middle class. ✊🏾\n\nWorking people need and deserve a voice in the workplace and an economy that…", "date": "2019-07-26 18:28:56"}, "892": {"text": "RT @CNNPolitics: Pete Buttigieg calls out tech companies for failing to recognize worker rights in his new economic proposal.\n\nCNN's Vaness…", "date": "2019-07-26 14:55:15"}, "893": {"text": "Today I'm proud to announce a new plan that will empower all workers, lift wages, and give workers and employers the tools they need to thrive.\n\nOur economy is changing. Our laws and policies should too. \n\nRead my plan, A New Rising Tide Agenda, here: https://t.co/WuoBiMWdy2 https://t.co/EUGmsgMxL3", "date": "2019-07-26 11:44:08"}, "894": {"text": "Happy #NationalInternDay indeed! Thankful for the hard work (and creativity and humor) that all our interns at HQ and across the country bring to this team. https://t.co/V91lirUlmL", "date": "2019-07-26 01:25:01"}, "895": {"text": "@manuel_bonder America is stronger because we are a nation of immigrants. Congratulations to your family from me and everyone on #TeamPete!", "date": "2019-07-25 22:17:08"}, "896": {"text": "Justice is not equally distributed in our country. Too often, race and geography determine who lives and who dies. We should be joining the ranks of modern nations and abolishing the death penalty—not expanding its reach. https://t.co/xYnwORQTAB", "date": "2019-07-25 19:38:01"}, "897": {"text": "@LCJ2077 Just for the record, very grateful for @TSA workers keeping us all safe. But who among us can help making the faces sometimes...", "date": "2019-07-25 03:32:58"}, "898": {"text": "@cincy_4 Nope, you got it right. Not a moment to lose meeting voters wherever they are. Time zones and red-eyes to the rescue!", "date": "2019-07-24 15:49:57"}, "899": {"text": "RT @NAACP: #NAAACPConvention @PeteButtigieg https://t.co/kpM7qBgOic", "date": "2019-07-24 15:28:51"}, "900": {"text": "I'm about to take the stage at the @NAACP's 110th Annual Convention. Tune in! https://t.co/eHuPTukfoP", "date": "2019-07-24 14:19:22"}, "901": {"text": "RT @crookedmedia: NEW #CrookedMinis! @Team_Harbaugh sits down w/ @beckykanis, a veteran &amp; founder of the Billions Institute about the impor…", "date": "2019-07-24 14:01:44"}, "902": {"text": "RT @ServeUSA2gether: .@PeteButtigieg on @crookedmedia’s #ReclaimingPatriotism: “At a moment when our national unity is under such strain an…", "date": "2019-07-24 13:59:02"}, "903": {"text": "Thanks for the amazing welcome and a great event! https://t.co/9HwNYlTVA1", "date": "2019-07-24 03:46:45"}, "904": {"text": "If we’re serious about national security, we’re going need a president prepared to name and confront white nationalist violence. https://t.co/cof5SoCMou", "date": "2019-07-24 01:19:13"}, "905": {"text": "Mike Pompeo's new Commission on Unalienable Rights is led by LGBTQ and women’s rights opponents. He justifies this in the name of religion. Religious liberty is about acceptance and respect. U.S. foreign policy must be based on American values—rooted in all human rights.", "date": "2019-07-23 13:10:17"}, "906": {"text": "@Katelyn_1342 Thanks for joining us (and braving the heat) on Saturday! There are a lot of ways for you to be involved, and we need young folks just like you stepping up and talking to their friends and neighbors! Text IOWA to 25859 for more on how you can help.", "date": "2019-07-22 20:20:30"}, "907": {"text": "It’s time for Governor Rosselló to resign and allow the process of healing to begin. Now more than ever, Puerto Ricans deserve a leader they can trust. The people of Puerto Rico have my full support.", "date": "2019-07-21 00:44:56"}, "908": {"text": "RT @IAStartingLine: Asked about teacher pay in Shenandoah, @PeteButtigieg finished his answer with “We ought to honor our teachers a little…", "date": "2019-07-20 23:24:24"}, "909": {"text": "Tackling the threat of our changing climate likely won’t culminate in a single moment—like planting a flag on the moon. But in 50 years, let's be able to look at this season and say that we achieved an extraordinary feat—that we came together to beat the odds before all was lost.", "date": "2019-07-20 21:48:17"}, "910": {"text": "Climate change is here. It is an existential threat to our way of life on this planet. This timetable isn't being set by D.C. It's set in reality—and the time to act was yesterday. To meet this once-in-a-generation challenge, we must be as bold in our time as Kennedy was in his.", "date": "2019-07-20 21:48:16"}, "911": {"text": "As we stand on the verge of a new American era, it has never been more urgent that we summon that ambition again. From devastating hurricanes in Puerto Rico to raging infernos in California, we face the life-and-death challenge of a changing climate and climate disruption.", "date": "2019-07-20 21:48:16"}, "912": {"text": "50 years ago today, Apollo 11 landed, a module hatch opened, and a man set foot on the moon. The #MoonLanding was a giant leap for humanity made possible by common purpose (and public initiative!) across a nation striving for the most ambitious possible goals.", "date": "2019-07-20 21:48:15"}, "913": {"text": "RT @JasonKander: Appreciate my friend @PeteButtigieg visiting us at @VCP_HQ this week. Pete’s campaign did a short video of the tour: https…", "date": "2019-07-20 14:48:24"}, "914": {"text": "It's deeply disappointing that @GovChrisSununu today turned his back on New Hampshire workers by vetoing a prevailing wage for construction workers. We need an economy where everyone has a role and everyone can succeed—and that includes a living wage. https://t.co/ZDR2r4cLVK", "date": "2019-07-19 22:31:04"}, "915": {"text": "Thanks for having me! See you next week. https://t.co/LN2T8CkRiE", "date": "2019-07-19 20:44:32"}, "916": {"text": "RT @youngdems: #QOTD #YDAIND https://t.co/eUcb01GMaD", "date": "2019-07-19 00:53:00"}, "917": {"text": "To come of age in the 21st century is to see virtually every major prediction and policy advanced by the Republican Party in your adult lifetime fail before your eyes. Nothing they say actually works in the real world. https://t.co/zVK06uw3sz", "date": "2019-07-19 00:02:45"}, "918": {"text": "I'm proud to belong to a generation that is the largest and most diverse ever. We have the power to shape politics for the half-century to come. I'm joining the @youngdems annual convention to talk about just that. Tune in now: https://t.co/DIr6SKiVqv", "date": "2019-07-18 23:15:21"}, "919": {"text": "When the people of Puerto Rico speak, we must listen. I stand in solidarity with the people of #PuertoRico as they continue to demand transparency and accountability. Our fellow U.S. citizens deserve a government they can trust.", "date": "2019-07-18 23:13:32"}, "920": {"text": "@DerrickNAACP @AprilDRyan @NAACP Thanks! I'm looking forward to the conversation.", "date": "2019-07-18 14:30:29"}, "921": {"text": "We can do many things at once. This morning that means standing with @IlhanMN and her colleagues in the face of racist attacks—AND standing with her and @HouseDemocrats to #RaiseTheWage today.", "date": "2019-07-18 14:28:14"}, "922": {"text": "Today, Congress has an opportunity to put people before corporate profits. Americans on both sides of the aisle support a higher minimum wage. No one should work 40 hours in America and live in poverty. It’s time to #RaiseTheWage.", "date": "2019-07-18 14:28:14"}, "923": {"text": "Wage stagnation is not an accident. Republicans have worked alongside their corporate sponsors for decades to keep pay low while increasing profits. And the GOP tax plan only made it worse by giving 83% of its benefits to the top 1% of earners.", "date": "2019-07-18 14:28:14"}, "924": {"text": "The #RaiseTheWage Act would give 40 million American workers a raise (that’s two-thirds of America’s working poor, most of whom are people of color) and lift 18 million children out of poverty. In Iowa alone, 63,000 single parents would get a raise.", "date": "2019-07-18 14:28:13"}, "925": {"text": "This morning, the House will vote on the #RaiseTheWage Act, a bill that would raise the minimum wage to $15 and lift millions of Americans out of poverty. As a mayor from the industrial Midwest, I know a raise in wages is long overdue. The American people agree.", "date": "2019-07-18 14:28:13"}, "926": {"text": "This is a day for doing more than one thing at a time. We must denounce and reject the president’s racist demagoguery—without letting him deny attention to today’s extremely important vote on the minimum wage.", "date": "2019-07-18 14:28:13"}, "927": {"text": "RT @NAACP: JUST IN: @PeteButtigieg will join the Presidential Candidates Forum at the 110th #NAACPConvention on Wednesday, July 24. Submit…", "date": "2019-07-17 22:32:51"}, "928": {"text": "RT @JasonKander: Showed off @VCP_HQ to my friends @PeteButtigieg and @Chas10Buttigieg today. So proud of the team here and the work we do!…", "date": "2019-07-17 22:31:18"}, "929": {"text": "I'm thinking about Wayne Wilson, a veteran and son of Michiana who was laid to rest today. Mr. Wilson bravely served in Vietnam and belongs to a generation of heroes who more than deserve our gratitude and respect. He has no surviving relatives but he has us—and we honor him. https://t.co/1tEeP1KddE", "date": "2019-07-17 22:20:58"}, "930": {"text": "I thought I was one of the last people turning off the lights when I left Afghanistan. That was five years ago, and we’re still arguing about how to get out.\nhttps://t.co/ew7ee4aRfR", "date": "2019-07-17 21:53:12"}, "931": {"text": "RT @votevets: “Those who served in the Afghanistan conflict understand just how hard it is to end a conflict. I thought I was one of the la…", "date": "2019-07-17 20:34:45"}, "932": {"text": "Jesimya is dead because America is the only industrialized country in the world that doesn’t treat health care as a human right. I will fight for a fairer, more just health care system—and I'll do it with Jesy in mind. My condolences are with his family. \nhttps://t.co/eMa5CcZxoi", "date": "2019-07-17 17:21:22"}, "933": {"text": "Mayors are on the front lines of climate change, but we can’t do it alone. Today's testimony from five of my @ClimateMayors colleagues is a call for national government to start catching up to the excellent work happening locally. https://t.co/2RDbk9kR5v", "date": "2019-07-17 17:13:59"}, "934": {"text": "Justice Stevens was a judicial giant, a son of the Midwest who became one of the most influential jurists on the Court. His reverence for the law—and appreciation for how its practice must evolve to strengthen our democracy—inspires us all. My thoughts are with his family. https://t.co/9fmF06Jwhi", "date": "2019-07-17 16:43:19"}, "935": {"text": "RT @fightfor15: Today, Mayor @PeteButtigieg was in Kansas City &amp; took time to meet with @standup_kc workers in the #FightFor15. \n\nAs he sai…", "date": "2019-07-17 11:36:45"}, "936": {"text": "Thank you to IUPAT DC 91 for inviting me to sit down and talk about issues that matter to working families. Today, more than ever, it's important for us to stand up for organized labor and the quality union apprenticeships at the heart of these organizations. https://t.co/RwlPU1NVcT", "date": "2019-07-16 13:28:39"}, "937": {"text": "I've spent years working with South Bend City Clerk @kareemahfowler to build a more transparent and inclusive South Bend, and I'm honored to receive her endorsement at tonight's #SouthBendForPete event! https://t.co/aBMvgiwGGx", "date": "2019-07-16 00:21:17"}, "938": {"text": "Employees of the company run by the richest person on earth should not have to demand safe, reliable, and fair working conditions. Today, @Amazon workers in MN took a stand for fair labor practices, respect, and pathways for promotion for communities of color. I stand with them. https://t.co/2iY47ydrlf", "date": "2019-07-15 23:13:20"}, "939": {"text": "For nearly two decades, we have used military force in too many situations and too often without Congressional approval. I applaud House passage of @RepBarbaraLee's amendment repealing the 2002 AUMF — it's time for Congress to step up to its responsibilities on the powers of war. https://t.co/CsETmkoN0r", "date": "2019-07-15 22:37:35"}, "940": {"text": "Instead of cutting a ribbon, we de-coupled a firehose. The design features of this new station promote sustainability, gender equity, and cancer prevention, making it an example of how local communities can lead the way on these issues. https://t.co/VZS8fzasVJ", "date": "2019-07-15 15:06:55"}, "941": {"text": "RT @voxdotcom: On the latest Recode Decode, Mayor @petebuttigieg talks with @karaswisher about systemic racism against black Americans, reg…", "date": "2019-07-15 13:49:07"}, "942": {"text": "RT @sgrubermiller: Ten Democratic presidential candidates took the stage Sunday afternoon in 90-degree weather to address would-be Iowa cau…", "date": "2019-07-14 23:02:23"}, "943": {"text": "We're not going to win playing his game. We're going to do something completely different — we're going to talk about our values and we're going to talk about your lives. https://t.co/AxwHiT0yMf", "date": "2019-07-14 22:57:49"}, "944": {"text": "Right now the president is mobilizing federal agents to tear families apart in American cities. Don't tell me that they're the party of faith, or family, or freedom - not when they're acting like this in the White House. https://t.co/K59QKRGEKn", "date": "2019-07-14 19:35:27"}, "945": {"text": "The flag I saluted when I was in uniform, the flag to which we pledge allegiance, represents a nation that honors the voices of those who call for justice—and we know this to be among the truer acts of loyalty to the republic for which it stands.", "date": "2019-07-14 18:23:51"}, "946": {"text": "There’s nothing new about denying the belonging of those who call our nation to its highest values and criticize those in power. Those who launch such attacks reveal that they do not understand what is greatest about America.", "date": "2019-07-14 18:23:50"}, "947": {"text": "As an immigrant and a citizen, my dad cared deeply about this country. Once, when he was speaking at a campus protest against Reagan’s accommodation of apartheid, a passing student noticed Dad’s brown skin and unique accent and called out: “go home!” He answered: “I am home.”", "date": "2019-07-14 18:23:50"}, "948": {"text": "Every person in this country has rights—and it’s important that you know yours.\n\nIf you believe you or someone you know could be targeted by today’s #ICEraids, read the resources below and make a plan.\n\nIf you’re an ally, call Congress or join a protest. https://t.co/Q02QNPIPZo", "date": "2019-07-14 15:18:16"}, "949": {"text": "Today, as many gather to hear Sunday messages about our responsibility to welcome the stranger, this president is carrying out ICE raids designed to tear families apart, divide our communities, and further his extreme agenda. #ICEraids will not make us safer—time for real reform.", "date": "2019-07-14 15:18:16"}, "950": {"text": "An auditorium full of high school students, pulling off a giant silent ovation to support a classmate with severe autism, makes me think of what might happen if the American people could summon this level of compassion and cooperation. https://t.co/g7Wod12wXY", "date": "2019-07-14 01:50:11"}, "951": {"text": "RT @davidaxelrod: .@PeteButtigieg on Democrats: “Sometimes we get so caught up in explaining why our policy is better designed than the oth…", "date": "2019-07-13 17:41:06"}, "952": {"text": "“Continue to remember those in prison as if you were together with them in prison, and those who are mistreated as if you yourselves were suffering.” (Heb 13:3) https://t.co/PIkonlOLc7", "date": "2019-07-13 02:29:43"}, "953": {"text": "My condolences are with the family of Héctor Figueroa. As president of America's largest property services union, Héctor worked tirelessly to protect labor rights and further the well-being of his members and workers everywhere. His service benefited us all—and he will be missed. https://t.co/0H9G2urN9z", "date": "2019-07-13 01:59:29"}, "954": {"text": "From abolishing the death penalty to restoring voting rights for those who’ve been incarcerated, we need a more just justice system. https://t.co/VUpcp3dpBh", "date": "2019-07-12 23:25:20"}, "955": {"text": "Until we live in a country where the criminal justice system really delivers justice, all of us are worse off. https://t.co/7Er5rUaMQ2", "date": "2019-07-12 22:37:08"}, "956": {"text": "Let’s clear the way for a Community Health Corps to help people dealing with addiction and mental health challenges. https://t.co/8M3EOp7LSz", "date": "2019-07-12 21:24:55"}, "957": {"text": "America rebuilt Europe after WWII with the Marshall Plan. Now we need that same level of investment right here at home with the Douglass Plan. If we do not tackle systemic racism and racial inequality, it will unravel the entire American project. https://t.co/XViUw5YUnu", "date": "2019-07-12 20:35:42"}, "958": {"text": "Thinking about all those in New Orleans and the Gulf region impacted by flooding and Tropical Storm Barry. Thank you to our first responders and all those serving these communities in this difficult moment. If you need assistance, please contact @fema: https://t.co/yUlcRgR45j", "date": "2019-07-12 17:14:05"}, "959": {"text": "China is oppressing millions of Muslim Uighurs and eroding freedoms in Hong Kong. Meanwhile, this White House is reportedly willing to stay silent and withhold sanctions in exchange for trade concessions. America's commitment to dignity and religious freedom must not be for sale.", "date": "2019-07-12 15:11:26"}, "960": {"text": "RT @DemRedistrict: We applaud @PeteButtigieg for putting forward this proposal which addresses partisan and racial gerrymandering, among ot…", "date": "2019-07-12 13:23:02"}, "961": {"text": "RT @AC360: “It is part of the political process that candidates, especially candidates who are not candidates of color… explain to black au…", "date": "2019-07-12 02:37:56"}, "962": {"text": "RT @AC360: \"It sounds like a face-saving way to recognize that he’s been on the wrong side of the law throughout.\"\n\nPresidential candidate…", "date": "2019-07-12 02:20:02"}, "963": {"text": "RT @AC360: Coming up, @andersoncooper interviews presidential candidate @PeteButtigieg.\n\n#AC360 #CNN \n\nhttps://t.co/tcXOC9LBnI https://t.co…", "date": "2019-07-12 00:26:51"}, "964": {"text": "RT @kmorrisjr: We @DouglassFamily are pleased to learn of Mayor @PeteButtigieg’s #TheDouglassPlan proposal to reform myriad racist US polic…", "date": "2019-07-11 21:42:35"}, "965": {"text": "RT @Essence: .@PeteButtigieg wants the federal government to invest more in the Black community. https://t.co/wNes6ALDjs", "date": "2019-07-11 21:10:55"}, "966": {"text": "RT @willjawando: I'm glad to see @PeteButtigieg release a thoughtful plan, named after the great abolitionist and Marylander Frederick Doug…", "date": "2019-07-11 18:32:04"}, "967": {"text": "RT @AnandWrites: This is a legacy of the #BlackLivesMatter movement: Yet another presidential candidate, a white man from the Midwest in th…", "date": "2019-07-11 17:37:33"}, "968": {"text": "RT @MehrsaBaradaran: I'm really impressed with @PeteButtigieg's Douglass plan released today. It's thoughtful, comprehensive, and rooted in…", "date": "2019-07-11 17:31:33"}, "969": {"text": "RT @Eugene_Scott: Buttigieg's 'Douglass Plan’ includes increasing federal resources by $25 billion for HBCUs &amp; other minority institutions;…", "date": "2019-07-11 17:05:13"}, "970": {"text": "RT @FenitN: Buttigieg includes D.C. statehood in his sweeping racial equity plan, noting it would be the only state where black residents a…", "date": "2019-07-11 15:48:29"}, "971": {"text": "RT @chrisgeidner: There is a whole lot to take in here, an ambitious, wide-ranging plan to address racism, racial disparities, and other ra…", "date": "2019-07-11 15:36:11"}, "972": {"text": "RT @NPR: Pete Buttigieg on his \"Douglass Plan\": \"This is not a gift. This is a restoration. It is trying to address generational harms and…", "date": "2019-07-11 13:55:13"}, "973": {"text": "RT @AP_Politics: In exclusive new interview, @petebuttigieg tells @emarvelous about his new plan to address systemic racism and what his ti…", "date": "2019-07-11 13:39:46"}, "974": {"text": "If we don’t tackle racial injustice in my lifetime, it will upend the American Project in my lifetime. If the Marshall Plan could rebuild Europe, I believe the Douglass Plan could renew America. Text DOUGLASS to 25859 to learn more and join our call for restorative justice.", "date": "2019-07-11 10:34:35"}, "975": {"text": "Named after American hero Frederick Douglass, this plan demands we take aggressive steps toward fulfilling long-broken promises of true equality, including reforming broken systems, strengthening access to credit, and injecting capital into the Black community.", "date": "2019-07-11 10:34:34"}, "976": {"text": "I’m proud to share with you the Douglass Plan, our proposal for comprehensively and intentionally dismantling racist structures and systems, fueled by an investment of unprecedented scale in the freedom and self-determination of Black Americans: https://t.co/J35lpGfAry", "date": "2019-07-11 10:34:34"}, "977": {"text": "By sharing their moving stories, these women demonstrate that all women should have the freedom to make deeply personal decisions about their reproductive health without judgment or political interference. https://t.co/ky4b72sB6W", "date": "2019-07-10 22:17:59"}, "978": {"text": "@USWNT Honoring @USWNT’s victory means amending the Amateur Sports Act and dismantling the monopoly U.S. Soccer has in America. Our government should be in the business of making sure all Americans get equal pay for equal work, not creating monopolies for entities that underpay women.", "date": "2019-07-10 15:16:29"}, "979": {"text": "Congratulations to the @USWNT! You've raised the bar for all athletes and made America proud. You are an example to millions, especially women and girls who see themselves in each of you. #OneNationOneTeam https://t.co/QhaOwUvAnF", "date": "2019-07-10 15:14:27"}, "980": {"text": "Our democracy is on the ballot in 2020—and taking back the Senate is key to restoring it. I’m grateful to @AmyMcGrathKY for her years of service and thrilled to see her candidacy. https://t.co/xQ4XoNG1jY", "date": "2019-07-10 02:05:43"}, "981": {"text": "Republicans are putting health care for over 20 million Americans in jeopardy with their latest attack on the Affordable Care Act. Instead of restricting access, we should be expanding health care with Medicare for All Who Want It.\n\nhttps://t.co/FqYnPEsCBT", "date": "2019-07-10 01:03:43"}, "982": {"text": "We are saddened by the terrible accident that took the life of Officer Wiegand’s young daughter, and the city is holding this family in our hearts. https://t.co/suAIxHNn2W", "date": "2019-07-09 00:24:42"}, "983": {"text": "RT @ServeUSA2gether: .@PeteButtigieg just became the first presidential candidate to accept the #ServeAmericaTogether presidential challeng…", "date": "2019-07-08 23:42:30"}, "984": {"text": "You’re not free if you can be kicked out of school or lose your job if somebody says your hair is a distraction. Hair discrimination is racial discrimination. #essencefest https://t.co/Qf54GiriZF", "date": "2019-07-08 02:06:15"}, "985": {"text": "Freedom comes from economic empowerment. And when women of color account for nearly half of all women-owned businesses—over $386 billion in annual revenue—that means lifting up Black women not just with our words, but with our dollars. #essencefest https://t.co/MVucxftpAD", "date": "2019-07-07 22:22:52"}, "986": {"text": "Black women aren’t just the backbone of the Democratic Party, they are the bone and sinew that make our democracy whole. When Black women mobilize, outcomes change. #essencefest https://t.co/p3k5ZVpCbI", "date": "2019-07-07 21:09:46"}, "987": {"text": "RT @Essence: “We have seen time and time again, especially in the last couple elections, that when Black women mobilize, outcomes change, a…", "date": "2019-07-07 20:28:38"}, "988": {"text": "Congratulations to the @USWNT on a record-breaking FOURTH world championship. You’re inspiring millions, including the next generation of champions, who should not have to fight for equal pay. #OneNationOneTeam https://t.co/6x87N3wfNp", "date": "2019-07-07 19:57:55"}, "989": {"text": "USA!", "date": "2019-07-07 17:22:21"}, "990": {"text": "Everyone at Pete for America is cheering on the @USWNT as they try for their fourth championship. Their talent, grit, and energy have already inspired millions. Go Team USA!", "date": "2019-07-07 15:21:03"}, "991": {"text": "My thoughts are with all those affected by this week’s earthquakes in Southern California and throughout the region. Thankful to our first responders and appreciative of those stepping up to serve their communities in this time of need.", "date": "2019-07-07 02:08:48"}, "992": {"text": "RT @essencefest: Top Democratic contenders in the 2020 Presidential race are coming to #EssenceFest! @CoryBooker, @PeteButtigieg, @KamalaHa…", "date": "2019-07-06 18:00:47"}, "993": {"text": "I’m saddened to hear that Miss Major has suffered a stroke. She was at Stonewall on June 28, 1969, and she's been on the frontlines of the fight for trans equality ever since. She says she wants to “care for all people.” Join me in helping to care for her: https://t.co/hWvZeQIwJt", "date": "2019-07-06 01:46:29"}, "994": {"text": "Today in 1852, Frederick Douglass delivered an Independence Day message of hope and truth. May his words remind us of our past—and call on each of us to build a country in which justice, liberty, prosperity, and independence are extended to all. \n\nhttps://t.co/CmZLGNCidY", "date": "2019-07-05 23:05:20"}, "995": {"text": "Thrilled to be with Storm Lake this morning celebrating Independence Day. Thanks for the warm welcome. Happy Fourth of July! https://t.co/3htJxqdEim", "date": "2019-07-04 18:22:16"}, "996": {"text": "A new generation of American youth, bound by mutual service and sacrifice, aware of the common values that bind all Americans, and imbued with an appreciation of the effort required to maintain a democracy can help heal a divided nation. https://t.co/xaxoDKOVfh", "date": "2019-07-04 01:10:46"}, "997": {"text": "Creating new pathways to serve will bridge divides and drive solutions, allowing Americans from different backgrounds to form new connections while tackling our biggest challenges. https://t.co/FQnXHLBFe4", "date": "2019-07-04 01:04:23"}, "998": {"text": "A \"New Call to Service\" is a bold plan to dramatically increase pathways to service for all Americans. That’s why it calls for competitive grant funding to allow America's towns, cities, and regions to create opportunities tailored to meet the challenges facing local communities. https://t.co/WwxWlNHAG7", "date": "2019-07-04 01:02:07"}, "999": {"text": "The greatest lesson I learned while overseas in Afghanistan was learning to put my faith in people completely different from me. It was a life-changing experience–one I wish more Americans had. I don’t believe you should have to go to war in order to have that kind of experience. https://t.co/gBBiM2jkBl", "date": "2019-07-04 00:58:51"}, "1000": {"text": "A great unwinding of American civic society is underway. Trust in our institutions and our fellow citizens is reaching record-lows. We need bold plans to renew our democracy. That’s why we're proposing \"A New Call to Service,\" a plan to expand service opportunities in three ways. https://t.co/ZE3SHuAiH6", "date": "2019-07-04 00:50:44"}, "1001": {"text": "I am proposing \"A New Call to Service,\" a plan to dramatically expand service opportunities across the country. By shaping a new generation bonded by the experience of serving, it will not only deliver good work but also help repair the social fabric in our nation. https://t.co/s3LsOwlz94", "date": "2019-07-04 00:33:48"}, "1002": {"text": "Tune in at 6 pm ET to watch live as Mayor Pete discusses his new policy proposal, \"A New Call to Service,\" live from Sioux City.  https://t.co/7C6p0SzThm", "date": "2019-07-03 21:58:47"}, "1003": {"text": "'A New Call to Service' will dramatically expand service opportunities across the country — it will not only deliver good work, but will also help repair our nation. Watch and learn more: https://t.co/ufzLAOPaLC https://t.co/KbIcXxGgmE", "date": "2019-07-03 21:28:51"}, "1004": {"text": "RT @SusanReichle: Now this is a big bold initiative for today’s challenges of climate change &amp; mental health that can succeed b/c young ppl…", "date": "2019-07-03 20:40:35"}, "1005": {"text": "I'm outraged by these photos — all Americans should be. Children without access to showers, sleeping on concrete floors. 51 women in a juvenile cell built for 40. 88 men in a cell built for 41. What’s being done to them is being done in our name and with our money. #CloseTheCamps https://t.co/0MZYHezJz6", "date": "2019-07-03 17:56:13"}, "1006": {"text": "RT @bcrodriguez: NEW: @PeteButtigieg will announce a national service policy during his latest trip to Iowa, one that he said is aimed at c…", "date": "2019-07-03 16:59:07"}, "1007": {"text": "RT @nytpolitics: Pete Buttigieg proposed a major expansion of voluntary national service programs that aims to attract 250,000 Americans in…", "date": "2019-07-03 16:57:53"}, "1008": {"text": "RT @myunglee: Thank you, @PeteButtigieg for this call to #service. It is an honor to have @CitiesOfService model referenced in your #PeteFo…", "date": "2019-07-03 16:55:10"}, "1009": {"text": "RT @billshore: So inspired by @PeteButtigieg policy proposal for national service - awesome opportunity to bring our country together and g…", "date": "2019-07-03 16:33:50"}, "1010": {"text": "RT @AnnMaura: Great to see that Mayor @PeteButtigieg has released a plan to dramatically expand national service opportunities like @AmeriC…", "date": "2019-07-03 15:10:34"}, "1011": {"text": "RT @jacobmlevy: .@PeteButtigieg Iowa Fellows are giving 10% of our campaign hours, every week, to community service.\n\nPete's lived a life o…", "date": "2019-07-03 14:42:49"}, "1012": {"text": "I am proposing A New Call to Service—a plan to dramatically expand service opportunities across the country. Shaping a new generation bonded by the experience of serving will not only deliver good work, but also help repair the social fabric in our nation. https://t.co/Sw2r5VqhZN", "date": "2019-07-03 14:36:03"}, "1013": {"text": ".@LilNasX has gone from viral sensation to groundbreaking musician. As a fan, I’m thrilled and inspired to see him standing in his truth as a member of the LGBTQ community. Welcome to the family! #pride https://t.co/H81iXxCII6", "date": "2019-07-03 01:06:38"}, "1014": {"text": "The Civil Rights Act of 1964 was a major step toward equality for all under the law, but there is still a long road ahead. Let us celebrate its 55th anniversary by working anew to dismantle all forms of structural racism and make the promise of equality real for every American. https://t.co/zPXcqjd4eL", "date": "2019-07-02 20:56:34"}, "1015": {"text": "Thank you to the over 400,000 of you who have invested in this campaign, and who helped us raise over $24,800,000 this quarter alone. You inspire us every step of the way, and we're just getting started. Text SHOWUP to 25859 to keep the momentum going! https://t.co/g1SIlgt4Eo", "date": "2019-07-01 09:48:25"}, "1016": {"text": "#Pride celebrates a movement that traces back to the courage of trans women of color 50 years ago this weekend. Brooklyn Lindsey is the 11th Black trans woman murdered this year, and her death is a stark reminder that our work is far from over. https://t.co/Wv2QIPGT7V", "date": "2019-06-30 23:31:41"}, "1017": {"text": "At the G20 this week @realDonaldTrump once again abdicated leadership on the climate crisis. Climate change is real and we’re feeling the impacts now — America needs to lead if we’re going to deliver real global climate solutions. https://t.co/WEZNdA6d69", "date": "2019-06-30 14:05:08"}, "1018": {"text": "RT @harrisonjaime: 1 month ago, I launched this campaign from my childhood home.🏡\n\nSince then, y’all stepped *up* and we launched a movemen…", "date": "2019-06-30 14:04:10"}, "1019": {"text": "Absolutely. \n\nWe need a nationwide licensing and registration system, but that's not nearly enough. We must implement universal background checks, ban military-style assault weapons and high-capacity magazines, and hold the gun industry accountable. https://t.co/Dom53gRZ2w", "date": "2019-06-29 23:10:36"}, "1020": {"text": "The presidential competitive field is stronger because Kamala Harris has been powerfully voicing her Black American experience. Her first-generation story embodies the American dream. It’s long past time to end these racist, birther-style attacks. https://t.co/x5Wdx8DKr8", "date": "2019-06-29 22:30:19"}, "1021": {"text": "Today’s faith-led Peace Walk was a reminder of our shared commitment across South Bend to ending violence and delivering a future where everyone is safe. https://t.co/WLDFgBxPRm", "date": "2019-06-29 18:56:52"}, "1022": {"text": "I'm honored to have your support. My candidacy is possible only because of the hard work and sacrifice of LGBTQ activists who stood up for change 50 years ago today, and the leaders who continue that fight for equality at organizations like @VictoryFund. #Stonewall50 https://t.co/rXivvf0Alh", "date": "2019-06-29 00:33:33"}, "1023": {"text": "RT @ACLU: In South Carolina, our volunteer Kadedra asked @petebuttigieg if he would commit to cutting the federal prison population by 50%.…", "date": "2019-06-28 19:56:40"}, "1024": {"text": "RT @CAPAction: \"As somebody who trained on weapons of war, I can tell you, there are weapons that have absolutely no place in American citi…", "date": "2019-06-28 16:50:23"}, "1025": {"text": "@DoitallChris Thanks for stepping up. We need diverse, talented, committed applicants and officers. I’ll be rooting for you!", "date": "2019-06-28 12:27:07"}, "1026": {"text": "RT @ABC: Buttigieg: \"For a party that associates itself with Christianity to say it is okay to suggest that God would smile on the division…", "date": "2019-06-28 04:36:31"}, "1027": {"text": "RT @business: \"We should call out hypocrisy when we see it.\" \n\n@PeteButtigieg speaks out against the GOP, saying the party likes to \"cloak…", "date": "2019-06-28 04:28:34"}, "1028": {"text": "I just got off stage from the first #DemDebate—I hope I made you proud. What is at stake right now is not just the next four years, not just the outcome of one election, but the shape of a new American era. If you can, please consider donating tonight:\n\nhttps://t.co/AwJTQfYO3W https://t.co/7iaj96ZHus", "date": "2019-06-28 04:03:54"}, "1029": {"text": "Text DEBATE to 25859 right now to be a part of the team that will win the era.", "date": "2019-06-28 03:41:25"}, "1030": {"text": "Let’s write a new American chapter. https://t.co/dPkZRlfqoV", "date": "2019-06-28 03:34:37"}, "1031": {"text": "If more guns made us safer, we'd be the safest country on earth. #DemDebate https://t.co/cB0xQLdj85", "date": "2019-06-28 03:18:17"}, "1032": {"text": "We have no idea which of our most important allies @realDonaldTrump will have pissed off worse between now and when he leaves office. #DemDebate https://t.co/vybFjqcBbY", "date": "2019-06-28 03:14:19"}, "1033": {"text": "I want to be able to look back on these years and say, my generation delivered climate solutions, racial equality, and an end to endless war. Help me deliver that new generation to Washington before it's too late. #DemDebate https://t.co/OrY46CJ5xo", "date": "2019-06-28 03:10:54"}, "1034": {"text": "Grantham, NH; Arlington, VA; San Gabriel Valley, CA; Portland, OR https://t.co/b5NM2HThyo", "date": "2019-06-28 02:52:57"}, "1035": {"text": "Climate change isn't theoretical. Parts of California are on fire, in Florida they're talking about sea level rise. In South Bend I had to activate the emergency operation center twice in two years: the first time was a 1000-year flood, the next was a 500-year flood. #DemDebate https://t.co/xx7SFoImuv", "date": "2019-06-28 02:47:40"}, "1036": {"text": "#DemDebate https://t.co/3Ptv2lIpSR", "date": "2019-06-28 02:46:27"}, "1037": {"text": "We have to fix our democracy before it’s too late. If we get that right, climate, immigration, taxes - everything gets better. #DemDebate https://t.co/M87uGip6BQ", "date": "2019-06-28 02:42:27"}, "1038": {"text": "RT @CHunschofsky: 2020 presents a real opportunity for our nation to elect a leader who will run toward, not away from, the toughest challe…", "date": "2019-06-28 02:38:09"}, "1039": {"text": "If you believe in the bold vision you're hearing tonight, please consider making a contribution right now:\n\nhttps://t.co/rENi45wAdg #DemDebate", "date": "2019-06-28 02:34:08"}, "1040": {"text": "If you’re with me, text CLIMATE to 25859 to join our fight to combat climate change and climate disruption, protect our communities, and #WinTheEra. https://t.co/5jPvAkPWPc", "date": "2019-06-28 02:26:10"}, "1041": {"text": "Freedom means being able to make decisions about your reproductive health based on what’s right for you. #DemDebate https://t.co/JmFtPGP5Qy", "date": "2019-06-28 02:23:08"}, "1042": {"text": "Tariffs are taxes, and Americans are going to pay on average $800 more a year because of these tariffs. #DemDebate https://t.co/rR9zzjXtAe", "date": "2019-06-28 02:22:06"}, "1043": {"text": "For a party that associates itself with Christianity to say it is okay to suggest that God would smile on the division of families at the hands of federal agents, that God would condone putting children in cages, has lost all claim to ever use religious language. #DemDebate https://t.co/YfjQKOTm2J", "date": "2019-06-28 02:18:53"}, "1044": {"text": "We do ourselves no favors by having 11 million undocumented people in our country unable to access health care, but of course the real problem is we shouldn't have 11 million undocumented people with no pathway to citizenship. #DemDebate https://t.co/fcZCRMdJH8", "date": "2019-06-28 02:17:28"}, "1045": {"text": "https://t.co/RGTtvoTdxE", "date": "2019-06-28 02:00:47"}, "1046": {"text": "The American people want a pathway to citizenship. They want protections for DREAMers. https://t.co/IOW9AutbuF", "date": "2019-06-28 01:52:08"}, "1047": {"text": "Freedom means not having to choose between health care and financial survival. https://t.co/DSwk9TohlD", "date": "2019-06-28 01:47:41"}, "1048": {"text": "It needs to be more affordable in this country to go to college. It also needs to be more affordable in this country to not go to college. https://t.co/UyqXZZbDX1", "date": "2019-06-28 01:45:30"}, "1049": {"text": "https://t.co/q96Rcae9zx", "date": "2019-06-28 01:36:27"}, "1050": {"text": "Let’s make a medicare-type public option available on the exchange and invite people to buy into it. If corporate insurers don’t lower costs to deliver something better than what is available today, competition will create the glide path toward Medicare for All. #DemDebate https://t.co/5gIvWdozBh", "date": "2019-06-28 01:28:07"}, "1051": {"text": "https://t.co/u4CjkmrK68", "date": "2019-06-28 01:24:56"}, "1052": {"text": "Lincoln, NE; Merrimack, NH; and Mesa, AZ #TeamPete https://t.co/guubvdZGyL", "date": "2019-06-28 01:04:11"}, "1053": {"text": "Big hello to Tempe, AZ' Iowa City, IA; and Neenah, WI! #TeamPete https://t.co/IF9ZtkY0YC", "date": "2019-06-28 01:04:07"}, "1054": {"text": "Thousands of people from across America signed up to host watch parties tonight. These grassroots supporters are the backbone of our campaign and we couldn't do it without them.", "date": "2019-06-28 01:04:05"}, "1055": {"text": "It's time for a new generation of American leadership. Tonight I'll share my vision for how we'll win the era. I hope you'll tune in to the #DemDebate at 9 pm ET. https://t.co/WJuc1np6wo", "date": "2019-06-28 00:18:57"}, "1056": {"text": "I've got your back, and I hope you've got mine. \n\nTune into #DemDebate tonight at 9 pm ET on @NBCNews, @MSNBC, and @TelemundoNews. https://t.co/ebVdUS4AJT", "date": "2019-06-27 23:07:52"}, "1057": {"text": "The Supreme Court stopped this Administration from adding a citizenship question to the census, which would have resulted in the undercounting of millions of people. This is a victory, but the fight for the most accurate count possible goes on. https://t.co/eFUlmW4SYr", "date": "2019-06-27 22:13:10"}, "1058": {"text": "A child fleeing violence should have nothing to fear from the greatest country in the world. We have to fix this. https://t.co/x49JiCxLAZ", "date": "2019-06-26 23:07:43"}, "1059": {"text": "From employment and housing discrimination to adoption services to hate-crime legislation, the battle for equality is not over. But today is the anniversary of three important civil rights victories, and it’s important to acknowledge just how far we’ve come.", "date": "2019-06-26 19:42:48"}, "1060": {"text": "It wasn’t until June 26, 2015 that nine men and women sat down in a room and took a vote and brought me one of the most important freedoms in my life — the right to spend my life married to @Chas10Buttigieg.", "date": "2019-06-26 19:40:09"}, "1061": {"text": "Ten years to the day later, the Supreme Court struck down the Defense of Marriage Act and declared that the federal government couldn’t restrict the right to marriage based on gender. Another important step, but it was still an incomplete victory.", "date": "2019-06-26 19:37:26"}, "1062": {"text": "On this day in 2003, the Supreme Court reaffirmed one of the most important rights in America: the right to privacy, especially in our most intimate spaces. Lawrence v. Texas changed the lives of millions, but it was only a single step.", "date": "2019-06-26 19:35:53"}, "1063": {"text": "When the Supreme Court gutted the Voting Rights Act, they opened up a wave of voter suppression unseen since Jim Crow. On the 6th anniversary of Shelby v. Holder, let's recommit to one-person, one-vote for everyone, regardless of race.", "date": "2019-06-26 01:23:18"}, "1064": {"text": "Appreciate city personnel addressing storm damage and traffic control after this evening’s tornado and thankful that as of now no injuries have been reported. https://t.co/dr677cQVyD", "date": "2019-06-24 03:17:09"}, "1065": {"text": "We’ve got a lot to talk about as a city. I hope community members will join us at at Washington High School for the town hall beginning shortly.", "date": "2019-06-23 19:23:54"}, "1066": {"text": "Happy Birthday to @Chas10Buttigieg who makes every day a better one. https://t.co/Oc6OshqUFE", "date": "2019-06-23 11:40:02"}, "1067": {"text": "The #TitleX “gag rule” flies in the face of freedom. This decision threatens health care for millions, especially low-income Americans who depend on this funding for preventive services, primary care, and treatment. We need comprehensive, unbiased care. We must #ProtectX.", "date": "2019-06-21 02:42:26"}, "1068": {"text": "Refugees are looking for opportunity, not a hand out. It's time to change the conversation around refugees. A former Sudanese refugee turned entrepreneur founded @734coffee to be that change and give back to those left behind. Let’s follow his example this #WorldRefugeeDay. https://t.co/GLlbKGGPev", "date": "2019-06-21 01:42:52"}, "1069": {"text": "Our city is hurting. But as we act on our shared commitment to justice and safety, together we will find healing. https://t.co/rZxartVOD7", "date": "2019-06-20 13:25:33"}, "1070": {"text": "We must remember those lost at the Emanuel AME Church, but we must also recommit ourselves to policies to end the scourge of white supremacist terrorism. Each of us is responsible for helping our country along the path towards justice, equality, and compassion. #Emanuel9", "date": "2019-06-17 23:08:09"}, "1071": {"text": "RT @Chas10Buttigieg: Missing one and holding the other close today. Beyond grateful for everything you’ve given us. Happy Father’s Day, dad…", "date": "2019-06-16 23:37:49"}, "1072": {"text": "“Tell him to be alone often and get at himself\nand above all tell himself no lies about himself...”\n\nHappy Father’s Day from one grateful son. \n\nhttps://t.co/YhN8sjPtQK", "date": "2019-06-16 21:12:35"}, "1073": {"text": "This thread says it all. Seven years ago, DACA allowed many undocumented immigrants to participate more fully in American life. We need to go further and create for them, and the other undocumented immigrants living here, a path to citizenship. https://t.co/YhA8BWHlZA", "date": "2019-06-16 20:12:12"}, "1074": {"text": "My Justice Department will be empowered to reach its own conclusions. Two things are true and clear. One, nobody is above the law. And two, the prosecutorial process should have nothing to do with politics. https://t.co/Vxd1BQ2jAs", "date": "2019-06-16 16:51:09"}, "1075": {"text": "If you think there's a foreign effort to tamper with an American election, and you're an American who cares about America, you call the FBI. This shouldn't be hard. https://t.co/RjV7piB7Xk", "date": "2019-06-16 16:22:17"}, "1076": {"text": "RT @latinovictoryus: On this day in 2012, President Obama announced the DACA program and changed the lives of over 800,000 immigrant youth.…", "date": "2019-06-16 15:25:21"}, "1077": {"text": "RT @MeetThePress: When asked what he would do if somebody offered him campaign dirt on an opponent, @petebuttigieg says “you wouldn’t do an…", "date": "2019-06-16 14:31:52"}, "1078": {"text": "One year ago I married the love of my life. I’m so thankful I found you, Chasten, and can’t wait to spend the rest of our life together. https://t.co/lE1Pzw4CHg", "date": "2019-06-16 12:15:53"}, "1079": {"text": "RT @BET: Mayor and Democratic presidential candidate, Pete Buttigieg will be taking the stage at the Black Economic Alliance Presidential F…", "date": "2019-06-16 00:41:03"}, "1080": {"text": "From Mason City to Davenport and Des Moines to Cedar Rapids, Iowans sure know how to make a candidate feel like home. Thanks and see you soon. https://t.co/w4QFjNn61r", "date": "2019-06-15 23:37:01"}, "1081": {"text": "Wages have not kept up with the costs of health care, housing, and education. We need to raise the minimum wage to $15 and rebuild union membership for an economy where all workers can thrive. #Fightfor15 https://t.co/OjhPATjqSl", "date": "2019-06-15 18:50:52"}, "1082": {"text": "After flipping 15 seats last election, Democrats are two seats away in each chamber from control of the legislature. No more treating the presidency like it’s the only office that matters.\n \nhttps://t.co/I0jHwlsUkG", "date": "2019-06-14 20:52:51"}, "1083": {"text": "I'm in Virginia meeting with supporters this weekend, and there's no better time to bring attention to the need to #FlipVABlue this November.", "date": "2019-06-14 20:52:51"}, "1084": {"text": "I support the downtown Detroit workers who are standing up for union rights so they can have a voice in the workplace and a seat at the table. #OneDetroit #FightFor15 https://t.co/v14prpRW7c", "date": "2019-06-14 19:17:59"}, "1085": {"text": "Admire the honor and courage of @JasonKander publicly sharing his story of dealing with PTSD. Lives are saved when we break the silence around mental health. https://t.co/NStXd7Q9Qh", "date": "2019-06-14 12:02:47"}, "1086": {"text": "RT @NBCNightlyNews: TONIGHT on @NBCNightlyNews: Pete Buttigieg pitches his #BigIdea.\n\nIt's the next installment in \"My Big Idea,\" a series…", "date": "2019-06-13 20:18:47"}, "1087": {"text": "RT @RTDNEWS: State Sen. Adam Ebbin and Del. Mark Keam endorse Pete Buttigieg for president ahead of the South Bend mayor's appearance Satur…", "date": "2019-06-13 19:15:37"}, "1088": {"text": "It doesn’t matter how you get there… https://t.co/fT957BufCm", "date": "2019-06-13 16:33:20"}, "1089": {"text": "At least one out of every three people living on tribal lands lacks high-speed internet, cutting them off from the modern world — any infrastructure plan must include indigenous voices and needs.\nhttps://t.co/uaGdnqA5GM", "date": "2019-06-13 14:12:29"}, "1090": {"text": "Change will not just happen. We need Congress to deliver on common-sense gun laws supported by an American majority, like universal background checks and a ban on military-style assault weapons. And we need every state to pass a hate crimes law.", "date": "2019-06-12 20:56:29"}, "1091": {"text": "Today we honor those lost at #Pulse. It wasn’t an attack on just one community–it was an attack on LGBTQ Americans, Latinx Americans, and Black Americans. It was an attack on people who look like me, and an attack on people who look nothing like me. It was an attack on all of us.", "date": "2019-06-12 20:56:29"}, "1092": {"text": "It was moving to witness part of today’s march as clergy from @RevDrBarber to Rabbi @JonahPesner to the @SistersOfMercy, surrounded by lay people also motivated by faith and values, gathered against this Administration’s repeated attacks on the vulnerable. https://t.co/NgrMTcho8z", "date": "2019-06-12 18:55:26"}, "1093": {"text": "President Trump and this Administration have stripped rights from the vulnerable, attacked the poor, and hurt our immigrant communities. The @RevDrBarber has assembled an interfaith coalition of leaders who are demanding a change.", "date": "2019-06-12 18:54:10"}, "1094": {"text": "An important thing happened today in Washington as #MoralWitnessWednesday and @Brepairers bore witness to the call of various faith traditions to speak out against injustice, to “rescue victims from their exploiters.” https://t.co/ORQBDOgQxk", "date": "2019-06-12 18:51:40"}, "1095": {"text": "RT @RaphaelWarnock: Good conversation yesterday with #MayorPete #Buttigieg on #CriminalJusticeReform, #votingrights, #workforcedevelopment.…", "date": "2019-06-12 17:58:40"}, "1096": {"text": "RT @BRepairers: As extremist leaders driven by the idols of racism, greed and power continue to break the covenant, faith leaders are march…", "date": "2019-06-12 15:47:08"}, "1097": {"text": "Replacing racist policies with neutral ones will not deliver equality. Instead, we must actively work to reverse the persistent inequalities that have compounded over hundreds of years. They hold back our economy and corrode the American soul.\n\nhttps://t.co/1N5ASD2IHK", "date": "2019-06-12 15:29:35"}, "1098": {"text": "The world needs an America free from entrapment in endless war and prepared to focus on future threats. https://t.co/yTnZ1qlrPV", "date": "2019-06-11 18:30:44"}, "1099": {"text": "The world needs America to lead on climate. https://t.co/QWfnMZzW70", "date": "2019-06-11 17:54:12"}, "1100": {"text": "https://t.co/nEGLQh6U5g", "date": "2019-06-11 16:54:26"}, "1101": {"text": "We must put an end to endless war and refocus on future threats. We must promote American values by working to reverse the rise of authoritarianism abroad. We must treat climate change as the existential security challenge it is. https://t.co/WZzwjfwUUv", "date": "2019-06-11 16:47:25"}, "1102": {"text": "https://t.co/TX8wsD6rso", "date": "2019-06-11 16:11:03"}, "1103": {"text": "https://t.co/wJOBhkJCZD", "date": "2019-06-11 15:49:16"}, "1104": {"text": "Join us live from Bloomington, Indiana for a discussion on national security for a new era: https://t.co/TBXW0xnTq5", "date": "2019-06-11 15:05:21"}, "1105": {"text": "Inspiring to see so many in Hong Kong marching peacefully this weekend. We must continue America’s commitment to Hong Kong’s openness, democratic values, and judicial independence.", "date": "2019-06-10 18:38:38"}, "1106": {"text": "Thanks to everyone who turned out for our picnic in Cedar Rapids before the @iowademocrats Hall of Fame dinner. https://t.co/etFupXmFR7", "date": "2019-06-10 01:14:12"}, "1107": {"text": "Suppressing intelligence on a major threat won’t make it go away. Climate disruption is the mounting global security crisis of our time, and history will judge how we rise to meet this challenge. https://t.co/hljPnoegLx", "date": "2019-06-09 18:45:37"}, "1108": {"text": "RT @Chas10Buttigieg: My heart fell to the pit of my stomach when I clicked the hashtag and found panic instead of pride. Whether there was…", "date": "2019-06-09 02:28:42"}, "1109": {"text": "Ten years ago, Varnum v. Brien made Iowa only the third state to legalize marriage equality. Watching today's vow renewals and anniversary celebrations reminds us that love is love. https://t.co/fuuQb9JChX", "date": "2019-06-08 23:22:04"}, "1110": {"text": "Thousands of patients in Iowa are struggling thanks to a limited medical marijuana program that doesn’t meet their health care needs — the governor’s veto will only prolong their suffering.\nhttps://t.co/jUN52FjldW", "date": "2019-06-08 21:31:10"}, "1111": {"text": "Our campaign is guided by a set of values: respect, belonging, truth, teamwork, boldness, responsibility, substance, discipline, excellence, and joy. Will you commit to these values, too?\n\nhttps://t.co/W7XAukg3sx", "date": "2019-06-08 16:45:52"}, "1112": {"text": "Matthew Shepard's death forced America to confront deadly homophobia. Lifting up the next generation of LGBTQ leaders is a tribute to his life and legacy. It was an honor to participate in last night's presentation of Iowa's Matthew Shepard Scholarships. https://t.co/SUCp2iLbmj", "date": "2019-06-08 15:22:49"}, "1113": {"text": "Returning to Iowa always feels like coming home. If you're free this weekend, check out our list of events and join us on the campaign trail: https://t.co/joyiHpbMRm https://t.co/9ScbeOli4i", "date": "2019-06-08 01:43:49"}, "1114": {"text": "Historically Black Colleges and Universities account for 80% of Black judges, 50% of Black lawyers, and 25% of Black STEM degrees — they deserve more dedicated financial support.\n\nhttps://t.co/GsC7lvPFnz", "date": "2019-06-07 20:51:45"}, "1115": {"text": "Just one week after performing at Obama's inauguration in 2013, Hadiya Pendleton was killed just blocks from her school. She was 15. Today we #WearOrange to honor her and all victims of gun violence, and show unity around the insistence that this cannot remain our reality. https://t.co/jpKZzW2V7x", "date": "2019-06-07 19:45:38"}, "1116": {"text": "RT @mwilsonGA: We’ve got an amazing field of Democratic candidates, but I find @PeteButtigieg particularly inspiring and uniquely qualified…", "date": "2019-06-07 18:22:58"}, "1117": {"text": "When young black mothers are three times more likely to die in childbirth as white mothers, when diabetes and prostate cancer are more likely to go undiagnosed and to harm people in the black community, we know that freedom is being impaired because of racism in this country. https://t.co/KqaoHXgwPo", "date": "2019-06-07 00:29:15"}, "1118": {"text": "Less than two generations ago, Rev. Martin Luther King Jr. implored America from this pulpit to live up to its values. I appreciate Ebenezer Baptist Church's Rev. @RaphaelWarnock taking the time to show me such an important piece of our history. https://t.co/HA7AFMwgFk", "date": "2019-06-06 23:47:45"}, "1119": {"text": "RT @AmirForATL: As Democrats, we are lucky to have such a strong field running for President. But I believe @PeteButtigieg is uniquely qual…", "date": "2019-06-06 23:37:12"}, "1120": {"text": "Thanks to @SHODesusAndMero for having me. Tune in tonight at 11:00 pm ET on @Showtime. https://t.co/JITrBpL0io", "date": "2019-06-06 21:24:20"}, "1121": {"text": "75 years ago, more than 156,000 Allied soldiers landed on Normandy Beach, including 73,000 Americans. It was their bravery that helped turn the tide against Nazism and Fascism abroad. To honor their heroism, let us continue to stand for freedom and democracy, abroad and at home.", "date": "2019-06-06 16:21:11"}, "1122": {"text": "Proud of our South Bend Youth Task Force members. Five years of @SBYTF students have helped give youth a voice in our community. https://t.co/qwiQDq78xB", "date": "2019-06-06 00:33:51"}, "1123": {"text": "RT @mark_bode: From firefighter graduation to Future of Work, the Mayor’s Office is on the move this morning! https://t.co/sUoalr8wjA", "date": "2019-06-05 15:28:27"}, "1124": {"text": "Dozens of children, already traumatized by forced separation, were left in vans for two nights during this Administration’s botched family reunifications — the cruelty and incompetence on display here is unconscionable.\n\nhttps://t.co/6tPJC3svbe", "date": "2019-06-05 01:21:05"}, "1125": {"text": "Today we honor those who sacrificed their lives and livelihoods for freedom and democracy in Tiananmen Square. And for those still fighting, from the Uighurs of Xinjiang to China’s courageous activists, publishers, lawyers, students, and feminists: We see you. We're with you.", "date": "2019-06-05 00:26:18"}, "1126": {"text": "RT @nowthisnews: In our new series '20 Questions for 2020,' we talk to the candidates to find out who they are, why they’re running, &amp; wher…", "date": "2019-06-04 18:38:38"}, "1127": {"text": "When politicians are allowed to pick their constituents, they too often place themselves beyond accountability — that's why I'm joining @EricHolder and taking @demredistrict’s pledge to support fair districts and end manipulation.", "date": "2019-06-04 13:37:11"}, "1128": {"text": "#EidMubarak to all those celebrating — may you and your families rejoice on this Eid al-Fitr.", "date": "2019-06-04 02:38:12"}, "1129": {"text": "We are living in racist systems today. And that's why in entrepreneurship, in homeownership, in health, in education, of course in criminal justice -- that we have to systematically reverse that. https://t.co/9Q7K6e1STs", "date": "2019-06-04 02:01:40"}, "1130": {"text": "By the way, a tariff is a tax. So if you ever believe the Republicans don't raise taxes, that's what they're doing right now. https://t.co/VtGHRaT64P", "date": "2019-06-04 01:10:53"}, "1131": {"text": "\"If you’re elected President of the United States, what would you say to Vladimir Putin the first time you met him?\" - @HardballChris\n\n\"Well, don’t mess with our elections.\" https://t.co/JpXaweIlrN", "date": "2019-06-04 00:50:13"}, "1132": {"text": "RT @JoshNBCNews: 10 minutes until our ⁦@MSNBC⁩ town hall with ⁦@PeteButtigieg⁩ here in Fresno https://t.co/9JEtVDcx9b", "date": "2019-06-03 22:54:52"}, "1133": {"text": "Our campaign team gathered in South Bend last week to ground ourselves in our values. This hardworking, talented, and diverse group of colleagues is ready to win the era. And our team is growing — join us: https://t.co/wKXsMHTeco https://t.co/tKMRU4w7DA", "date": "2019-06-02 17:26:07"}, "1134": {"text": "Thanks to leaders like Marsha P. Johnson and Harvey Milk, I have faith in the possibility of change and growth in this country. There is still more work to do, but let us take a moment and celebrate the gains we've made this #PrideMonth.", "date": "2019-06-02 00:50:00"}, "1135": {"text": "RT @HRC: 1/ Happy #PrideMonth!\n\nThis year, @HRC is celebrating 50 years of #Pride, and two momentous anniversaries in #LGBTQ history: the 5…", "date": "2019-06-01 23:41:52"}, "1136": {"text": "RT @CA_Dem: \"There is no such thing as an honest politics that revolves around the word 'again.'\" - @PeteButtigieg #CADem2019", "date": "2019-06-01 21:27:07"}, "1137": {"text": "RT @hardball: MONDAY: Pete Buttigieg joins us live from @Fresno_State for a Hardball town hall. \n\nTune in at 7 PM ET on MSNBC. #PetePlaysHa…", "date": "2019-06-01 20:50:38"}, "1138": {"text": "Another horrific shooting shocks the nation, this time in Virginia Beach. We grieve with those impacted even as we await more information. Already, this much is clear: it is unacceptable for America to remain the only developed country where this is routine. We must act.", "date": "2019-05-31 23:48:50"}, "1139": {"text": "Thanks to everyone who came out for tonight’s Mayor’s Night Out at @sbcivic, covering everything from potholes to workforce development. South Bend’s strong level of civic involvement and participation was on full display! https://t.co/vOHCXAmQB7", "date": "2019-05-30 23:28:33"}, "1140": {"text": "NH today sent a clear message on criminal justice reform. The death penalty as applied in America has always been a discriminatory practice, and the country would be fairer and safer if we joined the ranks of modern nations who have abolished it. https://t.co/gGFXHKfIUy", "date": "2019-05-30 19:25:14"}, "1141": {"text": "The census is not a sexy topic, but this is serious. There’s further evidence of partisan and racial motivations behind this tampering. It’s another attack on fair democracy, and it matters. https://t.co/GudkjCBWfF", "date": "2019-05-30 18:02:32"}, "1142": {"text": "This is not a show. Our military is not a prop. Ships and sailors are not to be toyed with for the benefit of a fragile president’s ego. https://t.co/plI68Yplp5", "date": "2019-05-30 13:54:06"}, "1143": {"text": "RT @JDScholten: Matthew 25:35-36 \n\nFor I was hungry and you gave me something to eat, I was thirsty and you gave me something to drink, I w…", "date": "2019-05-29 20:07:11"}, "1144": {"text": "This is as close to an impeachment referral as it gets. Robert Mueller could not clear the president, nor could he charge him — so he has handed the matter to Congress, which alone can act to deliver due process and accountability.", "date": "2019-05-29 18:01:54"}, "1145": {"text": "Congratulations to my friend @harrisonjaime on officially launching his campaign to unseat Lindsey Graham in SC. He will make a great Senator—and a positive change. https://t.co/zFD7m1FEjf", "date": "2019-05-29 16:05:57"}, "1146": {"text": "A just economy depends on strong unions to defend working people. Proud of @PGHHospitalWork for standing up for their right to a union, fair wages, and affordable health care. #UnionsForAll https://t.co/WNrXFM2SXO", "date": "2019-05-28 22:56:01"}, "1147": {"text": "RT @hardball: Tonight on #Hardball: @HardballChris hosts from South Bend and talks to @PeteButtigieg! Tune in for his interview at 7 PM ET.…", "date": "2019-05-28 21:11:02"}, "1148": {"text": "RT @votevets: We asked Dem presidential candidates to honor the true meaning of today. Here is what they sent. We thank them all, and remem…", "date": "2019-05-27 15:23:58"}, "1149": {"text": "Memorial Day is set aside for remembering the war dead of this country. It's important for us to pause, step aside, and honor the sacrifice that makes American life possible. https://t.co/HMdT5fJ8UJ", "date": "2019-05-26 21:03:36"}, "1150": {"text": "RT @Chas10Buttigieg: Sunday mood https://t.co/gK0SLJ5jZv", "date": "2019-05-26 20:36:38"}, "1151": {"text": "RT @ThisWeekABC: https://t.co/MD6FgEpUBb", "date": "2019-05-26 17:09:52"}, "1152": {"text": "RT @ThisWeekABC: Pete Buttigieg to @MarthaRaddatz: \"It's a continuing horror show right now in Washington. And you have a president who has…", "date": "2019-05-26 17:09:22"}, "1153": {"text": "RT @ThisWeekABC: Pete Buttigieg on President Trump: \"You have somebody who thinks it's alright to let somebody go in his place into a deadl…", "date": "2019-05-26 17:09:15"}, "1154": {"text": "RT @ThisWeekABC: Pete Buttigieg criticizes Pres. Trump’s meeting with Kim Jong Un, saying it gave North Korea “legitimacy.”\n\n“The way diplo…", "date": "2019-05-26 17:09:05"}, "1155": {"text": "In just the last year we’ve seen violations in states including Georgia, Texas, Ohio &amp; Florida. This week was the anniversary of a law that is, even now, being slowly chipped away. We cannot build a more perfect union unless we first build a democracy that includes every citizen.", "date": "2019-05-26 16:07:27"}, "1156": {"text": "But in the 2000s some states began violating the spirit and intention of the act — aggressively purging voter rolls, failing to register voters in communities of color, and ignoring accommodation requirements for the disabled. https://t.co/gMvx0GvwJ7", "date": "2019-05-26 16:02:40"}, "1157": {"text": "And by 1997 our country was on its way towards that goal. Voter registrations had increased to their highest levels in history. Every state covered by the act was using a uniform voter registration form and all of them were allowing registration by mail. https://t.co/Wi8TdgJM0W", "date": "2019-05-26 16:00:46"}, "1158": {"text": "When the bill was introduced and passed the following year, then President Clinton signed it. Voting rights advocates predicted at the time that the number of registered voters would eventually rise to over 90% after passage and implementation. https://t.co/eF27IgbBN6", "date": "2019-05-26 15:59:02"}, "1159": {"text": "The fight for passage was long. It was stalled in Congress for over a decade, some years not even making it out of committee — the 1 bill that did pass both chambers was vetoed by Pres. Bush for being ‘needless, costly, and constitutionally questionable.” https://t.co/X6natmCH4l", "date": "2019-05-26 15:57:18"}, "1160": {"text": "26 years ago this week our nation passed the National Voter Registration Act (aka Motor Voter) with the express purpose of increasing “the number of eligible citizens who register to vote in elections for Federal office.” Its promise is still unfulfilled. https://t.co/m1AaeobEct", "date": "2019-05-26 15:55:40"}, "1161": {"text": "I love South Bend https://t.co/ygrMPb2REq", "date": "2019-05-26 01:28:24"}, "1162": {"text": "RT @Chas10Buttigieg: Buddy was very excited to watch dad on TV last night. https://t.co/m6uZXuwJGh", "date": "2019-05-26 00:39:33"}, "1163": {"text": "The next president has got to establish a higher bar for what it will take to deploy military force. https://t.co/gyMV1FP5ry", "date": "2019-05-25 21:41:39"}, "1164": {"text": "Our campaign is about forging a generational alliance of people of all ages who are focused on the future and believe it is time for a new generation to step forward.\n\nhttps://t.co/cjMY8CC1ow", "date": "2019-05-25 19:56:42"}, "1165": {"text": "We should be ending discrimination in health care, not encouraging it. This rollback would be an assault on transgender Americans and their ability to receive health care. We must fight to ensure equal access to health care. https://t.co/qSz1Z7RfYg", "date": "2019-05-25 18:47:38"}, "1166": {"text": "You don't have to like it, but one of the reasons we serve was to defend the right of peaceful protest and the idea that we can protest what is wrong with our country.\n\nhttps://t.co/T5SunDY3Oi", "date": "2019-05-25 17:16:01"}, "1167": {"text": "RT @merica: Pete Buttigieg is now mingling with voters - and some cute dogs - at the Concord Farmers Market https://t.co/24fEKGOnZC", "date": "2019-05-25 15:21:11"}, "1168": {"text": "Pardoning war criminals, after or even before they have been tried by a jury of their military peers, would undermine order and discipline, corrode the foundation of American moral authority, and put future troops at risk.\nhttps://t.co/HKHCxqX1Qg", "date": "2019-05-25 14:56:51"}, "1169": {"text": "Disabled students are twice as likely to be expelled and are more likely to be referred to the police, putting them in the same school-to-prison pipeline that ensnares students of color. Our kids deserve accommodation, not incarceration.\nhttps://t.co/LAoCl6YEwu", "date": "2019-05-24 17:48:43"}, "1170": {"text": "30 million students participate in the National School Lunch Program — instead of shaming our children for their lunch debts, we need to tackle the problem of food insecurity in America. https://t.co/8EiSD6pIIh", "date": "2019-05-24 16:24:14"}, "1171": {"text": "If we’re talking about him, then we’re not talking about you. https://t.co/Jim4EBEs5n", "date": "2019-05-24 14:22:25"}, "1172": {"text": "RT @PPact: Reproductive health care is health care — and health care is a human right. \n\nThank you, @PeteButtigieg, for standing up to prot…", "date": "2019-05-24 12:58:44"}, "1173": {"text": "If we've learned anything from the last decade and a half of endless war, it's that you do not casually threaten military involvement. https://t.co/YXNXn0emX2", "date": "2019-05-23 19:35:18"}, "1174": {"text": "Proud to stand with McDonald's workers in the #FightFor15 and a union. https://t.co/rOiH0qmLma", "date": "2019-05-23 16:17:19"}, "1175": {"text": "RT @costareports: Mark your calendar: @PeteButtigieg will visit The Washington Post's @PostLive stage this Thursday for a live, one-on-one…", "date": "2019-05-23 12:54:57"}, "1176": {"text": "Harvey Milk would have been 89 today. \n\nWe are forever indebted to him for showing the world what an out LGBTQ elected leader could do — a local official with global impact. Hope will never be silenced. #HarveyMilkDay", "date": "2019-05-22 20:01:00"}, "1177": {"text": "We're heading to New Hampshire this Saturday for a day of action. Find an event near you and join us to build a movement around our vision for the future. https://t.co/yXgWPA0P6c", "date": "2019-05-22 19:12:42"}, "1178": {"text": "RT @92Y: People are asking and YES we are livestreaming our sold-out talk with @PeteButtigieg and @CapehartJ on Wednesday night. Watch here…", "date": "2019-05-22 13:33:59"}, "1179": {"text": "Happy 154th Birthday to the City of South Bend! #HomeTown https://t.co/Jof5ZgyyqW", "date": "2019-05-22 12:08:18"}, "1180": {"text": "El país más poderoso del mundo no debería temerle a un niño que huye de la violencia, y más importante aún, un niño que huye de la violencia no le debería temer al país más poderoso del mundo.  https://t.co/g4dLYlQ2hT", "date": "2019-05-22 00:53:56"}, "1181": {"text": "The places that attack women's reproductive rights are the same places where it's hard to get a living wage, and the same places where you're seeing voter suppression that seems to be directed at communities of color. All of these things are connected. #StopTheBans https://t.co/nfh16XbMtK", "date": "2019-05-21 22:27:56"}, "1182": {"text": "Bullies want to get a reaction out of you because something else in their life isn't going well. It matters that we elect a president who doesn’t show that kind of behavior. https://t.co/aa0Fv0yttL", "date": "2019-05-21 14:32:07"}, "1183": {"text": "Muhlaysia Booker is the 4th black trans woman murdered this year, but I fear she won't be the last—at least 26 were murdered last year alone. I’m praying for her family, but that's not enough. We need action to end these brutal attacks.\n\nNone of us are free until we’re all free. https://t.co/J2o6Nyu4hK", "date": "2019-05-20 19:11:27"}, "1184": {"text": "Girls like C’alra are often judged prematurely, punished more harshly, and hamstrung by stereotypes older than this country — we must reverse the damage of past and present racism.\nhttps://t.co/M67gzVHgOP", "date": "2019-05-20 17:12:26"}, "1185": {"text": "We are living on one of those blank pages in between chapters in American history. What comes next could be ugly – or it could be amazing.\n\nI hope you’ll join me in making sure that the next era is better than any that we’ve had so far: \n\nhttps://t.co/6XMmFwIzM4 https://t.co/MNzvTjz9NA", "date": "2019-05-20 02:38:16"}, "1186": {"text": "The flag I wore on my shoulder represented a country that was known for keeping its word. But with the president considering pardoning war criminals even after they have been tried by a jury of their peers, that is undermining American moral authority and putting troops at risk. https://t.co/84OMsTIIyT", "date": "2019-05-20 02:25:59"}, "1187": {"text": "Even though some of these hosts are not always there in good faith, I think a lot of people tune into this network in good faith. \n\nWhether it’s going on Fox or going into places where Democrats haven’t been seen much, we have to find people where they are–not change our values. https://t.co/xNHoD0uzE4", "date": "2019-05-20 02:10:36"}, "1188": {"text": "The way folks responded to the Fox News Town Hall tonight shows that we can connect with people anywhere while standing firm on our values. Help us build a campaign that can compete everywhere and change the conversation: \n\nhttps://t.co/BpTHCPkGql https://t.co/Xs0YmP4A1F", "date": "2019-05-20 01:14:08"}, "1189": {"text": "We have to make it less about him and more about what matters. That's the best way to defeat him. https://t.co/2PxuncQ6bW", "date": "2019-05-20 00:48:49"}, "1190": {"text": "I believe that the right of a woman to make her own decisions about her reproductive health and about her body is a national right. I believe it is an American freedom that should be enjoyed by women in every state. The next president needs to be ready to protect those rights. https://t.co/NM5IJkO9GO", "date": "2019-05-20 00:25:43"}, "1191": {"text": "RT @merica: Very interesting: Buttigieg uses his Fox News town hall to call out Tucker Carlson and Laura Ingraham - by name - for comments…", "date": "2019-05-19 23:43:12"}, "1192": {"text": "RT @eatgregeat: “It’s a moral office &amp; we’re missing that in today’s president” - Pete Buttigieg on (gasp) @foxnews \n  #PeteForAmerica2020…", "date": "2019-05-19 23:28:18"}, "1193": {"text": "RT @merica: Buttigieg on abortion in Fox News town hall: \"I believe that the right of a woman to make her own decisions about her own repro…", "date": "2019-05-19 23:26:57"}, "1194": {"text": "RT @Lis_Smith: Don’t miss out on the second biggest television event tonight.\n\nTune into @foxnews at 7 PM ET for @PeteButtigieg’s town hall…", "date": "2019-05-19 22:34:23"}, "1195": {"text": "The attacks on women’s reproductive freedoms show what the stakes are in this election. The next president needs to be the strongest president ever on women’s rights and equality and gender inclusion. https://t.co/YuPtD9w2LT", "date": "2019-05-18 23:46:23"}, "1196": {"text": "Thanks to the work of thousands of activists, organizers, and voters, the Equality Act has in passed the House. This is a historic moment for equal rights in America. Now the bill goes to the Senate, and the time to call your Senator is now: (202) 224-3121", "date": "2019-05-17 18:20:36"}, "1197": {"text": "RT @theskimm: We asked South Bend, Indiana Mayor @PeteButtigieg how he'd approach reproductive rights as president. Here's what he had to s…", "date": "2019-05-17 14:25:20"}, "1198": {"text": "RT @YellowFund: #Abortion is a human right, at every stage &amp; for every reason. We hope our state Senators will read Jenna King-Shepherd &amp; D…", "date": "2019-05-15 19:29:46"}, "1199": {"text": "Fleming Begaye Sr. was one of the last remaining Navajo Code Talkers, a group of soldiers whose language skills and patriotism helped us win World War II — his family is in our prayers.\n\nhttps://t.co/RiC9wNOrWS", "date": "2019-05-15 17:35:27"}, "1200": {"text": "RT @ilyseh: Thank you for your confidence in our leadership @PeteButtigieg We are prepared and we are organized; we will fight and we will…", "date": "2019-05-15 16:10:33"}, "1201": {"text": "The Alabama legislature is ignoring science, criminalizing abortion, and punishing women. \n\nInstead, the government's role should be to make sure all women have access to comprehensive affordable care, and that includes safe and legal abortion.\n\nhttps://t.co/pU0rKy0fED", "date": "2019-05-15 14:34:38"}, "1202": {"text": "It’s time to end the forever wars. But in this White House, some of the same people who got us into Iraq now seem ready to stoke a new conflict. It’s another reason Congress must reassert its war powers. https://t.co/XdTyWuAr45", "date": "2019-05-15 13:15:47"}, "1203": {"text": "Immigrants and refugees are not a problem that we need to handle, they are an asset to our nation and an essential part of the fabric of this country — our policies must reflect that. https://t.co/CyXTUxnCpw", "date": "2019-05-14 15:43:43"}, "1204": {"text": "Today we recognized South Bend Schools students committing to enter military service after high school. They deserve our thanks—and a commitment that this country take care of them, during and after their time in uniform. https://t.co/PLyeQrGwau", "date": "2019-05-14 13:50:26"}, "1205": {"text": "RT @FallonTonight: Awww yeah, it's time to Slow Jam the News with Mayor @PeteButtigieg, Jimmy, and @theroots! https://t.co/GSjQfC3FhQ #Fall…", "date": "2019-05-14 03:55:49"}, "1206": {"text": "Quick reminder: a tariff is a tax. On Americans.", "date": "2019-05-14 02:04:41"}, "1207": {"text": "Wishing a speedy recovery to President Carter, and we will be praying for and thinking of him and Mrs. Carter today.", "date": "2019-05-13 20:40:50"}, "1208": {"text": "We are not all alike. But each of us can find, in our own identities, the building blocks for solidarity with others—and a shared commitment to the struggle for justice. https://t.co/sWBhJCaENh", "date": "2019-05-13 17:39:15"}, "1209": {"text": "Our greatest armor is truth and the truth is that no honest or constructive politics revolves around the word again. We're not going back. https://t.co/WC0nDWcCOr", "date": "2019-05-13 15:37:11"}, "1210": {"text": "Behind this campaign are two incredible women who believe in their sons and a brighter future for their (someday!) grandchildren. Each of us is grateful for our Mom and Mom-in-law. We love you! https://t.co/ib02sT8jzf", "date": "2019-05-12 16:36:25"}, "1211": {"text": "RT @HRC: Powerful words from Mayor @PeteButtigieg on the diversity of the LGBTQ community and the need for marginalized communities to join…", "date": "2019-05-12 11:03:03"}, "1212": {"text": "RT @HRC: \"We can also see in our identity the beginning of a new form of American solidarity. By recognizing that the one thing we have in…", "date": "2019-05-12 04:35:05"}, "1213": {"text": "RT @DavidsonLVRJ: @HRCLasVegas @PeteButtigieg Mayor @PeteButtigieg on his campaign strategy for 2020.\n\n“We can't let this election be about…", "date": "2019-05-12 03:27:47"}, "1214": {"text": "RT @AaronDFordNV: Great seeing my good friend and @AspenInstitute #RodelFellows classmate, Mayor @PeteButtigieg this evening. He is in Vega…", "date": "2019-05-12 02:39:05"}, "1215": {"text": "@ericgarcetti @UTLAnow @SEIULocal99 @UBCJA_Official We organize as an act of hope. We do these things because we know they will make a difference — that’s what our democracy is all about. https://t.co/Ttd4Gk5vzY", "date": "2019-05-11 15:53:50"}, "1216": {"text": "RT @Elex_Michaelson: .@PeteButtigieg on responding to @realDonaldTrump's attacks:\n\n\"This is an election that's going to take enormous disci…", "date": "2019-05-11 15:20:57"}, "1217": {"text": "Measure EE lowers classroom sizes, raises teacher pay, and puts more nurses in schools — thanks to Mayor @EricGarcetti for inviting me today and thanks to @UTLAnow, @SEIULocal99 and the @UBCJA_Official for the work you’re doing on this issue. https://t.co/wOntMnmQZd", "date": "2019-05-09 19:40:45"}, "1218": {"text": "La política de \"tolerancia cero\" no funciona y ha reducido nuestra autoridad moral en nuestro país.\n\nhttps://t.co/Y43EAm7xyc", "date": "2019-05-09 17:32:46"}, "1219": {"text": "A woman has enough to deal with when it comes to her health care without also having to worry about male politicians telling her what she ought to do with her body. Georgia’s abortion ban is a cruel attack on women’s autonomy and freedom  — one that we must continue to resist.", "date": "2019-05-09 16:34:57"}, "1220": {"text": "RT @theskimm: Yesterday we sipped whiskey and chatted with South Bend, Indiana Mayor @PeteButtigieg (BOOT-edge-edge). He’s running for prez…", "date": "2019-05-09 01:07:48"}, "1221": {"text": "I’m standing in solidarity with @_drivers_united and all those striking across the country today for livable wages, more job security, and regulated fares. We must raise the labor standards in this country. \n\nhttps://t.co/99NNdnjgUW", "date": "2019-05-08 18:39:07"}, "1222": {"text": "Congratulations James @MuellerforMayor on winning the Democratic nomination for mayor tonight! He will help lead South Bend forward and continue building on the progress of the past eight years.", "date": "2019-05-08 00:19:56"}, "1223": {"text": "We have to solve the mass shooting epidemic. We — especially our students — should all feel safe in our communities. I’m praying for the students and families from STEM School Highlands Rach, and will not rest until we deliver common-sense gun reform.", "date": "2019-05-08 00:16:01"}, "1224": {"text": "These revelations add new outrage to the case of Sandra Bland. In the name of justice, the investigation into her arrest and death must be reopened. https://t.co/4pAKEFT3M6", "date": "2019-05-07 21:05:05"}, "1225": {"text": "Local elections matter. Thanks to everyone who has already voted here today in South Bend — polls are open until 6 pm tonight. #ElectionDay https://t.co/BWnx67yFcv", "date": "2019-05-07 20:57:47"}, "1226": {"text": "RT @Chas10Buttigieg: What do you appreciate the most about your child’s teacher? If you’re a teacher, what do you wish folks appreciated mo…", "date": "2019-05-07 14:55:18"}, "1227": {"text": "RT @TODAYshow: Watch @PeteButtigieg’s full interview with @craigmelvin about his sudden rise as a contender in the 2020 presidential race,…", "date": "2019-05-07 13:00:41"}, "1228": {"text": "Thanks for a great visit! Came away impressed with your institution, students, and staff as we discussed everything from support for HBCUs to the future of the military. https://t.co/Y64xrLcqIO", "date": "2019-05-06 20:17:11"}, "1229": {"text": "Wishing a Ramadan Mubarak to all Muslims around the country and the world. The holiday’s themes of generosity, discipline, and community are timely this year, and every year.", "date": "2019-05-06 17:22:38"}, "1230": {"text": "RT @BeschlossDC: RFK’s tooth was chipped by supporter in South Bend before Indiana primary, this week 1968: https://t.co/9hDAbUS1Vy", "date": "2019-05-06 02:21:42"}, "1231": {"text": "I was humbled to meet with President Carter in Plains, Georgia today. He is a true public servant and America is blessed for his continuing leadership. https://t.co/LaITTSYb0A", "date": "2019-05-05 18:40:52"}, "1232": {"text": "RT @MSNBC: “I was packing my bags for Afghanistan while he was working on season 7 of Celebrity Apprentice. ... At the end of the day, it’s…", "date": "2019-05-05 13:10:57"}, "1233": {"text": "RT @TheTexasSignal: @PeteButtigieg shares personal story of a Dreamer he met today at Univ of Houston. She’s just as American as the rest o…", "date": "2019-05-04 23:51:33"}, "1234": {"text": "In so many ways, South Bend is our message. Thanks for the encouragement! https://t.co/8YlsbwtyoM", "date": "2019-05-04 01:00:01"}, "1235": {"text": "Being involved in politics is an act of hope. Running for office is an act of hope. Sending money to somebody running for office is an act of hope.\n\nWe are building a community that thinks hope is worth it.\n\nhttps://t.co/j9VIMPj5iA https://t.co/svhEA9SBWo", "date": "2019-05-03 21:15:35"}, "1236": {"text": "RT @Chas10Buttigieg: Hi. Here’s a bit about me. \nhttps://t.co/BfYCEIHMrY", "date": "2019-05-03 14:47:16"}, "1237": {"text": "RT @EricLesser: As the 2020 Presidential campaign heats up, don’t forget there are 50 state capitals where life and death decisions are mad…", "date": "2019-05-03 02:37:25"}, "1238": {"text": "We can Never Forget that our obligation to work towards religious freedom and social justice is both shared and personal.", "date": "2019-05-02 17:51:44"}, "1239": {"text": "Violent religious intolerance and racism are on the rise. We, people of any religion and of no religion, must ask ourselves what it means to live out our highest values.", "date": "2019-05-02 17:51:43"}, "1240": {"text": "As the world pauses to remember the Holocaust this Yom HaShoah, and as Americans are trying to come to grips with yet another despicable violent attack at a synagogue in San Diego, we pause to reflect on the deep and painful loss and the work that remains. https://t.co/MU1lQci5r0", "date": "2019-05-02 17:51:42"}, "1241": {"text": "Venezuela needs free and fair elections, not a unilateral US military intervention with no game plan or exit strategy. Our troops deserve a president who will set a high and clear standard for the use of military force. https://t.co/PWxbB5NhCp", "date": "2019-05-02 17:28:32"}, "1242": {"text": "It’s time to honor the teaching profession with the support, compensation, and respect it deserves. We stand with educators in South Carolina and across the country as they rise up to demand better treatment and the freedom to do their job. https://t.co/dIx4dXcrLo", "date": "2019-05-01 17:18:27"}}