{"0": {"text": "I’m sick &amp; tired of giant drug companies prioritizing profits over patients’ health. Greedy Gilead execs should not be able to abuse the patent system to get rich from #PrEP, &amp; we need to take steps to open the pharmaceutical market to more competition. https://t.co/bRIhVwMd4z", "date": "2019-12-06 22:55:35"}, "1": {"text": ".@CBP said it won’t give recommended flu vaccines to detained families, but the flu has been fatal to kids in its custody. I’ve said it before &amp; I’ll say it again: this is an immoral, irresponsible decision. @DHSgov must reverse it before more people die. https://t.co/JuiCfCk1f6 https://t.co/qVygKPHv3I", "date": "2019-12-06 22:31:01"}, "2": {"text": "RT @SenJeffMerkley: Despite @DHS_Wolf’s refusal to turn over the Red Team report at my, @SenKamalaHarris, @SenWarren, &amp; @SenSchumer request…", "date": "2019-12-06 21:36:42"}, "3": {"text": "Servicemembers &amp; their families deserve high-quality health care. I’m glad @DeptofDefense will start to cover 3D breast cancer screenings in the military health system. Earlier this year I urged DOD &amp; cosponsored a bipartisan bill to require coverage of this preventive screening. https://t.co/PbqMV6HADt", "date": "2019-12-06 14:50:47"}, "4": {"text": "RT @UFCW: America's part-time retail &amp; food workers want full-time work – but many corporations keep them part-time to deny wages &amp; benefit…", "date": "2019-12-05 23:06:01"}, "5": {"text": "RT @SenatorHassan: I sent a letter with @SenatorShaheen, @SenWarren, and @SenMarkey requesting an update on the Justice Department’s use of…", "date": "2019-12-05 22:29:27"}, "6": {"text": "I’m very glad the Senate passed a bipartisan bill to permanently fund HBCUs and other minority-serving colleges, which I was proud to cosponsor. These schools have waited for funding certainly long enough – the House should pass the #FUTUREAct right away. https://t.co/aLb93xYlFb", "date": "2019-12-05 21:18:37"}, "7": {"text": "Most of the big banks are bigger now than when taxpayers bailed them out in 2008, &amp; the @BBT/@SunTrust merger will make this Too Big to Fail risk even worse. It’s time for Congress &amp; our regulators to stand up to big banks &amp; protect the American people. https://t.co/JGWsMCeRIA", "date": "2019-12-05 17:31:51"}, "8": {"text": "@federalreserve @RepChuyGarcia Our bank merger bill would force regulators to consider how a bank merger affects consumers’ access to products like mortgages &amp; small business loans. And it would require regulators to reject any bank merger that puts the economy – and working families – at risk.", "date": "2019-12-05 17:31:50"}, "9": {"text": "Nearly 2 years ago, Chairman Powell confirmed my worst suspicions: the @FederalReserve hasn’t denied a single bank merger since the 2008 financial crisis. @RepChuyGarcia &amp; I are introducing a new bill to make sure regulators do their jobs &amp; stop rubber-stamping bank mergers. https://t.co/SCUkvRPwrv", "date": "2019-12-05 17:30:30"}, "10": {"text": "We need big, bold action to fight the #ClimateCrisis – &amp; I’m in this fight all the way. That’s why I’m proud to be an original cosponsor of @SenMarkey &amp; @RepAOC’s #GreenNewDeal resolution to transform our economy &amp; save our planet for our children &amp; grandchildren.", "date": "2019-12-05 00:31:03"}, "11": {"text": "The evidence is clear: climate change threatens our economy. And I have bills for that. I introduced the Climate Risk Disclosure Act &amp; cosponsored @SenBrianSchatz’s Climate Change Financial Risk Act to make our economy more resilient to the #ClimateCrisis. https://t.co/pLVbzvEKwo", "date": "2019-12-05 00:31:02"}, "12": {"text": "No family should have to struggle to put food on the table &amp; no child should have to go to bed hungry. SNAP is a lifeline for millions of Americans in MA &amp; across the country. We should be expanding this program – not tearing it apart. https://t.co/KA4E5lCzk5", "date": "2019-12-04 22:50:13"}, "13": {"text": "RT @repmarkpocan: .@BetsyDeVosED has blatantly refused to forgive the student debt of over 200,000 borrowers defrauded by for-profit colleg…", "date": "2019-12-04 02:40:45"}, "14": {"text": "RT @janschakowsky: Yes We Did @SenWarren! https://t.co/JQEqntixCO", "date": "2019-12-03 21:49:54"}, "15": {"text": "RT @janschakowsky: Over two-thirds of part-time retail &amp; food workers would prefer full-time work. However, many companies boost short-term…", "date": "2019-12-03 21:49:35"}, "16": {"text": "20 years ago, the @WorcesterFD courageously ran into a burning warehouse, &amp; six brave firefighters didn’t make it out. Today we honor the Worcester 6, &amp; we remember the sacrifice that all our firefighters make to keep us safe every day. #W6 https://t.co/J7B9hm5a4O", "date": "2019-12-03 21:02:41"}, "17": {"text": "For far too long, big corporations have taken advantage of part-time workers with unpredictable work schedules – creating real hardships for them. My bill with @RepSchakowsky strengthens the rights, stability, &amp; other protections workers deserve to build better financial futures.", "date": "2019-12-03 17:10:45"}, "18": {"text": "The Part-Time Worker Bill of Rights Act would:\n❌ Require big companies to offer available hours to part-time employees before hiring new employees/subcontractors\n❌ Make more part-time employees eligible for FMLA\n❌ Give part-time workers access to pension plans", "date": "2019-12-03 17:10:45"}, "19": {"text": "2/3 of part-time retail &amp; food workers want full-time work – but corporations often keep workers part-time to save on wages &amp; benefits. @RepSchakowsky &amp; I are introducing the Part-Time Worker Bill of Rights Act to boost protections for part-time workers. https://t.co/xRjBYrm98Q", "date": "2019-12-03 17:10:44"}, "20": {"text": "All workers, including Harvard grad students, should have the right to organize &amp; fight for better wages &amp; working conditions. I've joined the entire MA delegation in urging Harvard’s leadership to negotiate in good faith with @hgsuuaw for a fair agreement. https://t.co/x5tOu9SEt8", "date": "2019-12-03 15:42:32"}, "21": {"text": "RT @WhipClyburn: Most of us don’t think twice about being able to shop online, but thousands of Americans still lack access to basic intern…", "date": "2019-12-02 19:10:30"}, "22": {"text": "RT @MassEMA: Heavy snowfall rates will make hazardous travel conditions late Sunday afternoon and evening.\n\n@MassDOT is encouraging motoris…", "date": "2019-12-01 18:24:51"}, "23": {"text": "Retail, fast food, &amp; other hourly workers deserve some basic fairness when it comes to scheduling shifts. That’s why my #SchedulesThatWork Act with @rosadelauro would end some of the very worst abuses that hurt workers &amp; families. #FairWorkWeek https://t.co/cUeWphPea2", "date": "2019-11-30 16:01:43"}, "24": {"text": "Holtec shouldn't be exempt from important emergency prep safeguards as it decommissions the Pilgrim Nuclear Power Station. The community has rightly raised important questions about the plant's decommissioning. They deserve answers, not more strong-arming. https://t.co/jF2hIw8MiF", "date": "2019-11-27 21:02:44"}, "25": {"text": "RT @marty_walsh: #Refugees have made great contributions to our country. With 70.8 million people displaced globally, America must remain a…", "date": "2019-11-27 20:21:21"}, "26": {"text": "US military hardware in the hands of armed groups in Yemen violates US law &amp; undermines our security. Glad that @StateDept &amp; @DeptofDefense are investigating, but Saudi &amp; UAE govts aren’t fully cooperating. I still think selling them arms is a bad idea. https://t.co/FIWEsC8Yap", "date": "2019-11-27 18:49:07"}, "27": {"text": "RT @MassAGO: Our immigrant community is not going anywhere, and as long as I am your AG, I will stand with you and fight for your wages, yo…", "date": "2019-11-26 23:59:46"}, "28": {"text": "RT @NydiaVelazquez: When we talk about housing rights, we talk about human rights. I’m proud to join arms 💪🏽with @SenWarren in putting fort…", "date": "2019-11-26 22:37:45"}, "29": {"text": "President Trump's trade-war-by-tweet with China is hurting cranberry farmers in MA &amp; across the country. @SenMarkey, @USRepKeating, @RepJoeKennedy &amp; I are urging the @USTradeRep to find new markets to compensate for China’s 40% tariffs on US cranberries. https://t.co/rzLHmOlxza", "date": "2019-11-26 19:57:49"}, "30": {"text": "This month, my POW/MIA Flag Act became law. Starting this week, you’ll see this Flag flying with the US flag over the Capitol permanently. This symbol must now be displayed daily at many federal sites across the nation so we never forget our servicemembers who didn’t return home. https://t.co/CqS9VnPtvW", "date": "2019-11-26 19:06:36"}, "31": {"text": "Working families deserve a @CFPB that will get the tricks &amp; traps out of credit cards &amp; other financial products – &amp; stand up to big banks, credit card &amp; fintech companies when they cheat &amp; discriminate. I’ll keep fighting to hold the CFPB accountable until it does its job.", "date": "2019-11-26 16:27:53"}, "32": {"text": "In the 2 yrs they’ve controlled @CFPB, @MickMulvaneyOMB &amp; @CFPBDirector have gutted its fair lending office, stripped it of exam &amp; enforcement powers, &amp; failed to file even 1 equal credit enforcement action. Could it be that banks know they can discriminate without consequences?", "date": "2019-11-26 16:27:53"}, "33": {"text": ".@CFPB’s job is to enforce fair lending laws &amp; stop discriminatory financial products. @SenSherrodBrown &amp; I want @CFPBDirector to explain how @GoldmanSachs’ @Apple Card slipped through when women who apply may get worse terms than men with similar credit. https://t.co/SvUQfrmpm9", "date": "2019-11-26 16:27:52"}, "34": {"text": "Our hearts go out to the crew of the F/V Leonardo, their loved ones, &amp; to our entire fishing community in New Bedford. Fishing is more than a job or industry in MA – it's a family. We're grateful for the @USCG's tireless work today &amp; every day. https://t.co/G9dBVxd5rF", "date": "2019-11-25 23:39:08"}, "35": {"text": "On International Day for the Elimination of Violence against Women, let’s reaffirm our commitment to ensuring women &amp; girls worldwide can live free from violence. The US can show leadership by reauthorizing the Violence Against Women Act. #OrangeTheWorld #VAWA4ALL https://t.co/vxYw80SD5z", "date": "2019-11-25 19:55:28"}, "36": {"text": "Congrats to Boston Battery Wharf Hotel workers &amp; @UNITEHERE26 for ratifying a new contract for better pay, affordable health care, fair scheduling, &amp; protections from sexual harassment &amp; discrimination. It was a tough fight – but when workers fight, workers win. https://t.co/3WYzF1NdPC", "date": "2019-11-22 21:12:30"}, "37": {"text": ".@SenMarkey &amp; I are proud to see @EnergyCommerce pass our Leonel Rondon Pipeline Safety Act with @RepLoriTrahan as part of their SAFER Pipelines Act – &amp; we’re grateful for good neighbors like @RepAnnieKuster who fight to help keep the Merrimack Valley &amp; all our communities safe. https://t.co/rE3rqNzfRG", "date": "2019-11-22 16:21:14"}, "38": {"text": "Access to millions of patient records gives @Google a huge resource to build AI systems &amp; other tech – especially in light of news that Google is trying to buy Fitbit. Regulators &amp; medical experts are right to have big privacy &amp; competition concerns. https://t.co/5kodqZjTxv", "date": "2019-11-21 21:30:49"}, "39": {"text": "Medical records are extremely sensitive info that, when mishandled, expose patients to embarrassment, discrimination, &amp; exploitation. Based on @Google’s prior privacy violations &amp; security failures, we need to know how they’re handling patient data &amp; for what purposes.", "date": "2019-11-21 21:30:49"}, "40": {"text": "I'm concerned by reports that @Google collected personal health information from 50 million Americans without their consent. @SenBlumenthal, @SenBillCassidy &amp; I want Google to explain “Project Nightingale” &amp; how they’re planning to use this private data. https://t.co/ezJv10CBnM", "date": "2019-11-21 21:30:48"}, "41": {"text": "RT @RepLucyMcBath: It is past time to act.\n\nIt is past time to save American lives.\n\nI joined my colleagues to deliver a letter signed by H…", "date": "2019-11-20 21:04:21"}, "42": {"text": "In the past decade, the @FederalReserve hasn’t denied a single bank merger application. It’s clear: the Fed works for the big, rich banks – and everyone else pays the price. Earlier this year, I told Chairman Powell: that needs to change. https://t.co/I65KA71iEg", "date": "2019-11-20 01:21:59"}, "43": {"text": "The last thing our country needs is more Too Big To Fail banks. They put our entire economy – and working families – at risk. https://t.co/24VvfA7vAI", "date": "2019-11-20 01:21:58"}, "44": {"text": "Everyone has a right to live in a safe &amp; affordable home. I’m glad to join @NydiaVelazquez’s bold effort to invest $70B in the Public Housing Capital Fund to wipe out the backlog of public housing maintenance &amp; repairs caused by years of underfunding. https://t.co/oYgygCErXo", "date": "2019-11-20 00:57:16"}, "45": {"text": "Glad the #HongKongHumanRightsDemocracyAct passed the Senate. I’m proud to be a cosponsor of this bill, which strengthens support for human rights &amp; democracy in Hong Kong.", "date": "2019-11-20 00:30:21"}, "46": {"text": "I’m concerned about private equity firms' investment in industries like nursing homes that care for seniors &amp; people with disabilities &amp; rely on government Medicaid &amp; Medicare funding. That’s why I’ve got a bill to #StopWallStreetLooting &amp; hold private equity firms accountable.", "date": "2019-11-19 22:20:54"}, "47": {"text": "For-profit nursing home chains owned by private equity firms have more health &amp; safety problems that put residents at risk. And the complicated ownership structure makes it hard for families to hold these homes legally liable for bad care.  #StopWallStreetLooting", "date": "2019-11-19 22:20:53"}, "48": {"text": "Private equity firms have made big investments in big for-profit nursing home chains. @SenSherrodBrown, @RepMarkPocan &amp; I are investigating their role in the declining quality of nursing home care. #StopWallStreetLooting https://t.co/dSMmjgnglA", "date": "2019-11-19 22:20:53"}, "49": {"text": "Sorry for interrupting the party, @HHSGov – but before we spend more money to hang his portrait, can we get answers to our questions about whether Tom Price paid back taxpayers for his wrongful use of private jets on the taxpayer’s dime? https://t.co/6eziMyn1Fv https://t.co/yishIcdnmC", "date": "2019-11-19 16:31:29"}, "50": {"text": "RT @repmarkpocan: Today, @FSCDems will hold a much-needed hearing on the exploitative practices of private equity firms.\n\nLast year, PE fir…", "date": "2019-11-19 15:47:02"}, "51": {"text": "Here’s the bottom line: private equity firms are putting millions of workers at risk by loading up companies with debt, stripping assets, &amp; collecting huge fees. If the bets go bad, they walk away. I’ll keep fighting to #StopWallStreetLooting &amp; hold private equity accountable.", "date": "2019-11-19 14:16:35"}, "52": {"text": "Ernst &amp; Young’s industry-funded report paints a dishonest picture about private equity's effect on our economy. For example, when EY calculated private equity-owned companies’ avg wages, they included their Wall Street investors’ fat paychecks to skew the numbers. https://t.co/VOJGthXyFi", "date": "2019-11-19 14:16:34"}, "53": {"text": "Private equity will do anything to kill my #StopWallStreetLooting Act – even funding a sham study by Ernst &amp; Young to defend the industry. @RepMarkPocan, @RepJayapal, @SenatorBaldwin, @SenSanders, &amp; I want EY to explain their report's glaring flaws. https://t.co/tqLY7MzNZY", "date": "2019-11-19 14:16:32"}, "54": {"text": "Toys “R” Us. Radio Shack. Payless Shoes. Sports Authority. Mervyn’s. Shopko. For far too long, private equity firms have destroyed retail stores &amp; killed jobs, hurt workers, &amp; drained our economy. We must #StopWallStreetLooting – &amp; I have a bill for that. https://t.co/qTweUTdMGP", "date": "2019-11-16 16:09:29"}, "55": {"text": "Devastating – and unacceptable. It's time for the @SenateGOP to stop working for the gun industry and start taking action to protect our children from senseless gun violence. https://t.co/UUACOzSzXF", "date": "2019-11-15 14:10:07"}, "56": {"text": "It’s true: our student loan system IS fundamentally broken. That’s why @WhipClyburn &amp; I have a bill to cancel student loan debt for 42 million Americans. Our bill will help close the racial wealth gap &amp; end the student debt crisis. #CancelMyDebt", "date": "2019-11-14 18:44:26"}, "57": {"text": "Dr. Johnson says that “repayment trends suggest much of the [student loan] debt will likely never be repaid,” but @BetsyDeVosED refuses to lift a finger to help our students. If @usedgov is sitting on info confirming Dr. Johnson's conclusions, the public deserves to see it.", "date": "2019-11-14 18:44:26"}, "58": {"text": "Last month, one of @BetsyDeVosED’s top student loan advisors abruptly resigned, called the student loan system “fundamentally broken,” &amp; announced his support for student debt cancellation. @WhipClyburn &amp; I want to know how he came to that conclusion. https://t.co/d9ObTTSefg", "date": "2019-11-14 18:44:25"}, "59": {"text": "RT @SenSherrodBrown: Freedom of association is a fundamental human right. \n\nThe Philippines government must immediately stop targeting unio…", "date": "2019-11-13 22:24:56"}, "60": {"text": "MA residents want clean air &amp; water &amp; safety for their communities. They don’t want Big Oil &amp; Gas swooping in to turn a profit by shipping natural gas overseas. I’ll keep fighting alongside South Shore families to keep a compressor station out of Weymouth. https://t.co/AL79fFBUeY", "date": "2019-11-13 17:41:11"}, "61": {"text": "Our brave firefighters risk their lives every day to keep us safe, &amp; it’s a tragedy when someone doesn’t make it home to their loved ones. My heart goes out to Lt. Menard’s family &amp; friends, &amp; the entire @WorcesterFD for their loss. https://t.co/xenhkltOJ6", "date": "2019-11-13 14:37:09"}, "62": {"text": "RT @RepLoriTrahan: Today I joined with my colleagues in the #Massachusetts Delegation to demand answers from @HHSGov about the Trump admini…", "date": "2019-11-12 22:46:39"}, "63": {"text": "Valeria &amp; her sister are woven into the fabric of our Commonwealth &amp; our country. Their #HomeIsHere. I stand with our DACA recipients at the Supreme Court – and all of our Dreamers – who are fighting for the chance to build a future for themselves &amp; their families. #HereToStay https://t.co/o8bo7poFIX", "date": "2019-11-12 17:29:41"}, "64": {"text": "RT @UNITEDWEDREAM: Our #HomeIsHere. Today the United States Supreme Court will hear the arguments and stories of #DACA recipients. We are #…", "date": "2019-11-12 14:51:33"}, "65": {"text": "Last week, I partnered with my colleagues on a bipartisan resolution urging the @USPS to commemorate some of the most courageous women veterans in our nation's history with a postage stamp series. It's one way we can honor their hard work &amp; dedication. https://t.co/SOnflO5GVx", "date": "2019-11-11 16:34:15"}, "66": {"text": "All 3 of my brothers served in the military, &amp; I appreciate the sacrifices &amp; contributions that our servicemembers, veterans, &amp; military families make for our country. We are grateful for their service – on #VeteransDay &amp; every day. https://t.co/I1OZoa7Wrs", "date": "2019-11-11 14:47:57"}, "67": {"text": "I’ve worked hard in the Senate to improve the lives of our veterans &amp; military families. I co-led a bipartisan bill to streamline the process for veterans to get commercial driver’s licenses. I’m glad it was signed into law last year. https://t.co/RJQsoVQGXh", "date": "2019-11-10 15:50:57"}, "68": {"text": "Welcome back to Massachusetts, Ambassador @SenScottBrown and Gail! I know it will be good for New England Law Boston to have a dynamic leader. https://t.co/pCkD9CrufQ", "date": "2019-11-09 00:33:44"}, "69": {"text": "All 3 of my brothers came home safe after their service, but many do not. My bipartisan bill signed into law this week ensures that the POW/MIA Flag is prominently displayed &amp; that we never forget our servicemembers who haven’t returned home. https://t.co/rlsSVbLBbK", "date": "2019-11-08 18:56:09"}, "70": {"text": "RT @chopraftc: The U.S. is falling behind when it comes to our payment system. A megabank monopoly is lobbying to hijack this critical infr…", "date": "2019-11-08 18:12:34"}, "71": {"text": ".@SenatorMenendez issued a report showing the Trump administration recklessly ignored the warnings of career @StateDept officials about ending humanitarian protections for TPS recipients from El Salvador, Honduras, &amp; Haiti. More proof of this administration's heartless policies. https://t.co/gWELClCMm7", "date": "2019-11-08 17:02:22"}, "72": {"text": "This is disgusting. Eric Blankenstein’s racist writings disqualify him from a job at @HUDgov or any other government agency. He should have been fired, not rewarded with a big promotion. https://t.co/n9WdpTg0uX", "date": "2019-11-08 16:07:54"}, "73": {"text": "RT @RepMcGovern: This is a joke, right? H.R. 1 – the #ForThePeople Act – has been sitting on your desk for 242 days.\n\nBipartisan background…", "date": "2019-11-07 16:44:18"}, "74": {"text": "Like a lot of parents in MA &amp; across the country, I struggled as a young mom to find &amp; afford quality child care. Today it’s even harder. I’m fighting for #UniversalChildCare so every family can afford care &amp; child care workers are paid what they deserve. https://t.co/9zNP2pJpFz", "date": "2019-11-07 15:20:12"}, "75": {"text": "Last month, I wrote a letter to the @StateDept &amp; @DeptofDefense asking whether continuing to sell our military hardware to the Saudis &amp; Emiratis is a good idea. (Hint: it’s not.) https://t.co/T5yYh8QuDI", "date": "2019-11-07 00:37:08"}, "76": {"text": "Step 1: Saudis transfer U.S. military equipment to Yemen.\nStep 2: UAE-backed separatist militia gets that equipment &amp; uses it against Saudi-backed govt. \nStep 3: Saudis keep transferring more U.S. military equipment to Yemen. \n \nWhat could go wrong? https://t.co/efcBYsVrmy", "date": "2019-11-07 00:37:08"}, "77": {"text": "RT @SenDougJones: It has been over a month since funding expired for HBCUs and other minority-serving institutions—this is just unacceptabl…", "date": "2019-11-07 00:03:14"}, "78": {"text": "Before the @FCC approved the deal, T-Mobile execs spent $195k at Trump Hotels. This is what corruption looks like, &amp; working families pay the price. My bill to #EndCorruptionNow would reduce the stranglehold that giant companies have over our government.", "date": "2019-11-06 21:36:06"}, "79": {"text": "The US has a monopoly problem. In industry after industry, giant corporations get to play by their own political &amp; economic rules, amassing unchecked power over people’s lives. And our government regulators would rather kiss up to them than use their tools to uphold the law.", "date": "2019-11-06 21:36:06"}, "80": {"text": "The @FCC’s final approval of the T-Mobile/Sprint merger officially hands control of nearly 100% of wireless services to 3 corporate giants – strangling competition &amp; harming consumers, workers, &amp; small businesses. https://t.co/0P5w8jApNm", "date": "2019-11-06 21:36:06"}, "81": {"text": "Drug breakthroughs don’t happen by magic – they’re the result of generations of taxpayer investments. But in 2018, @NIH could only fund 20% of its research apps. The Medical Innovation Act is a powerful way to invest in the basic research that will save lives. #NIHSwearJar", "date": "2019-11-06 16:20:44"}, "82": {"text": "My bill requires giant drug companies that produce billion-dollar drugs &amp; enter federal settlements to reinvest a portion of their profits in @NIH research as a condition of the settlement. I call it the #NIHSwearJar: if a drug company follows the rules, it won't pay the fee.", "date": "2019-11-06 16:20:44"}, "83": {"text": "Giant drug companies caught breaking the law often get off with slap-on-the-wrist settlements. I’m reintroducing my Medical Innovation Act with @PeterWelch to increase @NIH &amp; @US_FDA research funding by holding big pharma accountable. #NIHSwearJar", "date": "2019-11-06 16:20:44"}, "84": {"text": "This is disgraceful. Federal funding for Historically Black Colleges &amp; Universities expired more than a month ago, &amp; @SenAlexander just rejected the #FUTUREAct to restore this critical funding. Again. Senate Republicans need to stop the games &amp; fund our HBCUs &amp; MSIs NOW. https://t.co/q5LKMa95Ga", "date": "2019-11-06 00:27:38"}, "85": {"text": "RT @forrespect: Unpredictable schedules in low-wage jobs make it impossible to plan our lives.\n \nOur hours often vary from week to week. Wi…", "date": "2019-11-05 22:19:45"}, "86": {"text": ".@realDonaldTrump’s withdrawal from the #ParisAgreement is a giant wet kiss to corporate polluters. I’m a cosponsor of @SenatorShaheen’s bill to stop President Trump’s withdrawal. The @SenateGOP should give that bill a vote. https://t.co/i5FtQ0BhEA", "date": "2019-11-05 19:32:39"}, "87": {"text": "I’m glad to work with @RosaDeLauro on the #SchedulesThatWork Act to help workers build some economic security for themselves &amp; their families. https://t.co/RZZiIwdyfq", "date": "2019-11-05 16:56:41"}, "88": {"text": "I’m especially proud to recognize Deborah Sampson from Plympton, MA, who disguised herself as a man to fight in the Revolutionary War &amp; was the only woman to earn a Revolutionary Army military pension. Women veterans like Deborah Sampson should be honored for their service.", "date": "2019-11-05 15:43:47"}, "89": {"text": "Women veterans are tough, smart, &amp; have made incredible sacrifices for our country. I’m leading a bipartisan resolution with @LisaMurkowski, @SenMcSallyAZ, &amp; @SenatorTester urging the @USPS to issue a postage stamp series commemorating historic women vets. https://t.co/SOnflO5GVx", "date": "2019-11-05 15:43:47"}, "90": {"text": "The Trump administration will admit the lowest number of refugees ever – it’s heartless &amp; wrong. We can admit vulnerable populations fleeing persecution &amp; violence while keeping our country secure, healthy &amp; prosperous. It’s not an either/or proposition. https://t.co/dCGBzHK9ms", "date": "2019-11-04 19:57:25"}, "91": {"text": "My office found that a sanctioned Russian company with Putin ties received a tariff exemption, &amp; most exemptions go to foreign-owned companies. The tariff exclusion process is one more way the Trump admin works for big, well-connected, &amp; in many cases, foreign-owned companies.", "date": "2019-11-01 15:31:52"}, "92": {"text": "The @CommerceOIG report concluded: the Trump administration’s process for reviewing steel &amp; aluminum tariff exemptions “is neither transparent nor objective.” In fact, the decisions “give the appearance that the Department officials may not be impartial.”", "date": "2019-11-01 15:31:51"}, "93": {"text": "Starting last August, I asked the @CommerceOIG to investigate @CommerceGov’s seemingly arbitrary &amp; opaque process for exempting companies from Trump’s steel &amp; aluminum tariffs. Their new report back confirms: the process was rigged from the start. https://t.co/JbIm2lJ8S7", "date": "2019-11-01 15:31:51"}, "94": {"text": "I’m grateful for @Pwr4PuertoRico’s support of my bill to give Puerto Rico &amp; other disaster-stricken US territories a route to comprehensive debt relief &amp; a chance to get back on their feet. It’s time for Congress to pass this bill. https://t.co/IdbrTtcdxz", "date": "2019-10-30 23:20:31"}, "95": {"text": "Steven Menashi worked with @BetsyDeVosED to gut civil rights &amp; consumer protections for students while at Trump’s Education Department, &amp; @realDonaldTrump has rewarded him with a nomination to be a federal judge. The Senate should reject him. #StopMenashi https://t.co/JZPvGMVxPV", "date": "2019-10-30 21:08:30"}, "96": {"text": "I agree with @RepDebHaaland: the Chaco region is sacred &amp; must be protected for future generations. I’ve supported legislation in the Senate to do that. The House should pass the Chaco Cultural Heritage Area Protection Act today. #ProtectChaco #ProtectTheSacred https://t.co/lRVl2C1Cgn", "date": "2019-10-30 17:47:48"}, "97": {"text": "I join the Armenian American community in MA &amp; the rest of the Armenian diaspora in celebrating the House passage of a resolution recognizing the #ArmenianGenocide. I cosponsored S.Res.150 to recognize this tragedy. The Senate should pass it now. https://t.co/dV7FLTkyhb", "date": "2019-10-30 15:35:17"}, "98": {"text": "Sec. @stevenmnuchin1, you don’t work for Jamie Dimon &amp; your Wall St buddies – you work for the American people. Do your job to protect our economy, explain what went wrong in the markets, &amp; stop looking for excuses to roll back rules that help prevent another financial crisis.", "date": "2019-10-30 00:20:46"}, "99": {"text": "Unbelievable. Former big bank executive turned @USTreasury Secretary @stevenmnuchin1 hasn’t even offered an explanation for the recent overnight lending rate spike, but he’s already using it as an excuse to weaken the rules on giant Wall Street banks. https://t.co/pe3s1USMlu", "date": "2019-10-30 00:20:45"}, "100": {"text": "The fossil fuel industry &amp; their allies use armies of lawyers, lobbyists, front groups, &amp; trade associations to rig the rules for dirty polluters. Tune in now to watch the @SenDemsClimate hearing on how dark money is blocking action on the #ClimateCrisis. https://t.co/J9C6cezGaU", "date": "2019-10-29 19:29:40"}, "101": {"text": "Congrats to our Dedham teachers for voting to ratify a new contract yesterday after courageously going on strike. In MA &amp; all across this country, teachers are fighting back &amp; making their voices heard – &amp; they’re winning. That’s how we make real change. https://t.co/5IX5ODsxCZ", "date": "2019-10-29 13:11:07"}, "102": {"text": "Kay Hagan was a kind &amp; passionate public servant who fought from the heart for women, children, servicemembers, &amp; working people in NC &amp; across the country. My thoughts are with her husband Chip, their children &amp; family, &amp; the people of North Carolina. https://t.co/CJ1ud01sU5", "date": "2019-10-28 20:11:55"}, "103": {"text": "First responders in MA &amp; across the country go above &amp; beyond to save lives, keep us safe, &amp; help our communities rebuild. I’m proud to have led the bipartisan Senate resolution to honor first responders’ service &amp; sacrifices by designating today as #FirstRespondersDay. https://t.co/gp5pnfpOVc", "date": "2019-10-28 18:55:39"}, "104": {"text": "The @USArmy’s report suggests ways it can combat the #ClimateCrisis: reduce carbon emissions, invest in more research to be energy resilient, &amp; budget for climate risks. The @DeptofDefense must do more to adapt to climate change, &amp; I have a bill for that. https://t.co/pjbm4yVhbk", "date": "2019-10-26 17:23:08"}, "105": {"text": "A @USArmy report says the climate crisis will cause more frequent power outages, reduced access to water &amp; food, mass migration, disease outbreaks &amp; a greater chance of armed conflict. In other words, climate change is a public health &amp; ntl security risk. https://t.co/zRhVLRkyXP", "date": "2019-10-26 17:23:07"}, "106": {"text": "This Prescription Drug #TakeBackDay, dropoff centers are also accepting e-cigarettes &amp; vaping products to help fight the epidemic of youth tobacco use. Find a location near you: https://t.co/EQjCI2wMYR", "date": "2019-10-26 15:21:44"}, "107": {"text": "Millions of people get their wisdom teeth taken out or have minor surgery &amp; don’t use all the painkillers prescribed to them. Help fight the opioid epidemic by safely disposing any unused opioids in your medicine cabinet at a drop off location today: https://t.co/EQjCI2wMYR", "date": "2019-10-26 15:21:43"}, "108": {"text": "Taxpayers shouldn’t have to pay a heartless billionaire’s court fines for further punishing defrauded students. @BetsyDeVosED should be held personally accountable for violating court orders &amp; breaking the law.", "date": "2019-10-25 19:52:46"}, "109": {"text": "Secretary @BetsyDeVosED deserves to be held in contempt for violating a court order to stop collecting Corinthian students’ debt. But let’s be clear: a $100k fine paid for by @usedgov punishes taxpayers – not DeVos herself. https://t.co/1Ff3bZxCQ6", "date": "2019-10-25 19:52:46"}, "110": {"text": "I stand with our Dedham teachers who are courageously striking today for a fair contract with better pay. When teachers succeed, our children succeed. https://t.co/BKIkLEWpoe", "date": "2019-10-25 18:52:09"}, "111": {"text": "RT @OversightDems: @RepCummings Chairman @RepCummings introduced the CARE Act w/ @SenWarren to address the opioid crisis and “finally get t…", "date": "2019-10-25 01:56:35"}, "112": {"text": "Today our Senate office paid our respects to our friend and champion @RepCummings, who laid in state in the United States Capitol. His legacy of service befits this historic honor, &amp; his powerful voice will never be forgotten in these halls. https://t.co/SFOkrCvIEQ", "date": "2019-10-25 00:48:02"}, "113": {"text": "14 months after the @OIGatHHS recommended that @HHSgov recover at least $341,000 in taxpayer dollars that former Secretary Tom Price wasted on lavish travel, there’s no evidence HHS has done so. @PattyMurray, @RonWyden &amp; I want answers. https://t.co/EtmvglPrVJ", "date": "2019-10-24 20:58:02"}, "114": {"text": "Amazon Web Services knew – or should have known – that its servers used by @CapitalOne were vulnerable to SSRF attacks. @RonWyden &amp; I want the @FTC to investigate whether @awscloud’s role in the data theft of 100M Capital One customers broke federal law. https://t.co/KOL3gqgH86", "date": "2019-10-24 17:38:34"}, "115": {"text": "RT @RepJayapal: Proud to have @SenSherrodBrown and @SenWarren as partners on the #StudentsNotProfits Act.\n\nThe bill would protect students…", "date": "2019-10-23 23:52:56"}, "116": {"text": "Gwen Ifill was a talented journalist, a trailblazer for women of color, &amp; the pride of @SimmonsUniv &amp; Classical High School in Springfield, MA. I’m glad to see that she will be honored with a @USPS postage stamp next year. https://t.co/kTcdW5SF4O", "date": "2019-10-23 21:49:27"}, "117": {"text": "For-profit colleges suck down taxpayer dollars as they load students up with debt for worthless degrees. I support the #StudentsNotProfits Act with @SenSherrodBrown &amp; @RepJayapal to finally end this corruption &amp; stop subsidizing for-profit colleges’ scams. https://t.co/8BDpcIdrJ1", "date": "2019-10-23 19:50:33"}, "118": {"text": "I’ve spent years fighting side-by-side with our fearless @MassAGO Maura Healey to help MA students scammed by Corinthian Colleges. And we're going to stay in this fight until @BetsyDeVosED &amp; @usedgov follow the law &amp; cancel every last Corinthian student’s loans. https://t.co/4FkNs2iW6u", "date": "2019-10-22 23:49:55"}, "119": {"text": "RT @SenatorTomUdall: Today @SenDuckworth, @SenWarren, @SenBlumenthal and I demanded the Trump Org. provide detailed, transparent info on Tr…", "date": "2019-10-22 22:15:21"}, "120": {"text": "I’m concerned that big banks are using short-term lending market volatility to pressure regulators to weaken the financial rules that protect our economy. @StevenMnuchin1 should explain why the govt needed to step in for the 1st time since the 2008 crisis. https://t.co/GE8bbAF50h", "date": "2019-10-22 20:32:29"}, "121": {"text": "RT @DerrickNAACP: For @realDonaldTrump to compare the painful history of #lynching to impeachment is obscene and insulting. We must all rem…", "date": "2019-10-22 19:12:22"}, "122": {"text": "My bill to #StopWallStreetLooting would hold private equity firms responsible for their companies – including in the health industry. And Congress should pass #MedicareForAll so nobody goes broke paying a medical bill that pads the pockets of insurance execs &amp; Wall St bankers.", "date": "2019-10-21 17:31:33"}, "123": {"text": "Almost 2/3 of US hospitals outsource physician staffing, many to companies owned by private equity firms. @RepMarkPocan, @RepLloydDoggett &amp; I want to know more about the role those firms play in the sharp rise in surprise out-of-network medical bills.", "date": "2019-10-21 17:31:32"}, "124": {"text": "Nobody having a heart attack or stroke picks their ambulance or ER doc. But when a hospital outsources its physician staffing or ambulance services to a private-equity-owned company, patients can get stuck with outrageous medical bills. It's obscene. https://t.co/erxknVm9sw", "date": "2019-10-21 17:31:32"}, "125": {"text": "Sec. @BetsyDeVosED has given a free pass to every swindler &amp; crook trying to make a buck off America’s students &amp; teachers. Now she’s choking the program designed to help keep teachers from getting crushed by decades of debt. I'll say it again, Sec. DeVos: do your job or resign.", "date": "2019-10-20 14:25:25"}, "126": {"text": "I’ll give you one guess who’s responsible for obstructing student debt relief for teachers &amp; other public servants. (Hint: it’s the Secretary of Education who doesn’t believe in public education.) https://t.co/KH0UBu1nFY", "date": "2019-10-20 14:25:25"}, "127": {"text": "But most borrowers never got the help. Last month, @USGAO reported @usedgov is STILL rejecting 99% of Temporary Expanded PSLF applications. The Trump admin has only spent 3.8% of the emergency funding Congress set aside to help public service borrowers. https://t.co/ssFYyVS0Cy", "date": "2019-10-20 14:25:24"}, "128": {"text": "I’ve been fighting to fix the PSLF problem from the moment I heard about it – &amp; I led the expansion of PSLF funding by $700 million over 2 years to forgive the student loan balances of people caught in this mess &amp; enrolled in the wrong program. https://t.co/slRcfRQGzZ", "date": "2019-10-20 14:25:24"}, "129": {"text": "Starting in 2007, our country made a promise to public servants: pay your student loans for 10 years &amp; the balance would be wiped out. But as the 10-year point hit, people who thought they were enrolled in PSLF discovered they weren’t. It’s a nightmare. https://t.co/bjJzLY63NV", "date": "2019-10-20 14:25:24"}, "130": {"text": "Secretary @BetsyDeVosED &amp; the Trump admin wrecked the Public Service Loan Forgiveness Program for teachers &amp; other public servants. @usedgov needs to explain why borrowers aren’t getting the help Congress made available &amp; how they're planning to fix this. https://t.co/KKb20Ga3PA", "date": "2019-10-20 14:25:23"}, "131": {"text": "This is simple: if @Navient knows that @usedgov is too scared or captured to punish it for cheating students, then guess what? It’s going to keep cheating students while @BetsyDeVosED blocks &amp; tackles for them. It’s time to finally end this cycle &amp; #FireNavient.", "date": "2019-10-19 15:02:40"}, "132": {"text": "@Navient @usedgov New evidence from a @CFPB lawsuit shows @Navient officials knew it was scamming students &amp; didn't stop it. @SenBlumenthal &amp; I told @BetsyDeVosED &amp; @usedgov they have no excuse: they can't throw more taxpayer money at Navient &amp; renew their $200M contract. https://t.co/nf9wwdrb50", "date": "2019-10-19 15:02:40"}, "133": {"text": "Student loan giant @Navient (formerly Sallie Mae) has a history of cheating students &amp; taxpayers more than a decade long. For years, I’ve pushed Republicans AND Democrats at @usedgov to hold Navient accountable, but the dept basically told me Navient is \"Too Big to Fail.\" https://t.co/sWtHQtymN2", "date": "2019-10-19 14:59:59"}, "134": {"text": "Good luck to everyone participating in the Head of the Charles this weekend! And special thanks to all of the volunteers &amp; organizers who make this weekend so special for all of us in MA &amp; our visitors from across the country &amp; around the world. #HOCR55 https://t.co/WoBEk8il9G", "date": "2019-10-19 14:00:03"}, "135": {"text": "Transgender migrants &amp; asylum seekers have faced appalling abuse &amp; neglect. @SenatorBaldwin &amp; I are calling on the Trump administration to reverse policies that are harming these vulnerable populations. https://t.co/MEcrGdhjHW", "date": "2019-10-18 21:16:01"}, "136": {"text": "Happy birthday, Old Ironsides &amp; the @USNavy! It’s an honor to have our country’s oldest commissioned ship in the Charlestown Navy Yard every day – but especially today. https://t.co/0qFVjcVSaw", "date": "2019-10-18 20:32:02"}, "137": {"text": "Workers of color – especially women – are more likely to have unpredictable work schedules, face cancelled shifts, work consecutive closing &amp; opening shifts, &amp; be part-time workers. #SchedulesThatWork is about basic dignity &amp; fairness for all workers. https://t.co/KjCdRBXZO0", "date": "2019-10-18 00:15:47"}, "138": {"text": "@rosadelauro The #SchedulesThatWork Act would set some ground rules for workers’ schedules:\n🗓️ Workers should get their schedule 2 weeks in advance\n🗓️ No retaliation against workers who ask for schedule changes\n🗓️ Workers have a right to rest between shifts", "date": "2019-10-18 00:15:47"}, "139": {"text": "More than half of hourly workers get their work schedules with less than a week’s notice, making it tough to go to school, keep child care, &amp; pay the bills. I’m reintroducing the #SchedulesThatWork Act with @RosaDeLauro for some economic security for working families. https://t.co/C2UrLYsCiN", "date": "2019-10-18 00:14:25"}, "140": {"text": "RT @SpeakerPelosi: When Chairman Elijah Cummings spoke, America listened. He pushed each and every one of his colleagues to work for a high…", "date": "2019-10-17 22:34:30"}, "141": {"text": "Instead of strengthening anti-discrimination rules to protect homeowners &amp; renters, @HUDgov is trying to make it nearly impossible for families of color to fight back against lenders &amp; landlords. Read my op-ed on why all of us should be in this fight. https://t.co/RXlbrp2UN9", "date": "2019-10-17 18:05:10"}, "142": {"text": "Whenever anyone would ask @RepCummings why we should keep fighting, even when the odds were against us, he’d always say: “We don’t have the right to be silent.” We honor his memory by staying in the fight and keeping his hope alive. Rest in power, Elijah. https://t.co/dz4SDcPnEd", "date": "2019-10-17 15:17:39"}, "143": {"text": ".@RepCummings was a fearless leader for social, economic, &amp; racial justice, a giant for the people of Baltimore, &amp; my dear friend &amp; longtime partner. Sending my love to his beloved wife Maya, his children, his incredible staff, &amp; everyone mourning the loss of our champion.", "date": "2019-10-17 15:17:24"}, "144": {"text": "Government can be a powerful force for good – but only when it works for the people. It’s time to end lobbying as we know it &amp; padlock the revolving door between our government &amp; giant corporations. And I’ve got a bill for that. #endcorruptionnow https://t.co/Hsu6REMyF6", "date": "2019-10-15 23:17:25"}, "145": {"text": "RT @RepDebHaaland: #IndigenousPeoplesDay is also about honoring the generations who will come after us, so that have the opportunity to ach…", "date": "2019-10-14 23:13:21"}, "146": {"text": "For most of America’s history, when our companies did better, our workers did better – and America built a thriving middle class. The Accountable Capitalism Act will help realign our skewed market incentives so companies &amp; workers can once again do well together.", "date": "2019-10-11 19:35:40"}, "147": {"text": "181 CEOs signed a @BizRoundtable non-binding pledge to account for workers &amp; consumers in their decisions. I’m urging companies like @Amazon, @Walmart, @GM, @JPMorgan, @ATT, &amp; @Comcast to keep that promise by supporting our Accountable Capitalism reforms. https://t.co/QfEynT5ZcK", "date": "2019-10-11 19:35:39"}, "148": {"text": "It also requires billion-dollar companies to obtain a federal charter requiring directors to consider the interests of ALL their stakeholders, including employees, customers, &amp; their communities. That charter can be revoked if a company has egregious &amp; repeated illegal conduct.", "date": "2019-10-11 19:35:39"}, "149": {"text": "The Accountable Capitalism Act holds businesses accountable to their employees, not just shareholders:\n✅Requires workers to elect 40% of board \n✅Restricts board &amp; execs’ company stock sales\n✅Requires 75% of execs &amp; shareholders' approval for political expenditures", "date": "2019-10-11 19:35:39"}, "150": {"text": "Year after year, corporate profits soar for executives &amp; shareholders – but workers’ wages barely budge. I’m reintroducing my Accountable Capitalism Act with @repbenraylujan to empower workers &amp; help fix this fundamental problem with our economy. https://t.co/Chp7f0LJi3", "date": "2019-10-11 19:35:38"}, "151": {"text": "I worked with @RepPressley, @SenMarkey, &amp; more than 100 colleagues to push @USCIS to reverse its decision to end some deferred action, including for sick children. Thanks, @RepCummings, for working to get answers about the Trump administration’s cruel, immoral decision. https://t.co/fPc64YsqvV", "date": "2019-10-11 17:51:03"}, "152": {"text": "Happy National #ComingOutDay! I’ll never stop fighting for a country where everyone feels safe to be who they are and love who they love. https://t.co/hk26HgNExS", "date": "2019-10-11 15:35:38"}, "153": {"text": "Glad to be a strong federal partner to build the roads, bridges, &amp; basic infrastructure we need to strengthen our economy &amp; protect public safety. We’re in this fight — shoulder to shoulder — all the way. https://t.co/kLw6fsqxS5", "date": "2019-10-10 19:00:00"}, "154": {"text": "A natural gas compressor station in Weymouth could be a health &amp; safety nightmare for South Shore families. @SenMarkey, @RepStephenLynch &amp; I urge @Enbridge to listen to the communities &amp; abandon their plans to build a compressor station in Massachusetts. https://t.co/szI3Ye5w4d", "date": "2019-10-10 18:17:57"}, "155": {"text": "The student debt crisis will only get worse – especially for students of color – unless Congress steps up to solve it. I’m honored to work side-by-side with @WhipClyburn to tackle this crisis head-on. #cancelmydebt https://t.co/cLqGN7Sv3I", "date": "2019-10-10 15:01:43"}, "156": {"text": "Black Americans face the worst effects of the student debt crisis. Many still owe more than 100% of their loan balance 12 years college, even with a degree in hand. My #cancelmydebt bill with @WhipClyburn takes meaningful steps to close the racial wealth gap. https://t.co/p7psYg8OSV", "date": "2019-10-10 15:01:33"}, "157": {"text": "I was delighted to join @WhipClyburn at his alma mater @SCSTATE1896 for a town hall on our bill to cancel student debt for 42 million Americans. #cancelmydebt https://t.co/m3RRSP8mRQ", "date": "2019-10-10 15:01:26"}, "158": {"text": "RT @WhipClyburn: I am thrilled to be back at my alma mater @SCSTATE1896 with @SenWarren to discuss our Student Loan Debt Relief Act https:/…", "date": "2019-10-10 02:32:04"}, "159": {"text": ".@usedgov needs to follow the law &amp; cancel the student loans of scammed Corinthian Colleges students. And if @BetsyDeVosED wants to work for predatory for-profit colleges, she should resign &amp; find herself a new job.", "date": "2019-10-09 19:55:05"}, "160": {"text": "A federal judge was “astounded” by @BetsyDeVosED’s treatment of student borrowers. She said “At best it is gross negligence, at worst it’s an intentional flouting” of judicial orders to help students.", "date": "2019-10-09 19:55:04"}, "161": {"text": "Secretary @BetsyDeVosED is such a failure at @usedgov that she may be held in contempt for refusing to follow the law &amp; stop punishing scammed students. Think about that: she'd rather risk sanctions or even jail than do her job to help America's students. https://t.co/GkWrL5v2bx", "date": "2019-10-09 19:55:03"}, "162": {"text": "Nobody fought harder to level the playing field for working people than my friend MarDee Xifaras. My heart goes out to her family, friends, &amp; the countless people touched by her wisdom, kindness, &amp; persistence. She will be deeply missed. https://t.co/M3y6nV1Gd2", "date": "2019-10-09 13:54:39"}, "163": {"text": "In July, I joined @SenJeffMerkley &amp; my colleagues in Congress on an amicus brief in support of equal rights for LGBTQ employees. Nobody should face discrimination at work — or anywhere else — for who they are or who they love. https://t.co/NhH6ZlINdH", "date": "2019-10-08 21:35:56"}, "164": {"text": "I’m deeply grateful to Pleasant Hill Missionary Baptist Church &amp; my friend Rev. Miniard Culpepper for their dedication &amp; service to our communities in Boston. Congrats on your 80th anniversary, &amp; I look forward to celebrating many more milestones to come! https://t.co/KrGkuETBHd", "date": "2019-10-07 23:00:32"}, "165": {"text": "Congrats to @DanaFarber, @BrighamWomens &amp; @HarvardMed Dr. William Kaelin, Jr. for winning the @NobelPrize in Medicine. His groundbreaking work is a reminder of the importance of investing in medical research for the next big breakthrough to save lives. https://t.co/HHSR9234sw", "date": "2019-10-07 20:57:47"}, "166": {"text": "I joined my colleagues in Congress on an amicus brief to the Supreme Court in support of DACA. Dreamers are woven into the fabric of our country, &amp; they belong here. @realDonaldTrump was wrong – legally &amp; morally – to target this deeply important program. https://t.co/8bd4hnZRd7", "date": "2019-10-06 15:08:53"}, "167": {"text": "The @CorpsNewEngland recommendation to replace the Sagamore &amp; Bourne Bridges is good news for the Cape &amp; Islands. Updating our infrastructure will help grow our economy &amp; enhance public safety. I’m committed to seeing this important project move forward. https://t.co/vbNLwxHMp4", "date": "2019-10-04 16:59:22"}, "168": {"text": "RT @RepAOC: Proud to join @SenWarren and @RepMarkPocan in the fight to hold private equity firms responsible. We cannot continue to put pro…", "date": "2019-10-02 23:08:28"}, "169": {"text": "RT @repmarkpocan: Private companies should NOT profit off the incarceration of Black &amp; Latinx communities.\n\nThat's why @SenWarren, @RepAOC…", "date": "2019-10-02 23:02:16"}, "170": {"text": "A year ago, the Saudi govt murdered journalist Jamal Khashoggi. There’s been no punishment for those who ordered this crime &amp; the Trump admin ignores Congress's demands for accountability. We honor his memory by fighting for justice &amp; human rights. https://t.co/AajGqOy3sZ", "date": "2019-10-02 17:51:34"}, "171": {"text": "My friend @SenSanders has always been a strong partner in the Senate. Wishing him a speedy recovery so he can get back in the fight.", "date": "2019-10-02 16:02:25"}, "172": {"text": "I’m glad investors are speaking out on climate change. @SenWhitehouse is right: their companies shouldn't hide behind groups like @USChamber that rig rules for polluters. My Climate Risk Disclosure Act will help hold corporations accountable for their role in the #climatecrisis. https://t.co/c13Crb1h8u", "date": "2019-10-01 22:51:48"}, "173": {"text": "My #StopWallStreetLooting bill would hold private equity firms responsible for their companies. And we should abolish private prisons &amp; profit incentives that pervert the goal of our justice system.", "date": "2019-10-01 21:25:59"}, "174": {"text": "And the two largest private correctional medical care providers – both owned by private equity firms – have been sued about 1500 times over the past 5 years for “neglect, malpractice, and, in dozens of cases, wrongful injury or death.”", "date": "2019-10-01 21:25:58"}, "175": {"text": "Privatization &amp; consolidation of prison food services means that private equity firms can make big bucks serving food with mold &amp; maggots – &amp; when incarcerated people decide to buy their own food, private equity profits off the commissaries. It’s all a racket.", "date": "2019-10-01 21:25:58"}, "176": {"text": "Private equity’s push into private prisons, detention centers, &amp; prison services companies has helped create monopolies that squeeze families. Think about it: when there’s no competition for prison phone services, a 15-minute call home can cost $25.", "date": "2019-10-01 21:25:57"}, "177": {"text": "Our criminal justice system lets private equity firms rake in billions at the expense of incarcerated people, detainees, their families, &amp; taxpayers. @RepMarkPocan, @RepAOC &amp; I are investigating private equity firms profiteering off prison services. https://t.co/kYL4YaD1JU", "date": "2019-10-01 21:25:57"}, "178": {"text": ".@RepPressley, @RepAOC, &amp; @RepBarbaraLee are right: everyone is entitled to high quality reproductive health care, &amp; making that a reality starts with repealing the Hyde Amendment. #BeBoldEndHyde https://t.co/OZAAeTx3jJ", "date": "2019-09-30 20:48:21"}, "179": {"text": "We can admit more refugees while keeping our country secure. I joined @SenJeffMerkley &amp; @SenMarkey to demand the Trump admin not slam the door on refugees. America should remain a beacon of hope to vulnerable families around the world. https://t.co/l2wKeETJ4p", "date": "2019-09-30 16:33:24"}, "180": {"text": "The United States has long been a humanitarian leader by welcoming refugees fleeing persecution &amp; violence. But @realDonaldTrump slashed the number of refugees the US will accept to historic lows – &amp; now he’s cutting further. It's heartless &amp; wrong. https://t.co/0JOg8qQDzw", "date": "2019-09-30 16:33:24"}, "181": {"text": "Historically black colleges &amp; universities can’t wait weeks or months for the @SenateGOP to fund their schools – and they shouldn’t be used as bargaining chips. @SenAlexander needs to stop the games &amp; fund our HBCUs &amp; other minority-serving colleges NOW.  https://t.co/YJEW2wfNvk", "date": "2019-09-27 16:19:34"}, "182": {"text": ".@SenMarkey, @RepLoriTrahan &amp; I are fighting to pass the Leonel Rondon Pipeline Safety Act so gas companies prioritize our communities’ safety. And we’re demanding answers from @ColumbiaGasMA &amp; @NiSourceInc on why they keep placing our residents &amp; first responders at risk.", "date": "2019-09-27 15:51:48"}, "183": {"text": "Just three days ago, the NTSB released a damning report that drew a direct link between weak engineering management at @NiSourceInc &amp; @ColumbiaGasMA &amp; last year’s devastating Merrimack Valley gas explosions. https://t.co/wJ77wXYkBH", "date": "2019-09-27 15:51:48"}, "184": {"text": "A major gas leak was reported in Lawrence, &amp; over 300 residents are being evacuated. We’re deeply grateful to Lawrence’s first responders &amp; Mayor @danrivera01843 for their quick action to keep residents safe. https://t.co/yuubAfbqvH", "date": "2019-09-27 15:51:47"}, "185": {"text": "RT @MassEMA: Per officials in #Lawrence:\n-100+ people evacuated.\n-Gas has been shut off. There have not been any fires or explosions.\n-Arli…", "date": "2019-09-27 13:10:19"}, "186": {"text": "RT @MassEMA: MEMA staff are on scene in #Lawrence supporting local officials after an overnight gas leak\n\nArlington Middle School (150 Arli…", "date": "2019-09-27 13:10:03"}, "187": {"text": "Cape Cod residents feel the #climatecrisis every day: erosion that threatens whole neighborhoods, a decimated fishing industry, &amp; superstorms that could devastate the region. Read the @BostonGlobe’s powerful new reporting on climate change on the Cape. https://t.co/K2dUi3hb8i", "date": "2019-09-26 23:13:51"}, "188": {"text": "11 people have contracted #EEE in MA &amp; 4 have died. @SenMarkey &amp; I have asked @NIAIDNews for an update on federal research into this rare mosquito-borne virus with no specific treatment, &amp; everyone in high-risk areas should take care to protect themselves &amp; their loved ones. https://t.co/bBiqfAI50b", "date": "2019-09-26 21:07:40"}, "189": {"text": "The President asked a foreign govt to interfere in our elections. White House officials tried to cover it up &amp; suppress this whistleblower. That’s a threat to our democracy. The House must do what the Constitution demands &amp; vote on articles of impeachment.\nhttps://t.co/Ey9nkWTQHA", "date": "2019-09-26 20:25:50"}, "190": {"text": "The President told a foreign govt to do him a favor &amp; work with his personal lawyer &amp; the AG to investigate a political opponent. Read the \"transcript.\" For the safety &amp; integrity of our democracy, Congress must begin impeachment proceedings without delay. https://t.co/e1Pw10TlyX", "date": "2019-09-25 16:39:23"}, "191": {"text": "The workers at Fidelity House provide essential care to our friends, family, and neighbors in Lawrence. They shouldn’t have to live in poverty. I support the members of @SEIU509 as they fight for a fair contract with higher wages, #equalpay, and better working conditions. https://t.co/zoxEhZqdl1", "date": "2019-09-24 23:19:00"}, "192": {"text": "I said it on the floor of the US Senate in May &amp; I’ll say it again: Congress must fulfill its Constitutional duty &amp; begin impeachment proceedings against the President. Nobody is above the law – not even the President of the United States. https://t.co/S5uNJyiQNK", "date": "2019-09-24 17:32:15"}, "193": {"text": "RT @SenJeffMerkley: It shouldn’t take an act of political courage to acknowledge the patently obvious fact that if a President corrupts US…", "date": "2019-09-24 15:52:07"}, "194": {"text": "Title X has provided birth control, cancer screenings, HIV tests, &amp; other basic health care services to nearly 4 million Americans. The 9th Circuit should stop the Trump admin’s unlawful crusade to gut Title X &amp; control doctors &amp; patients. #SaveTitleX https://t.co/M4FhYUQd5S", "date": "2019-09-23 21:21:23"}, "195": {"text": "“The Paycheck Fairness Act that the House passed is going to be a big step towards addressing the gender pay gap.” -@RepDavids\n\n@SenateMajLdr, help close the pay gap – especially for women of color – &amp; give that bill a vote. #NativeWomenEqualPayDay https://t.co/fYxA6NGq7H", "date": "2019-09-23 20:53:39"}, "196": {"text": ".@RepDebHaaland is right: “The fact that Native women only make 58 cents on the dollar compared to white men in similar positions is absolutely unacceptable.” #NativeWomenEqualPayDay https://t.co/vtrsjVWJAi", "date": "2019-09-23 20:53:39"}, "197": {"text": "The fraud at @WellsFargo &amp; other giant banks won’t stop until executives like John Stumpf know that they’ll be hauled out in handcuffs for cheating customers. I’ve got a bill for that to hold Wall Street executives personally accountable when their banks break the law.", "date": "2019-09-20 23:27:09"}, "198": {"text": "Three years after that John Stumpf hearing, @WellsFargo is STILL scamming customers. I’m demanding answers from Wells Fargo &amp; our federal regulators about why these deep structural problems remain at the bank. https://t.co/EHoeRAwTiZ", "date": "2019-09-20 23:27:09"}, "199": {"text": "Six days after we called on the @USOCC &amp; @CFPB to fire Tim Sloan, he stepped down as @WellsFargo’s CEO. I told Comptroller Otting to use his agency’s regulatory power to review Sloan’s successor, &amp; he agreed. https://t.co/sgwC6ien9C", "date": "2019-09-20 23:27:09"}, "200": {"text": "Tim Sloan said the bank changed, but we weren’t fooled. @WellsFargo kept right on scamming its customers on mortgages, car loans, money laundering – too much to fit in a tweet. So @SenSherrodBrown &amp; I told the @CFPB &amp; @USOCC to use their power to fire him. https://t.co/rLmhICfWLy", "date": "2019-09-20 23:27:08"}, "201": {"text": "Then I urged the new Fed Chair Jerome Powell to hold a public vote of the Federal Reserve Board before lifting @WellsFargo’s growth cap, &amp; he agreed. https://t.co/JeetsvMWtX", "date": "2019-09-20 23:27:08"}, "202": {"text": "I also urged Janet Yellen to use her powers as Fed Chair to hold @WellsFargo accountable. In her final act as Fed Chair, she froze @WellsFargo’s growth until it cleaned up its act &amp; pushed out 4 of the board members responsible. https://t.co/hEhPVy6GoG", "date": "2019-09-20 23:27:08"}, "203": {"text": "When @WellsFargo replaced John Stumpf with Tim Sloan, another senior Wells Fargo executive during the fake accounts scandal, I told him to his face that he should be fired.https://t.co/MIhiVImbZh", "date": "2019-09-20 23:27:07"}, "204": {"text": "@WellsFargo John Stumpf’s hearing on the @WellsFargo fake accounts scandal was a powerful moment for Wall Street accountability. But let’s just be clear: it was just the start of our work to stop this fundamentally broken bank from scamming its customers.", "date": "2019-09-20 23:27:07"}, "205": {"text": "Three years ago today, I told @WellsFargo CEO John Stumpf that he should resign. (He did.) https://t.co/PjVLffUuwg", "date": "2019-09-20 23:21:53"}, "206": {"text": "Way to go, Boston! I’m proud of our students from across MA &amp; around the country for leading this fight against the climate crisis. It’s past time we take bold action to tackle climate change head on for future generations. #ClimateStrike #MAClimateStrike #BostonClimateStrike https://t.co/W9H8kiba0D", "date": "2019-09-20 21:27:12"}, "207": {"text": "The Trump administration failed the people of Puerto Rico, &amp; I’ve pushed @FEMA, @HUDgov, @DHSgov, @ENERGY, @OMBPress, @USDA, &amp; @FOMBPR for accountability. We will not forget the victims of #HurricaneMaria. Learn more about my work for Puerto Rico here: https://t.co/lBAycRJ24n", "date": "2019-09-20 20:59:36"}, "208": {"text": "And I have kept up oversight of @FEMA's Hurricane Maria contracting efforts, which have been part of the tragic mess that was the Administration's Puerto Rico disaster response. An investigation I requested revealed that FEMA did not follow federal procurements laws &amp; regs. https://t.co/fJZJqoxrl3", "date": "2019-09-20 20:59:36"}, "209": {"text": "Back in 2016, I opposed PROMESA, which imposed @FOMBPR on Puerto Rico. And since Hurricane Maria, I have repeatedly pushed that Board on its slashes to government services, its friendliness to Wall Street creditors, &amp; its conflicts of interest. https://t.co/05KWYPhjXV", "date": "2019-09-20 20:59:33"}, "210": {"text": "In June, I cosponsored a bill to end the discriminatory double standards in the way Medicare &amp; Medicaid are administered in the US territories. https://t.co/R39kdIh2m3", "date": "2019-09-20 20:59:31"}, "211": {"text": "With @SenatorMenendez &amp; Rep. @NydiaVelazquez, I questioned @FEMA about delays rebuilding the hospital on the island of Vieques, that served 9,000 US citizens &amp; was destroyed in Hurricane Maria. The next week, the agency confirmed it would be rebuilt. https://t.co/B2J1bcFIeB", "date": "2019-09-20 20:59:31"}, "212": {"text": "I also reintroduced my bill with @RepEspaillat to make it easier for survivors of natural disasters like Hurricane Maria to receive housing assistance from @FEMA &amp; @HUDgov. https://t.co/AjmQ1yGohP", "date": "2019-09-20 20:59:30"}, "213": {"text": "In May, I reintroduced my bill, the US Territorial Relief Act, to give disaster-stricken US territories like Puerto Rico a path to comprehensive debt relief so they can recover &amp; rebuild with dignity. https://t.co/14D4A5eVDG", "date": "2019-09-20 20:59:30"}, "214": {"text": "In February, I introduced my bill with Rep. @NydiaVelazquez to prevent @realDonaldTrump from using disaster relief funds to fund his border wall. https://t.co/XinveH6Mc3", "date": "2019-09-20 20:59:30"}, "215": {"text": "After I investigated reports that the Administration was using the government shutdown as an excuse to stall aid to Puerto Rico, @HUDgov confirmed that the shutdown delayed billions of dollars of disaster relief funds for the island. https://t.co/XHEMuLym4i", "date": "2019-09-20 20:59:29"}, "216": {"text": "In January, I reintroduced a bill with Sen. @GillibrandNY &amp; Rep. @NydiaVelazquez to establish a 9/11-style independent commission to investigate the federal response to the hurricanes in Puerto Rico. https://t.co/0rjh5Q97Zd", "date": "2019-09-20 20:59:29"}, "217": {"text": "Two years ago today, Hurricane Maria devastated Puerto Rico &amp; the US Virgin Islands. I’m still persisting in this fight to ensure our government keeps its responsibility to help these US citizens recover &amp; thrive. https://t.co/UMVIzELMEv", "date": "2019-09-20 20:52:24"}, "218": {"text": "I’m glad the Senate passed my bill with @SenTomCotton to ensure the POW/MIA flag is always displayed with the US flag in the Capitol, Vietnam Vets Memorial &amp; other federal properties. I’m working to get it passed in the House &amp; signed by the President. https://t.co/BHbHMROdbx", "date": "2019-09-20 18:29:56"}, "219": {"text": "Thousands of American service members have been imprisoned &amp; are still missing in action from past conflicts. On #POWMIARecognitionDay we honor those who served and those who have not returned home. They must never be forgotten, &amp; I have a bill for that.", "date": "2019-09-20 18:29:56"}, "220": {"text": "On this second anniversary of #HurricaneMaria, I’m still fighting for our federal government to treat the US citizens on Puerto Rico with the respect they deserve. https://t.co/BxL5DSJI4J", "date": "2019-09-20 15:54:10"}, "221": {"text": "Incredible news: Our Senate office just received word that @USCIS will resume consideration of some deferred action requests, including medical deferred action for sick children. This is a powerful victory for people across the country who fought back &amp; made their voices heard. https://t.co/OQbXC2CkhG", "date": "2019-09-19 21:38:49"}, "222": {"text": "Dr. Emily Clyburn was a tireless voice for justice &amp; opportunity. My prayers are with @WhipClyburn, their family, &amp; the people of South Carolina for their loss. https://t.co/SOewI5SC8C", "date": "2019-09-19 19:24:28"}, "223": {"text": "RT @repmarkpocan: Students shouldn’t suffer when private equity firms close a college or engage in deceptive practices to attract new stude…", "date": "2019-09-18 20:44:25"}, "224": {"text": "We should be investing in our Historically Black Colleges &amp; Universities, not treating them &amp; their funding like political footballs. Senate Republicans need to stop the games &amp; pass critical funding for HBCUs this week. https://t.co/q5KXxbLdOk", "date": "2019-09-18 20:26:26"}, "225": {"text": "I’ve got a bill that would put private equity firms on the hook for the decisions made by the companies they control, including for-profit colleges. It’s long past time to hold these firms accountable for steering colleges into a ditch &amp; scamming students.", "date": "2019-09-17 23:40:40"}, "226": {"text": "In industry after industry, private equity firms have stripped companies of assets, loaded them with debt, extracted $$$ &amp; skipped away when the bets went bad. Students &amp; taxpayers deserve to understand the shadowy role these firms play in an industry already fraught with abuse.", "date": "2019-09-17 23:40:40"}, "227": {"text": "35% of for-profit students are enrolled in private equity-owned schools, &amp; those schools have higher tuition, more student borrowing, &amp; lower grad rates. Their business isn't educating students – it's sucking down federal student aid, which makes up nearly all of their revenue.", "date": "2019-09-17 23:40:40"}, "228": {"text": "Predatory for-profit colleges often load students with debt for useless degrees. They’re the worst, &amp; for-profit schools owned by private equity firms are the worst of the worst. So @RepMarkPocan &amp; I are investigating private equity takeovers of colleges. https://t.co/v4TYSFN0yZ", "date": "2019-09-17 23:40:39"}, "229": {"text": "Senators’ thoughts &amp; prayers aren’t stopping the mass shootings, but our votes can. Time’s up, @SenateGOP. Stand up to the gun industry &amp; give these bills a vote.", "date": "2019-09-17 23:05:36"}, "230": {"text": "The majority of Americans support common sense gun safety laws &amp; are urging the Senate to take action. But @SenateMajLdr McConnell &amp; the @SenateGOP are too scared of the @NRA to act. Let's call this out for what it is: corruption, plain &amp; simple.", "date": "2019-09-17 23:05:36"}, "231": {"text": "Kids are being slaughtered in their classrooms. Mothers, fathers, brothers, &amp; sisters are being gunned down in places of worship, homes, clubs, supermarkets, &amp; streets. And day after day, tragedy after tragedy, we're still here begging the @SenateGOP to do something.", "date": "2019-09-17 23:05:36"}, "232": {"text": "The game is up: Amazon pretends to be a neutral marketplace platform, but it bulldozes competition by juicing the search results for its own products. Reports say even Amazon’s own lawyers identify this as an antitrust problem. The @FTC must take action. https://t.co/Gf95jDADUO", "date": "2019-09-17 14:28:49"}, "233": {"text": "RT @MassAGO: Out of business is exactly where Purdue Pharma belongs. But if they think they can use bankruptcy to escape accountability, af…", "date": "2019-09-16 18:43:31"}, "234": {"text": "Hurricane Dorian devastated the Bahamas, but the Trump administration made the heartless decision not to grant Temporary Protected Status to impacted Bahamians. I joined @SenatorMenendez in introducing a bill to undo the administration’s immoral decision. https://t.co/aJ8WePEd03", "date": "2019-09-14 14:23:04"}, "235": {"text": "Rev. Michael Haynes was a pillar of faith &amp; justice for the people of Boston. Bruce &amp; I send our prayers to his loved ones, Twelfth Baptist Church, &amp; the countless people touched by his kindness &amp; leadership in our community. https://t.co/ta8H4MWQjR", "date": "2019-09-14 13:37:32"}, "236": {"text": "I’m proud of our Boston &amp; Springfield students for standing up to the gun lobby to end gun violence. Our students are leading the fight to keep our schools &amp; streets safe, &amp; our government must follow their lead. https://t.co/fr7PjhiawJ", "date": "2019-09-13 20:49:25"}, "237": {"text": "RT @RepLoriTrahan: Today we gathered to dedicate a square in #Lawrence in remembrance of Leonel Rondon, who was taken from us far too soon.…", "date": "2019-09-13 20:42:12"}, "238": {"text": "RT @SenMarkey: One year ago today, homes were destroyed, lives were upended, and we lost Leonel Rondon in the tragic and totally preventabl…", "date": "2019-09-13 20:39:49"}, "239": {"text": "Amazon has looked the other way while its contract delivery workers are forced into unsafe vehicles &amp; given dangerous workloads. @SenBlumenthal, @SenSherrodBrown, &amp; I want Amazon to explain this repeated disregard for workers’ rights &amp; safety. https://t.co/LH5eaOhe2Z", "date": "2019-09-13 17:54:05"}, "240": {"text": "Congress should pass @SenMarkey &amp; @RepLoriTrahan’s  Leonel Rondon Pipeline Safety Act to prevent disasters like the @ColumbiaGasMA explosions. And we should pass my Accountable Capitalism Act to force companies like @NiSource to pay attention to workers’ &amp; communities' interests.", "date": "2019-09-13 16:40:11"}, "241": {"text": "We’ve seen this pattern repeatedly: when corporate execs cut corners &amp; hurt consumers, they leave taxpayers &amp; communities to clean up the mess. Merrimack Valley small businesses are still digging out of a financial hole from repairs &amp; lost customers. https://t.co/7rv6fWrsK2", "date": "2019-09-13 16:40:10"}, "242": {"text": "The @NTSB blamed the Merrimack Valley gas explosions squarely on @ColumbiaGasMA  &amp; @NiSourceInc. But when we asked their executives about \"personal responsibility\" at @SenMarkey’s hearing, we heard nobody got fired. A young man died, so they probably wouldn’t get an annual bonus.", "date": "2019-09-13 16:40:10"}, "243": {"text": "One year ago, the @ColumbiaGasMA explosions destroyed Merrimack Valley homes &amp; businesses &amp; tragically killed a young man. Mayor @danrivera01843 &amp; I wrote to the @EagleTrib about what must be done to prevent a disaster like this from ever happening again. https://t.co/UO7Ly6QdMS", "date": "2019-09-13 16:40:09"}, "244": {"text": "Students who get scammed by a predatory for-profit college should not by punished by losing their Pell Grant eligibility. I’m glad to reintroduce the Pell Grant Restoration Act with our House cosponsors @RepJahanaHayes, @RepMGS, &amp; @RepLucyMcBath. https://t.co/JMmJFmIe5f", "date": "2019-09-12 20:06:54"}, "245": {"text": "Many 9/11 first responders still experience illnesses &amp; other injuries from Ground Zero. This anniversary, I'm grateful for @gillibrandny's longtime leadership to extend compensation for 9/11 first responders. https://t.co/pUeuOvwrzL", "date": "2019-09-11 17:45:28"}, "246": {"text": "18 years ago, nearly 3,000 Americans – including 206 people from MA – died when terrorists attacked our shores. This 9/11 anniversary, let's come together to remember the lives lost, and take care our first responders and their loved ones. #NeverForget", "date": "2019-09-11 13:44:08"}, "247": {"text": "The @USArmy IG’s review of the military housing program revealed many of the same systemic problems as my investigation. We need to act quickly to pass my bill with @RepDebHaaland to improve housing conditions for military families. https://t.co/b0fFyET1fc", "date": "2019-09-10 21:33:29"}, "248": {"text": "When I learned that many military families face poor on-base housing conditions because of greedy, big housing companies &amp; the Pentagon's failed oversight of this program, I investigated, &amp; then I introduced a bill to make it right. https://t.co/MjHb4elIwr", "date": "2019-09-10 21:33:29"}, "249": {"text": "John Bolton has never met a war he didn’t like. He never should have been National Security Adviser in the first place.", "date": "2019-09-10 19:52:55"}, "250": {"text": "At least 3 migrant children in US custody died, in part, from the flu – but @CBP won’t administer flu vaccines to detained families. @SecAzar &amp; @DHSMcAleenan should reverse this immoral &amp; irresponsible decision. https://t.co/8agGnp0Wsg", "date": "2019-09-09 22:09:44"}, "251": {"text": "RT @MassEMA: #Dorian wind gusts of 40-60 mph overnight tonight &amp; Sat AM may bring power outages for #CapeCod #Nantucket #MarthasVineyard.…", "date": "2019-09-06 22:26:03"}, "252": {"text": "In the middle of a housing affordability crisis, the Trump Administration wants to make it harder for creditworthy working families – especially families of color – to buy a home &amp; build wealth. That’s shameful. https://t.co/KAwcbttRhO", "date": "2019-09-06 19:07:45"}, "253": {"text": "RT @SenTinaSmith: Forget about politics for a second, we need to talk about this:\n \nThis damning report is from our own government and lays…", "date": "2019-09-06 16:14:41"}, "254": {"text": "My Anti-Corruption &amp; Public Integrity Act includes &amp; builds on the Presidential Conflicts of Interest Act to fundamentally change the way Washington does business. Congress should pass it &amp; help restore the American people’s faith in democracy.", "date": "2019-09-06 14:55:43"}, "255": {"text": "Weeks before @realDonaldTrump was sworn into office, I introduced the Presidential Conflicts of Interest Act to require the President &amp; VP to fully divest from any potential financial conflicts of interest – including Trump hotels in Ireland, DC, &amp; everywhere else.", "date": "2019-09-06 14:55:43"}, "256": {"text": ".@VP Pence’s taxpayer-funded stay at @realDonaldTrump’s Ireland golf resort is just another example of this admin’s open corruption &amp; how it enriches the President. I want the @StateDept to explain who planned this trip &amp; its cost to the American people. https://t.co/h4a0NwVivV", "date": "2019-09-06 14:55:42"}, "257": {"text": "The Trump administration has created a humanitarian catastrophe at the border with cruel policies that deliberately inflict pain on children &amp; families. We must shut down for-profit detention facilities, stop family separation, &amp; create a fair, humane immigration system.", "date": "2019-09-06 01:24:32"}, "258": {"text": "The @OIGatHHS report is appalling: long detention resulted in “defiance, hopelessness, &amp; frustration among children, along with more instances of self-harm &amp; suicidal ideation.” “Acute grief that caused them to cry inconsolably.” “Every single separated kid has been terrified.” https://t.co/eJ3Pi9scfh", "date": "2019-09-06 01:24:31"}, "259": {"text": "This administration is not adequately caring for the health of detained migrant children who may have been abused, kidnapped, tortured, or witnesses to murder – &amp; its family separation policies are only hurting these children more. https://t.co/bWB7rEavrE https://t.co/UXylWSLQbz", "date": "2019-09-06 01:24:29"}, "260": {"text": "Most child detention facilities let employees start working without a background check, &amp; some received background check waivers entirely. Simply put, these facilities are understaffed. And staff are often unqualified to care for traumatized children. https://t.co/CLg5yT118h https://t.co/mtRR9URVxE", "date": "2019-09-06 01:24:28"}, "261": {"text": "In June, @SenBrianSchatz &amp; I led a request that @OIGatHHS investigate the troubling allegations about the health &amp; safety of migrant children at federal contractor facilities. Two of their reports confirm some of these concerns. https://t.co/ag2QhR4xoW", "date": "2019-09-06 01:24:26"}, "262": {"text": "Five people in MA this year have contracted Eastern equine encephalitis, a rare but potentially fatal virus with no treatment. @SenMarkey &amp; I have asked @NIAIDNews for info about federal research into EEE so we can prevent &amp; treat this dangerous illness. https://t.co/rxEqV0yWpu", "date": "2019-09-06 00:30:43"}, "263": {"text": "RT @SenatorDurbin: Many former ITT Tech students are now eligible for automatic closed school discharges. Today, @SenWarren, @SenBlumenthal…", "date": "2019-09-05 20:58:58"}, "264": {"text": "Toys “R” Us. Sears. Radio Shack. Payless. Shopko. Private equity firms are killing jobs, hurting workers, &amp; draining our economy. I’ve got a bill to #StopWallStreetLooting – &amp; I’m in this fight with @forrespect all the way. https://t.co/vMolwKA3Fq", "date": "2019-09-05 20:36:12"}, "265": {"text": "I’ve spent years in the Senate fighting back against predatory for-profit colleges &amp; the companies, banks, organizations &amp; officials that enable them to scam students. I won’t stop fighting @usedgov until students receive the debt relief they deserve. https://t.co/V8exh6dt4W", "date": "2019-09-04 23:22:49"}, "266": {"text": "When shady for-profit colleges cheat students, those students are entitled to get their student loans cancelled. That’s the law. I’m disgusted that @BetsyDeVosED is making it harder for defrauded students to have their loans discharged. https://t.co/ezvVrM5bzz", "date": "2019-09-04 23:22:48"}, "267": {"text": "I’m concerned about reports of two separate incidents of racist &amp; anti-Semitic graffiti at Fort Revere Park &amp; Watuppa Reservation in MA over the past week. Cowardly acts of hate don’t belong in the Commonwealth or anywhere else in this country.", "date": "2019-09-04 23:08:10"}, "268": {"text": "I’m glad that the Trump administration is having second thoughts about deporting sick children after we fought back, but this partial reversal just isn't good enough. @USCIS must fully reverse its cruel policy to reject medical deferred action requests. https://t.co/DN6BonvKnK", "date": "2019-09-04 01:41:22"}, "269": {"text": ".@WhipClyburn &amp; I are sorry that we won’t see everyone at @SCState1896 tomorrow, but your safety is our biggest concern. South Carolina, please take care &amp; follow @SCEMD for the latest information about Hurricane #Dorian. https://t.co/rYBAxixdd6", "date": "2019-09-02 16:12:00"}, "270": {"text": "Happy #LaborDay! Today we say loud &amp; clear: unions built America’s middle class, &amp; unions will rebuild America’s middle class. https://t.co/GbzfDsa914", "date": "2019-09-02 14:54:00"}, "271": {"text": "Coming out of the Great Depression, labor unions helped build America’s strong middle class. As our families got richer, our country got richer – &amp; labor unions were a big part of it. Today, unions are under attack, &amp; we need to fight back so workers can make their voices heard. https://t.co/kM66Rb3CRg", "date": "2019-09-01 23:28:41"}, "272": {"text": "Time’s up, @SenateMajLdr. Let’s vote on gun safety legislation NOW. Every day you wait, more tragedies happen. \n\nDo something, Senator McConnell. America is done waiting for you.", "date": "2019-09-01 00:28:47"}, "273": {"text": "My Payment Modernization Act would create a national payments system so the money deposited in your bank account appears in real-time. No more living in fear over Labor Day that your rent will be processed before your paycheck clears. Congress should act to make this happen.", "date": "2019-08-31 18:03:25"}, "274": {"text": "This is the sort of weekend that terrifies people living paycheck-to-paycheck:\n🏠 Rent is due Sunday 9/1\n💰 Friday’s deposited paycheck may not clear for days because of the holiday weekend\n\nOverdraft fees &amp; payday lenders shouldn't be the solution. I’ve got a bill for that.", "date": "2019-08-31 18:03:24"}, "275": {"text": "I’m in this fight for America’s workers every step of the way. #LaborDay https://t.co/NDK8iohEOp", "date": "2019-08-30 20:42:34"}, "276": {"text": "We must take emissions seriously &amp; hold polluters accountable to avoid environmental catastrophe. In July, @FSCDems passed my Climate Risk Disclosure Act to make companies disclose climate-related risks.\n \n@SenateMajLdr McConnell, give our bill a vote. https://t.co/RSF6r4IAUo", "date": "2019-08-29 23:36:45"}, "277": {"text": "The Trump administration’s proposal to roll back methane emissions rules is a giant wet kiss to Big Oil &amp; other dirty polluters. The #climatecrisis threatens our health, economy, &amp; national security – &amp; this reckless plan will only make it worse. https://t.co/wJIeo9AoKi", "date": "2019-08-29 23:36:45"}, "278": {"text": "People come to MA from around the world to receive life-saving care. Now the Trump admin could be handing sick kids a death sentence along with deportation papers. @USCIS must reverse its heartless policy of rejecting all medical deferred action requests. https://t.co/JtH6fzALwk", "date": "2019-08-28 19:41:46"}, "279": {"text": "The federal government failed our fellow US citizens in Puerto Rico after Hurricane Maria. We cannot fail them again. #Dorian https://t.co/Y4jCo6mwdY", "date": "2019-08-28 18:34:57"}, "280": {"text": "RT @TheKingCenter: 56 years ago, today.\n\n“I Have a Dream.’\n\nHe was more than a dreamer. \nHe was a doer. \n\nWhat’s your dream that’s tied to…", "date": "2019-08-28 18:15:24"}, "281": {"text": "If @USCIS truly wants to address the urgent needs of migrants at the border, it can start by reversing its unconscionable expansion of detention camps &amp; other bad policies. Suspending asylum interviews is another cruel way to hurt families fleeing violence, persecution &amp; poverty.", "date": "2019-08-28 15:40:04"}, "282": {"text": "There are 40,000 pending asylum cases in New England that will essentially be frozen by @USCIS’ decision to suspend asylum interviews in Boston. This is an unfair &amp; unjustified shift of resources that will force applicants who have been waiting for years to wait even longer.", "date": "2019-08-28 15:40:04"}, "283": {"text": ".@USCIS’ decision to gut their New England asylum office won’t help the humanitarian crisis at the border – it will inflame it. @SenMarkey, @RepPressley &amp; I want @USCISCuccinelli to explain why his agency is further straining our asylum backlog. https://t.co/00oZGnkKCF", "date": "2019-08-28 15:40:03"}, "284": {"text": "This pick for @CFPB Student Loan Ombudsman is a slap in the face to student loan borrowers in MA &amp; across the country. They deserve better. That’s why @CFPBDirector &amp; @stevenmnuchin1 should pick someone else with real experience fighting for students, not another industry hack.", "date": "2019-08-26 23:41:44"}, "285": {"text": "The @CFPB Student Loan Ombudsman is supposed to protect students, but the Admin's pick was a top lawyer for @MyFedLoan – a student loan giant being sued by @MassAGO for undermining Public Service Loan Forgiveness &amp; overcharging student borrowers. https://t.co/4w4JPD1jIP", "date": "2019-08-26 23:41:44"}, "286": {"text": "Need proof that the Trump administration works for student loan companies &amp; not student loan borrowers? They just appointed a former executive from a giant student loan company to be the nation’s top student loan watchdog at the @CFPB. It’s outrageous. https://t.co/KK800lBCrh", "date": "2019-08-26 23:41:44"}, "287": {"text": "RT @nwlc: We can't discuss #WomensEqualityDay without pointing out the blatant voter suppression women of color and low-income backgrounds…", "date": "2019-08-26 20:37:10"}, "288": {"text": "RT @WinWithoutWar: Thank you @SenWarren for pushing to keep these provisions in the #FY2020NDAA! If we want to stop Trump’s nuclear arms ra…", "date": "2019-08-26 18:43:41"}, "289": {"text": "When retail stores or mining companies go bankrupt, their owners should have to prioritize workers' pay so they receive the severance, pensions, &amp; other payments they earned. That’s exactly what my bill to #StopWallStreetLooting would do. https://t.co/rcw1HEMxBY", "date": "2019-08-26 17:25:37"}, "290": {"text": "RT @RepKatiePorter: The @CFPB has been considering proposals to expand its ability to grant companies immunity from punishment if they brea…", "date": "2019-08-22 19:08:57"}, "291": {"text": "RT @NPWF: Today is #BlackWomensEqualPay Day, which means Black women must work an additional 8 months into the year to be paid what white,…", "date": "2019-08-22 18:14:54"}, "292": {"text": ".@realdonaldtrump's latest attack on immigrant families is to keep kids and their parents in cages indefinitely. Families fleeing violence and persecution don't belong in filthy prisons. I'll fight this policy and all attacks on immigrant communities. https://t.co/ch9U2C4Jns", "date": "2019-08-22 16:46:46"}, "293": {"text": "The United States already has nearly 4,000 nuclear weapons in our active arsenal, &amp; our conventional military might is overwhelming. Doubling down on more nuclear weapons while scrapping nuclear treaties undercuts our nonproliferation efforts around the world.", "date": "2019-08-21 22:30:04"}, "294": {"text": "We urge keeping provisions that:\n☢️Ban the deployment of dangerous, costly &amp; unnecessary W76-2 low-yield nuclear warheads\n☢️Call on the Trump admin to extend the New START treaty\n☢️Deny funding for certain nuclear missiles to prevent an arms race following the INF Treaty collapse", "date": "2019-08-21 22:30:04"}, "295": {"text": "A nuclear arms race doesn’t make the U.S. – or the world – any safer. That’s why I’m leading 17 other senators in urging @JimInhofe &amp; @SenJackReed to include 3 key nuclear weapons provisions in next year’s defense budget. https://t.co/dbOf7oUnME", "date": "2019-08-21 22:30:03"}, "296": {"text": "I’m done hearing about all the new ways @WellsFargo is cheating its customers. And I’m done with President Trump’s appointed regulators who look the other way. \n\nWells Fargo is fundamentally broken. I’m going to keep fighting with everything I’ve got to hold them accountable.", "date": "2019-08-21 19:04:04"}, "297": {"text": "Here’s the deal: In the past 3 years @WellsFargo has sworn up &amp; down that it’s changed – &amp; it’s been caught scamming customers &amp; lying to regulators in more than a dozen ways. Fake accounts. Unneeded auto insurance fees. Wrongful foreclosures &amp; repossessed cars. Enough is enough.", "date": "2019-08-21 19:04:04"}, "298": {"text": "Three years after the fake accounts scandal, @WellsFargo got caught raking in cash from accounts that its customers didn’t know they had – AGAIN. Today I’m opening an investigation &amp; demanding answers. https://t.co/EHoeRAOuax", "date": "2019-08-21 19:04:04"}, "299": {"text": "In 2013, I asked why a kid caught with an ounce of drugs goes to jail, but a bank exec that launders a billion dollars in drug money pays a fine &amp; sleeps in their own bed at night. It's clear: we have one justice system for the rich &amp; powerful, &amp; another for everybody else. https://t.co/WfkxBA5T9i", "date": "2019-08-20 23:32:21"}, "300": {"text": "We need stronger rules on Wall Street, &amp; tough regulators to enforce them. That’s why my anti-corruption bill locks the revolving door between Wall Street &amp; Washington, &amp; my Ending Too Big to Jail Act puts big bank executives in handcuffs when their banks break the law.", "date": "2019-08-20 21:31:47"}, "301": {"text": "The American people have a right to know how &amp; why @realDonaldTrump’s political appointees at @TheJusticeDept are influencing the settlement process to help @Barclays &amp; @RBS avoid accountability for their role in the 2008 financial crisis. I want answers. https://t.co/bE9qeOMq8m", "date": "2019-08-20 21:31:47"}, "302": {"text": "After the 2008 financial crisis, millions lost their homes, jobs, &amp; life savings – &amp; no CEOs went to jail. A decade later, it’s unconscionable that @TheJusticeDept still won't hold corporate criminals accountable for their role in breaking our economy. https://t.co/8h0LtJiBRR", "date": "2019-08-20 21:31:46"}, "303": {"text": "The Trump administration is deliberately obstructing low-income people’s access to basic health care services &amp; interfering in medical decisions made by patients &amp; their doctors. If the administration won’t #ProtectX, then the courts must. https://t.co/FfTInsUGIa", "date": "2019-08-19 21:29:39"}, "304": {"text": "Make no mistake: this is a direct attack on the Fair Housing Act at a time when housing costs are skyrocketing &amp; too many families, especially families of color, face vicious discrimination. @HUDgov should be strengthening anti-discrimination rules, not weakening them.", "date": "2019-08-19 19:20:45"}, "305": {"text": "Today, @HUDgov is proposing a rule that would give landlords, mortgage lenders, &amp; others the power to discriminate against homebuyers &amp; renters with no consequences. https://t.co/jfOvwnAgTJ", "date": "2019-08-19 19:20:45"}, "306": {"text": "RT @IndianCountry: Rep. Haaland and Sen. Warren: The federal government has a responsibility to write a new chapter in the story of its gov…", "date": "2019-08-17 14:45:46"}, "307": {"text": "What did the tortoise do when the Student Loan Debt Relief Act became law?  \n\nShell-ebrated being turtle-y debt free! https://t.co/Hq1wHAOB8G", "date": "2019-08-16 19:08:58"}, "308": {"text": "RT @CatherineLhamon: Thank you @SenWarren and @RepDebHaaland for answering @USCCRgov’s call for immediate Congressional action on fulfillin…", "date": "2019-08-16 17:54:12"}, "309": {"text": "RT @USCCRgov: USCCR Welcomes Legislation in Response to Commission Report on Native Americans: https://t.co/N8e7M8fDpf", "date": "2019-08-16 17:31:58"}, "310": {"text": "RT @RepDebHaaland: The federal government has a responsibility to write a new chapter in the story of its government-to-government relation…", "date": "2019-08-16 16:05:38"}, "311": {"text": ".@RepDebHaaland &amp; I invite feedback about this proposal &amp; look forward to working closely with tribal nations &amp; citizens, experts, &amp; other stakeholders to advance legislation in Congress that honors the United States’ promises to Native peoples. https://t.co/qc1fkBGb3I", "date": "2019-08-16 14:33:29"}, "312": {"text": "Last year, @USCCRgov released its “Broken Promises” report on the govt's failures to Native communities. Our Honoring Promises to Native Nations Act will address that report’s concerns on criminal justice &amp; public safety, health care, education, economic development, &amp; housing.", "date": "2019-08-16 14:33:28"}, "313": {"text": "The US government has a responsibility to honor its obligations to Native peoples. That’s why I’m working with @RepDebHaaland to draft a bill to empower tribal nations &amp; address the chronic underfunding in Indian Country. Learn more about our proposal: https://t.co/uEBo4SohjS", "date": "2019-08-16 14:33:28"}, "314": {"text": "RT @UN_Women: Respect women in the workplace. \nRespect women in public. \nRespect women at home.\nRespect women. https://t.co/1X4cNDGawM", "date": "2019-08-15 21:15:54"}, "315": {"text": "@realDonaldTrump While we fight to #ProtectTheDream &amp; fix our country’s broken immigration system, it’s powerfully important for all DACA recipients to keep their status up-to-date. Renew your DACA status here: https://t.co/Tkd8bAuXCy", "date": "2019-08-15 19:15:24"}, "316": {"text": "RT @RepFinkenauer: I am appalled by Rep. Steve King’s cruel comments &amp; his blatant disrespect for sexual assault survivors. As someone who…", "date": "2019-08-14 22:10:35"}, "317": {"text": "Happy 84th birthday, Social Security! For 22 million seniors, veterans, children, and people with disabilities, Social Security is all that stands between them &amp; poverty. I’m proud to lead the fight to protect &amp; expand Social Security in the Senate. https://t.co/RPy2xUT316", "date": "2019-08-14 21:14:25"}, "318": {"text": "The Vineyard Wind project will create thousands of jobs &amp; generate cleaner, cheaper wind energy for MA families. The Trump admin should work towards a solution that will protect the environment, address local fishermen's concerns &amp; allow the project to move forward without delay.", "date": "2019-08-14 18:32:00"}, "319": {"text": "The Trump administration’s last-minute decision to delay approval of the Vineyard Wind clean energy project is extremely disappointing. Once again they’ve chosen to put corporate polluters’ profits over Americans’ well-being. https://t.co/Dl1q2XlkKy", "date": "2019-08-14 18:31:59"}, "320": {"text": "The @FTC is supposed to protect Americans from deceptive advertising. Instead they misinformed consumers about the terms of the @Equifax settlement. The FTC should explain how this happened.", "date": "2019-08-14 17:34:08"}, "321": {"text": "145 million Americans qualified for the $125 @Equifax settlement refund that the @FTC advertised. But let’s do the math:\n \nA $31,000,000 compensation fund ÷ $125 = 248,000 checks.  \n \nThat's right: the FTC planned for less than 1% of people to get the money they’re owed.", "date": "2019-08-14 17:34:07"}, "322": {"text": "We all saw the tweets: sign up to get $125 back from @Equifax for exposing your personal data. Here’s the problem: the @FTC didn’t plan on you doing it. I want the FTC Inspector General to investigate how the agency misled the American people. https://t.co/5osflJhznH", "date": "2019-08-14 17:34:07"}, "323": {"text": "We need bold action to build more affordable housing and help families live strong, healthy lives – and I’ve got a bill for that. https://t.co/kzxVUAKro0", "date": "2019-08-13 19:26:32"}, "324": {"text": "Every kid deserves a chance to succeed – no matter where they’re from. I’m fighting back against @DHSgov’s harmful new policy &amp; fighting to protect immigrant families in MA and across the country.", "date": "2019-08-13 16:09:06"}, "325": {"text": "President Trump’s agenda is clear: blame our country’s problems on people who don’t look like you, or speak like you, or pray like you – and when we turn on each other, we can’t unite to fight back against a rigged system.", "date": "2019-08-13 16:09:06"}, "326": {"text": "The Trump administration just put out a new rule to punish immigrant families – discouraging them from getting food, health care, or housing assistance for themselves or their children, &amp; making it harder for them to become U.S. citizens. https://t.co/mLCd9Yyvko", "date": "2019-08-13 16:09:05"}, "327": {"text": "We need to stop self-dealing public officials &amp; padlock the revolving door between big business &amp; government. That’s why I’ve introduced the most ambitious anti-corruption legislation since Watergate. These reforms will help us build a country &amp; a government worth fighting for.", "date": "2019-08-12 23:30:12"}, "328": {"text": "Our national crisis of faith in government boils down to this simple fact: people don’t trust their government to do the right thing because they think it works for the rich &amp; powerful, not for the American people. And here’s the kicker: They’re right. https://t.co/ldyJMCzHAd", "date": "2019-08-12 23:30:12"}, "329": {"text": "RT @RepDebHaaland: This is a landmark case recognizing tribal sovereignty that will protect Native children and traditions and prevent a sa…", "date": "2019-08-11 14:23:24"}, "330": {"text": ".@Novartis manipulated testing data to rush its drug to market &amp; exploit govt perks. Now its $2.1M spinal muscular atrophy drug is the most expensive med in US history. The @US_FDA works for the people, not big pharma, &amp; must hold Novartis accountable. https://t.co/jo7kxqKlp7", "date": "2019-08-09 20:34:13"}, "331": {"text": "Great to see schools like @UMassAmherst taking real steps to address student hunger on campus! Congress can help more colleges tackle this problem by expanding access to SNAP for more low-income students. @RepAlLawsonJr &amp; I have a bill for that. https://t.co/OFGPiw4CyC", "date": "2019-08-09 14:53:12"}, "332": {"text": "RT @rollcall: Senator wants info on how Capitol One breach was conducted and when the bank plans to notify customers whose data was taken h…", "date": "2019-08-09 01:04:02"}, "333": {"text": "Surprise surprise: the @USChamber's Big Oil &amp; Coal lawyers are fighting the @LungAssociation’s lawsuit against the Trump admin’s attack on clean air &amp; our climate. The Chamber should be fighting for green jobs, not bullying public health advocates. https://t.co/jzLDvJq4AT", "date": "2019-08-08 23:21:30"}, "334": {"text": "It took @CapitalOne nearly 4 months to detect the data breach &amp; they’re still working to notify customers. People deserve timely info about what exactly Capital One is doing to protect people’s personal data at risk because of the company's security failures.", "date": "2019-08-08 20:09:34"}, "335": {"text": "According to news reports, the @CapitalOne hacker had worked for Amazon Web Services, which hosts the company’s database. I’m troubled that other employees may have the same knowledge the hacker had, &amp; the security weaknesses allegedly exploited are “commonly known.”", "date": "2019-08-08 20:09:33"}, "336": {"text": "Last week, @CapitalOne reported a massive data breach that compromised personal data of more than 100 million customers &amp; credit card applicants. I want to know how this happened, how they're fixing this vulnerability, &amp; who is being held accountable. https://t.co/d4SVb8Gbba", "date": "2019-08-08 20:09:33"}, "337": {"text": "I’m glad the @DHSOIG is investigating @CBP’s alarming surveillance reportedly targeting journalists, attorneys, &amp; organizers. The American people deserve answers about how &amp; why @DHSgov obtained this info &amp; how they’ve used it.\nhttps://t.co/Y2ZC402igx", "date": "2019-08-08 18:13:19"}, "338": {"text": "Our military leaders understand that America’s foreign policy cannot be run exclusively by the Pentagon. We should be investing in diplomacy &amp; development to address political, social &amp; economic problems before they morph into costly wars. https://t.co/GLx9aqzZYz", "date": "2019-08-07 18:23:53"}, "339": {"text": "America’s defense budget is more bloated than ever, but our national security cannot rely on a strong military alone. So why in the world is @realDonaldTrump trying to block billions in the @StateDept’s diplomacy, development &amp; global health funds? https://t.co/dDDteN8u47", "date": "2019-08-07 18:23:52"}, "340": {"text": "RT @repjohnlewis: 54 years ago today, the Voting Rights Act was signed into law by Pres. Johnson. Countless souls marched, protested, &amp; sto…", "date": "2019-08-06 20:41:09"}, "341": {"text": "RT @RepChuyGarcia: I am pleased to see that the @federalreserve will initiate a real-time payments system for the millions of Americans liv…", "date": "2019-08-06 19:59:17"}, "342": {"text": "I’m glad the @FederalReserve has finally taken action so working families &amp; small business owners don’t have to wait up to 5 days to get paid &amp; pay their bills. I look forward to working with the Fed to ensure this system is implemented swiftly &amp; smoothly. https://t.co/2YwXWdkloa", "date": "2019-08-05 21:01:15"}, "343": {"text": "RT @GabbyGiffords: I have no more words. I only have anger. President Donald Trump and Leader Mitch McConnell must call the Senate back fro…", "date": "2019-08-05 13:44:30"}, "344": {"text": "Just like the hateful terrorism of Al Qaeda &amp; ISIS, domestic right-wing terrorism &amp; white nationalism is completely incompatible with our American values. It is a threat to American safety &amp; security, &amp; we must not tolerate it in the United States.", "date": "2019-08-04 20:44:55"}, "345": {"text": "RT @RepLucyMcBath: As we mourned the 20 lives lost after one hate-filled massacre in El Paso, more innocent Americans were murdered in Dayt…", "date": "2019-08-04 20:26:34"}, "346": {"text": "The House passed a bill more than 5 months ago to require basic background checks on gun sales — the very least we can do to keep our loved ones safe. How many more people need to die before @SenateMajLdr McConnell puts aside @NRA interests and gives that bill a vote?", "date": "2019-08-04 19:54:20"}, "347": {"text": "Tonight I’m heartsick for El Paso &amp; I’m once again disgusted by the GOP leadership in Washington. Americans shouldn’t have to live in fear that if they go to Walmart, or a festival, or school, or just walk down the street that they won’t make it home alive. This has to stop.", "date": "2019-08-03 23:02:44"}, "348": {"text": "Withdrawing from the INF Treaty won't make us or our European allies safer. We should be holding Russia accountable for its violations – not torching the treaty that has prevented a dangerous arms race for over 30 years. https://t.co/kUJeTfA7uM", "date": "2019-08-02 16:11:40"}, "349": {"text": ".@RepPressley &amp; @RepLoriTrahan are both smart, passionate, &amp; fearless leaders for the people of Massachusetts &amp; people all across our country. I’m lucky to have them fighting by my side in Washington. https://t.co/zs1dUYRt65", "date": "2019-08-01 21:30:05"}, "350": {"text": "Contrary to popular belief, I too am not @SenatorBaldwin or @SenTinaSmith – but I couldn’t have said this better myself. Climate change is an existential threat to the Great Lakes, New England, and every corner of this country. It’s time for Washington to fight back. https://t.co/aJGhusSNYX", "date": "2019-08-01 20:57:23"}, "351": {"text": "The first step to fix the student debt crisis is to deal with the outstanding debt that never should have been required in the first place. That’s why I’ve got a bill with @WhipClyburn to cancel student debt for 42 million Americans. #CancelMyDebt", "date": "2019-08-01 18:40:37"}, "352": {"text": "America’s students did everything we told them to do: they worked hard, got good grades, &amp; went to college – &amp; now they’re drowning in debt. Washington is to blame for putting the interests of billionaires &amp; giant corporations over middle class families. https://t.co/BEVJk62GZn", "date": "2019-08-01 18:40:36"}, "353": {"text": "My friend @AdyBarkan came to the Senate a few months ago to testify about why we need #MedicareForAll. Health care is a basic human right, and it’s people like Ady – &amp; the people I hear from across MA &amp; around the country – who keep me in this fight. https://t.co/xWNNL3EgmH", "date": "2019-08-01 14:43:33"}, "354": {"text": "I asked @DHSOIG to find out how many US citizens have been detained by @CBP &amp; @ICEgov, why, for how long, &amp; under what conditions. They need to examine what procedures are in place to stop these wrongful arrests &amp; mistaken detentions, &amp; whether agents are using racial profiling.", "date": "2019-07-31 20:58:32"}, "355": {"text": "9-year-old Julia Isabel Amparo Medina was detained on her way to school at a border stop when @CBP officers claimed she didn’t look like her photo on her passport card. This little girl – an American citizen – was wrongly held for 32 hours. https://t.co/fitTHXiL6x", "date": "2019-07-31 20:58:31"}, "356": {"text": "Francisco Erwin Galicia is a US citizen who was detained at the border after @CBP claimed his TX birth certificate, ID, &amp; Social Security card were fake. He was held for more than 3 weeks &amp; lost 26 pounds from lack of food. https://t.co/UWgmZ3o79s", "date": "2019-07-31 20:58:30"}, "357": {"text": "This is a nightmare: US citizens were stopped by @CBP, presented their proof of citizenship, &amp; were held without recourse for hours, days, or weeks. I want @DHSOIG to investigate this potentially severe &amp; unacceptable abuse of power. https://t.co/x4OcTSAYCf", "date": "2019-07-31 20:58:30"}, "358": {"text": "Investing in clean energy &amp; green manufacturing can grow our economy &amp; reverse factory job losses from the past 2 decades, while making sure we #ActOnClimate. It’s beyond time for the @USChamber &amp; @ShopFloorNAM to get on board. #ChamberofCarbon", "date": "2019-07-31 19:38:54"}, "359": {"text": "American businesses should be leading the fight against the #ClimateCrisis &amp; dominating the clean energy economy. But the @USChamber, @ShopFloorNAM, &amp; their armies of lobbyists have spent decades dragging their feet &amp; rigging the rules for giant oil companies. #ChamberofCarbon", "date": "2019-07-31 19:38:54"}, "360": {"text": "RT @ChrisVanHollen: For people who are living paycheck-to-paycheck, the inability to access their funds in real-time is costing them billio…", "date": "2019-07-31 18:57:33"}, "361": {"text": "Threatening to use nuclear weapons first makes America less safe because it increases the chances of a miscalculation or an accident. There are no winners in a nuclear war, and the US should never start one. I have a bill for that. https://t.co/8NwS5g65YT https://t.co/bXokMGzL7N", "date": "2019-07-31 18:42:53"}, "362": {"text": "RT @ForeignAffairs: .@SenWarren writes that the United States needs a foreign policy that benefits everyone, not just a handful of elites:…", "date": "2019-07-30 20:26:44"}, "363": {"text": "White House acting Chief of Staff @MickMulvaneyOMB – who hired Blankenstein at the @CFPB – celebrated his employee’s racist writings. @SenSherrodBrown &amp; I are concerned that Mulvaney influenced @HUDgov’s decision to hire Blankenstein.", "date": "2019-07-30 17:00:30"}, "364": {"text": "Based on this new report, the @OIGFedCFPB should investigate the @CFPB’s decision to dismantle the agency's Office of Fair Lending &amp; Equal Opportunity. With Blankenstein in charge, there are too many unanswered questions about their actions &amp; motivations.", "date": "2019-07-30 17:00:29"}, "365": {"text": "Former @CFPB policy director Eric Blankenstein got a big job at @HUDgov even after his racist writings became public. Now a damning @OIGFedCFPB report shows he “may have abused his authority” at the CFPB. Enough is enough. Blankenstein must go.  https://t.co/cyhNeMX4dM", "date": "2019-07-30 17:00:29"}, "366": {"text": "Congrats to bus drivers on Martha’s Vineyard for reaching their first-ever contract agreement with @VTA_MV &amp; @ATUComm! When workers fight, we win. https://t.co/e506BTmIfH", "date": "2019-07-29 17:31:08"}, "367": {"text": "Yes – and I’ve got a bill for that. #StopWallStreetLooting https://t.co/VIfFdWgjkR", "date": "2019-07-29 16:43:31"}, "368": {"text": "The avg cost of child care in MA is over $20K/yr – more than in-state tuition at UMass. When families can’t afford high-quality care, their kids are at a disadvantage before they even reach kindergarten. That’s why I've got a bill for #UniversalChildCare. https://t.co/iMMeG5tqyN", "date": "2019-07-27 13:18:21"}, "369": {"text": "There’s no better place to spend a beautiful summer weekend than Cape Cod. Please come show your support for our local MA businesses! https://t.co/zXLGCOFgj3", "date": "2019-07-27 00:05:06"}, "370": {"text": "The Puerto Rican island of Vieques was heavily polluted by decades of US military bombing exercises. That's why @RepAOC &amp; I have led our colleagues in urging funding for safer cleanup there. We owe it to our fellow citizens in Vieques &amp; across Puerto Rico. https://t.co/E9UpLASTZs", "date": "2019-07-26 19:04:15"}, "371": {"text": "I’m proud of the way our first responders, local officials, &amp; communities have come together on the Cape this week.  Massachusetts knows that when we help our neighbors, we make each other stronger. https://t.co/C0IAyN2WlD", "date": "2019-07-26 18:50:58"}, "372": {"text": "Forcing migrants into “voluntary” work programs for $1/hr by threatening to withhold basic necessities or throw them in solitary confinement is inhumane &amp; raises serious legal questions. I wrote to @DHSOIG to investigate this unacceptable practice. https://t.co/PsYCfJHah4", "date": "2019-07-26 00:14:14"}, "373": {"text": ".@SenateMajLdr McConnell has the power RIGHT NOW to make our elections safer. Just today he blocked a vote on the SAFE Act, a bill the House passed to protect &amp; improve voting systems.\n \nEnough is enough, @SenateGOP. Read the report &amp; protect our democracy. Do your job.", "date": "2019-07-25 23:46:48"}, "374": {"text": "In 2016, the Russian govt tried to infiltrate our state elections systems – &amp; yesterday Robert Mueller testified that they’re still “doing it as we sit here.” This is a national security threat. Everyone should read this new Senate Intel Committee report. https://t.co/jFeb4t7fhr https://t.co/mjLoVg1l3u", "date": "2019-07-25 23:46:48"}, "375": {"text": "Let's get real: Zinke is making big bucks to help oil companies influence the govt. That’s lobbying. My bill to #EndCorruptionNow would fix the Swiss cheese definition of lobbyist &amp; put a lifetime lobbying ban on cabinet members so guys like Zinke can’t exploit our land OR govt.", "date": "2019-07-25 20:56:23"}, "376": {"text": "Ryan Zinke resigned after using the @Interior Dept like his own personal piggy bank. So he found a better way to cash in: working for the oil &amp; mining companies he used to regulate.\n \nI guess when you’re caught in a hole of corruption, just keep digging?\nhttps://t.co/rhOdEjDuq6", "date": "2019-07-25 20:56:23"}, "377": {"text": "The @AmerMedicalAssn says gun violence is a public health crisis – but the @NRA has spent decades blocking funding for scientific research to prevent it. This shouldn’t be a partisan issue – the Senate should #FundGVPResearch because #ResearchSavesLives. https://t.co/98vB40m4Av", "date": "2019-07-25 19:48:08"}, "378": {"text": "Woo-hoo! The House unanimously passed the PRIDE Act, which included my bill with @RepJudyChu &amp; @RepAndyLevin to let legally married same-sex couples get the tax refunds they were denied. @senatemajldr should do what's right &amp; give our bill a vote.  https://t.co/evE4EmYxYn", "date": "2019-07-25 18:03:38"}, "379": {"text": "These cowardly acts of racism, anti-Semitism, bigotry &amp; hate have no place in Massachusetts or anywhere else in this country. https://t.co/QiCk0MHxVn", "date": "2019-07-25 17:21:31"}, "380": {"text": ".@realDonaldTrump vetoed 3 resolutions that would prevent him from selling arms to Saudi Arabia &amp; the UAE without Congressional approval. We must put the interests of the Yemeni people above US defense contractors &amp; end our role in this war. https://t.co/eOaZcRgB6I", "date": "2019-07-25 15:25:16"}, "381": {"text": "Our payments bill will make sure that families have faster access to the money they earned &amp; save people billions of dollars each year from paying overdraft fees or turning to shady payday lenders to make ends meet.", "date": "2019-07-25 14:23:57"}, "382": {"text": "My Payment Modernization Act with @ChrisVanHollen, @RepPressley &amp; @RepChuyGarcia would require the @FederalReserve to create a national payments system so checks deposited in your bank account appear in real time. No more anxiously waiting over a weekend or holiday.", "date": "2019-07-25 14:23:57"}, "383": {"text": "People living paycheck-to-paycheck can’t wait days for a check to clear to pay for rent or groceries. And they shouldn't have to – central banks in other countries already have real-time payments systems. So we’ve got a bill for that. https://t.co/RWNFQkkFuA", "date": "2019-07-25 14:23:57"}, "384": {"text": "Private equity firms have gutted some of America’s biggest retail chains &amp; walked away scot-free while workers lost everything. That’s why my bill to #StopWallStreetLooting would protect workers &amp; fundamentally change the private equity industry. https://t.co/evCWhaNVHL", "date": "2019-07-24 20:54:27"}, "385": {"text": "We already knew that the @FTC’s $5 billion settlement with @facebook is a drop-in-the-bucket penalty. The fine print proves that it’s a joke. https://t.co/UqgzZBaiZe", "date": "2019-07-24 19:46:32"}, "386": {"text": "Watch the second part of Robert Mueller’s House hearing here. Mueller’s testimony has already made it clear that the President obstructed justice, that Mueller’s investigation did not exonerate him, and that Congress must act. https://t.co/4qMxm2DOGP", "date": "2019-07-24 16:51:37"}, "387": {"text": "Watch Robert Mueller’s testimony here. It should be clear to anyone who read the Mueller Report that Congress has a constitutional duty to begin impeachment proceedings. I hope Congress is paying attention today.  https://t.co/x8sRhWfr54", "date": "2019-07-24 12:33:15"}, "388": {"text": "RT @RepAdams: The Bipartisan @HBCUCaucus is proud to welcome @SenWarren to the Caucus! #HBCUStrong https://t.co/bdae67b9Az", "date": "2019-07-24 01:06:31"}, "389": {"text": "America’s trade deals have delivered one gut punch after another to America’s workers &amp; the unions that fight for them. The last thing workers need is a NAFTA 2.0 deal rigged by Big Pharma to keep prescription drug prices high. https://t.co/6f2dJA3EeJ", "date": "2019-07-23 22:05:26"}, "390": {"text": "RT @AFTunion: Thank you @SenWarren and @WhipClyburn for introducing the Student Loan Debt Relief Act, to help the millions of Americans str…", "date": "2019-07-23 22:02:43"}, "391": {"text": "RT @MassEMA: Power Outage Safety Tips:\n\n✅ Avoid downed power lines &amp; assume they are live\n✅ Call 9-1-1 to report downed lines\n✅ Call your u…", "date": "2019-07-23 19:14:23"}, "392": {"text": "RT @EversourceMA: ⚠️ Severe weather🌪⛈has just made its way through Cape Cod ripping down trees &amp; wires. Currently over 30,000 customers wit…", "date": "2019-07-23 19:14:07"}, "393": {"text": "My office is monitoring the severe weather on the Cape &amp; the power outage impacting up to 30,000 homes. Please follow @MassEMA for directions &amp; information to keep your family safe.", "date": "2019-07-23 19:12:43"}, "394": {"text": "Today @WhipClyburn &amp; I are officially introducing our Student Loan Debt Relief Act to cancel student debt for millions of Americans, end the student debt crisis, &amp; help tackle the racial wealth gap. Tune in live to our announcement. #CancelMyDebt  https://t.co/WJGsqPrdCK", "date": "2019-07-23 16:55:59"}, "395": {"text": "Private equity investor Leo Hindery is right – too often his industry incentivizes “reckless &amp; often immoral behavior” &amp; it desperately needs reform. I’m glad to have his support to #StopWallStreetLooting so American workers &amp; companies can succeed. https://t.co/kugPiUHhPZ", "date": "2019-07-22 22:24:02"}, "396": {"text": "Thank you, @RepDebHaaland, for defending our shared values that there is space for everyone in this country, and that nobody in our community should be left behind. I’m grateful for your important perspective and your leadership against hatred and racism. https://t.co/kxiVvmLv1u", "date": "2019-07-22 16:06:00"}, "397": {"text": "But I learned something in that fight for Dodd-Frank nine years ago today: You don’t get what you don’t fight for. I’m honored to have the opportunity to use every tool in the toolbox to hold Wall Street accountable &amp; make our government work for the people.", "date": "2019-07-21 23:44:36"}, "398": {"text": "I'll just be blunt: The @realDonaldTrump administration is fighting to kill the rules on Wall Street &amp; gut the @CFPB at any chance they can. The cops on the beat are only looking out for the crooks who are cheating American consumers. https://t.co/XIpv86L0c5", "date": "2019-07-21 23:44:36"}, "399": {"text": "And my new #StopWallStreetLooting Act that I introduced this past week would fundamentally change the private equity industry to prevent Wall Street from destroying companies like Toys “R” Us, Sears, &amp; Shopko.", "date": "2019-07-21 23:44:35"}, "400": {"text": "My bill to #EndCorruptionNow – the most ambitious anti-corruption legislation since Watergate –  would help lock the revolving door between Wall Street and Washington to make our government work for the people.", "date": "2019-07-21 23:44:35"}, "401": {"text": "After @Equifax compromised the personal data of at least 145 million Americans, I fought to hold them accountable &amp; introduced the Data Breach Prevention and Compensation Act to impose massive, mandatory fines when credit reporting agencies expose people’s personal data.", "date": "2019-07-21 23:44:35"}, "402": {"text": "I’ve introduced the Ending Too Big to Jail Act to hold Wall Street executives criminally accountable for their banks’ fraud &amp; illegal activity. When Wall Street CEOs break the law, they should go to jail like anyone else.", "date": "2019-07-21 23:44:34"}, "403": {"text": "I’m the author &amp; lead sponsor of the 21st Century Glass-Steagall Act, legislation to separate boring commercial banking (checking &amp; savings accounts) from risky investment banking, to make our financial system safer &amp; prevent another Wall St bailout.", "date": "2019-07-21 23:44:34"}, "404": {"text": "And when @WellsFargo then named Tim Sloan CEO – a 30-year Wells Fargo executive who got rich off the fake accounts scandal &amp; helped cover it up – I called for his removal too. (He was.) https://t.co/6vtdyaQKfk", "date": "2019-07-21 23:44:34"}, "405": {"text": "In 2016, I called on @WellsFargo CEO John Stumpf to resign after his bank opened millions of fake accounts in their customers’ names. (He did.) https://t.co/Fe6HM0xX6G", "date": "2019-07-21 23:44:33"}, "406": {"text": "In 2013, I asked why a kid caught with an ounce of drugs will go to jail, but a bank exec that launders a billion dollars in drug money pays a fine and gets to go home to sleep in their own bed at night. https://t.co/PgmPMmCFxe", "date": "2019-07-21 23:44:33"}, "407": {"text": "The big banks have fought financial reform – especially the @CFPB – every step of the way. So from my first Senate banking committee hearing in 2013, I’ve pushed our banking regulators to hold Wall St accountable for cheating people &amp; breaking our economy. https://t.co/Y2RHCaoLYV", "date": "2019-07-21 23:44:32"}, "408": {"text": "Exactly 8 years ago, we opened the doors at the @CFPB. Eight years since we built an agency to get the tricks &amp; traps out of the fine print of credit cards, mortgages, &amp; other financial products. And in 8 years, it’s returned billions of dollars to people who have been cheated.", "date": "2019-07-21 23:44:32"}, "409": {"text": "Nine years ago today, I ran out of the Senate – where I was a witness testifying about the TARP Wall St bailout – and raced to the @WhiteHouse. With seconds to spare, I got to see President @BarackObama sign Dodd-Frank, the Wall Street reform bill that gave us the @CFPB. https://t.co/Q3Pko9aScl", "date": "2019-07-21 23:44:32"}, "410": {"text": "Workers from Sears, Toys “R” Us, &amp; Shopko have had to fight tooth &amp; nail for their pay, severance, &amp; pensions. I was proud to be joined by those workers this week to introduce the #StopWallStreetLooting Act to hold private equity firms accountable for the companies they buy. https://t.co/qJTIUvHT5H", "date": "2019-07-20 17:53:56"}, "411": {"text": "Retail stores aren’t the only ones gutted by private equity. Local papers have been hit hard by investment funds that load them with debt, cut staff, &amp; squeeze them until they go under. My #StopWallStreetLooting Act gives newspapers a fighting chance. https://t.co/IKf0H6nIpT", "date": "2019-07-19 21:19:47"}, "412": {"text": "RT @SomervilleCity: Extreme temperatures in the greater Boston area are expected this weekend. Be prepared, drink plenty of water, and mayb…", "date": "2019-07-19 20:01:40"}, "413": {"text": "RT @TweetWorcester: The weekend forecast calls for temperatures in the 90's with a projected Heat Index surpassing 100 on Saturday, July 20…", "date": "2019-07-19 19:59:53"}, "414": {"text": "RT @LowellFireDept: https://t.co/sXYKAxi2W2", "date": "2019-07-19 19:57:11"}, "415": {"text": "RT @dave4districte: LAWRENCE COOLING CENTERS - EXTREME THRU SUNDAY: Due to the extreme weather forecast this weekend, the @COL1853 will ope…", "date": "2019-07-19 19:54:59"}, "416": {"text": "RT @SpfldMACityHall: Mayor Sarno, along with the Commissioner of Health and Human Services, Helen R. Caulton-Harris, announced today that t…", "date": "2019-07-19 19:52:55"}, "417": {"text": "RT @CityOfBoston: The City of Boston has declared a heat emergency beginning Friday at noon through Sunday evening. Temperatures are expect…", "date": "2019-07-19 19:50:34"}, "418": {"text": "RT @NWSBoston: An Excessive Heat Warning is in effect for much of southern New England. The combination of hot temps and high humidity will…", "date": "2019-07-19 19:46:53"}, "419": {"text": "RT @ASAMorg: \"The decline should not be a signal to slow down efforts — or funding — to combat the epidemic.\" - @DrShawnRyan1.\n\nLegislative…", "date": "2019-07-19 18:17:44"}, "420": {"text": "Earlier this week @realDonaldTrump’s administration issued a sweeping asylum ban. Now they’re trying to end refugee admissions. The President wants to slam the door on people fleeing persecution &amp; put them back in danger. This is cruel, unnecessary, &amp; un-American. https://t.co/PlxjL6BeGa", "date": "2019-07-19 16:52:41"}, "421": {"text": "I’m very glad that @TheNationsFirst &amp; our state leaders will continue to allow transgender Americans to serve in the MA National Guard. Our Commonwealth is safer when we allow everyone who can handle the job to serve. https://t.co/7uXJKFA2m4", "date": "2019-07-18 22:58:38"}, "422": {"text": "RT @Public_Citizen: We need to close the loopholes that have allowed Wall Street to profit from private prisons &amp; detention centers, dirty…", "date": "2019-07-18 19:40:27"}, "423": {"text": "RT @ceprdc: New private equity reform bill from @SenWarren, @SenatorBaldwin, @SenSherrodBrown would help investors fully understand PE and…", "date": "2019-07-18 17:51:30"}, "424": {"text": "RT @SenatorBaldwin: A predatory private equity firm shut down Wisconsin stores and nearly 3,000 Shopko workers lost their jobs. \n\nWhen thou…", "date": "2019-07-18 17:26:27"}, "425": {"text": "RT @forrespect: BREAKING: We’ve been working with @SenWarren &amp; other members of Congress on a new bill to take on private equity firms &amp; he…", "date": "2019-07-18 17:16:38"}, "426": {"text": "We must end the worst abuses of private equity that kill jobs, hurt workers, &amp; drain our economy. The #StopWallStreetLooting Act is a bold new plan to fundamentally change the industry.", "date": "2019-07-18 14:50:19"}, "427": {"text": "Our new #StopWallStreetLooting Act would:\n\n✔️Put private investment funds on the hook for their companies' debt &amp; liabilities\n✔️End corporate looting through excessive fees &amp; dividends\n✔️Protects workers' jobs &amp; severance\n✔️Safeguard the markets from risky corporate debt", "date": "2019-07-18 14:50:19"}, "428": {"text": "When companies like Sears fail, workers lose everything. But the private equity &amp; investment funds? They collect huge fees &amp; move on to the next big deal. It’s time to #StopWallStreetLooting to protect workers &amp; hold private equity accountable.", "date": "2019-07-18 14:50:18"}, "429": {"text": "It’s not just stores at the mall that suffer from Wall Street looting. Private equity has ruined newspapers, manufactured housing, grocery stores, &amp; even nursing homes in MA &amp; across the country. https://t.co/dSMmjgnglA", "date": "2019-07-18 14:50:18"}, "430": {"text": "@SenatorBaldwin @SenSherrodBrown @repmarkpocan @RepJayapal When I was a kid, my mom’s job at Sears saved our family. But that Sears doesn’t exist today. Neither does Payless, Shopko, or Gymboree. \n\nThat’s because private equity &amp; investment funds bought them, stripped them for parts, &amp; drove them into the ground. #StopWallStreetLooting", "date": "2019-07-18 14:50:17"}, "431": {"text": "Private equity firms want you to believe you’re not smart enough to understand their business model. But it's pretty simple: take over companies &amp; loot 'em. \n\nAnd I’ve got a bill with @SenatorBaldwin, @SenSherrodBrown, @RepMarkPocan &amp; @RepJayapal to fix it. #StopWallStreetLooting https://t.co/wbz16jKpTG", "date": "2019-07-18 14:46:34"}, "432": {"text": "Food insecurity is a real, structural problem that’s another barrier between low-income students &amp; the chance to finally get a college education. The College Student Hunger Act will tackle this problem head-on. We can fix this. #RealCollege", "date": "2019-07-17 21:28:13"}, "433": {"text": "My College Student Hunger Act with @RepAlLawsonJr would:\n❌ Expand access to SNAP for more low-income students\n❌ Increase outreach to eligible students\n❌ Require @usedgov &amp; @USDA to connect eligible students with SNAP", "date": "2019-07-17 21:28:13"}, "434": {"text": "As more &amp; more students struggle to pay for college, 30% may be going hungry. Students shouldn’t have to choose between paying tuition &amp; eating. \n \nThat’s why I’ve got a bill to ensure college students can succeed without going hungry. #RealCollege https://t.co/1OfhcbcVnm", "date": "2019-07-17 21:28:13"}, "435": {"text": "I have a bill for that. Congress should pass my #CAREAct with @RepCummings to provide cities, counties, states, territories, &amp; tribal governments with the comprehensive funding they need to fight the opioid epidemic. We can do this right now.  https://t.co/r6q4I8S3eu", "date": "2019-07-17 19:33:47"}, "436": {"text": "Great news: @FSCDems passed my Climate Risk Disclosure Act with @RepCasten yesterday. We’re one step closer to requiring public companies to disclose their climate-related risks and speeding up the transition to a green economy. https://t.co/GoiP2V85Xb", "date": "2019-07-17 19:01:38"}, "437": {"text": "Let’s be very clear: @realDonaldTrump’s tweets were racist.\n \nPersist, @SpeakerPelosi. Persist. #shepersisted", "date": "2019-07-16 21:22:55"}, "438": {"text": "The American people deserve to know that the @DeptofDefense Secretary will make decisions in our country’s best security interests, not in @Raytheon’s or his own financial interests. If @EsperDoD won’t commit to address his conflicts, he should not be confirmed. https://t.co/J7hQTCBQBO", "date": "2019-07-16 17:50:36"}, "439": {"text": "Last week, I met with @EsperDoD &amp; asked him to extend his @Raytheon recusal through the duration of his tenure at the @DeptofDefense. He refused. \n \nI’m troubled by Esper’s unwillingness to fully address his conflicts of interest &amp; urge him to reconsider. https://t.co/POZX4Qx9TQ", "date": "2019-07-15 22:51:50"}, "440": {"text": "Mark @EsperDoD ran @Raytheon’s lobbying shop for 7 years. In fact, he’s still waiting on a million-dollar payout from them after 2022. I have serious ethical concerns about his @DeptofDefense Secretary nomination.", "date": "2019-07-15 22:51:49"}, "441": {"text": "My bill to #EndCorruptionNow would shut the revolving door between the government &amp; big business, including @CommerceGov &amp; the steel industry. It’s long past time to root out corruption in every corner of our government &amp; make it work for the people.", "date": "2019-07-15 19:58:50"}, "442": {"text": ".@CommerceGov's process for exempting companies from Trump’s steel &amp; aluminum tariffs appears to be arbitrary, opaque, &amp; subject to favoritism. It’s run by 2 former industry insiders. I want more info on this potentially serious conflict of interest. https://t.co/OAd2NlAKnJ", "date": "2019-07-15 19:58:49"}, "443": {"text": "Fed Chair Jerome Powell is right: the opioid epidemic is a “national crisis.” That’s why @RepCummings &amp; I have the most ambitious legislation in Congress to put an end to it. #CAREact https://t.co/LE19yAAGf4", "date": "2019-07-13 15:00:10"}, "444": {"text": "Facebook made $5 billion in profits in just the first three months of last year. The company is too big to oversee, and this drop-in-the-bucket penalty confirms that. The FTC should break Facebook up, plain and simple. Enough is enough.", "date": "2019-07-12 23:32:31"}, "445": {"text": "Let’s be honest: this settlement is a victory for Facebook. Just look to the markets. In the first 15 minutes after the settlement was reported, Facebook’s market value went up by more than $5 billion.", "date": "2019-07-12 23:32:31"}, "446": {"text": "The FTC just voted to let Facebook off easy with a $5 billion settlement for compromising the data of tens of millions of Americans and allowing our elections to be improperly influenced.\nhttps://t.co/N11V0yqchO", "date": "2019-07-12 23:32:30"}, "447": {"text": "Private, for-profit prisons are rife with safety, health, and human rights concerns. We should abolish them altogether.", "date": "2019-07-12 20:04:23"}, "448": {"text": "I want @ICEGov to explain to me why they’re spending even more money on for-profit detention centers &amp; secretly housing migrants in a facility so despicable that @TheJusticeDept didn’t want to use it. https://t.co/lOaeKB0XNi", "date": "2019-07-12 20:04:23"}, "449": {"text": "The last thing our servicemembers should have to worry about is our govt trying to deport their families. @gillibrandny &amp; I wrote a letter urging @realDonaldTrump to think about our nat’l security &amp; reconsider deporting undocumented families of soldiers. https://t.co/wjM5GTZaw2", "date": "2019-07-12 17:52:56"}, "450": {"text": "Según los informes, @realDonaldTrump ha ordenado a @ICEgov que comience este fin de semana redadas a familias migrantes. No importa quién sea el presidente, independientemente de su estado migratorio, usted tiene derechos. Lea y comparta esta información. #KnowYourRights https://t.co/p3OOxiHcQ1", "date": "2019-07-11 23:01:25"}, "451": {"text": ". @realDonaldTrump has reportedly directed @ICEgov to begin raids this weekend against thousands of migrant families. No matter who's President, regardless of your immigration status, you have rights. Read &amp; share this info from @ACLU. #KnowYourRights https://t.co/cvbIR02Vkj", "date": "2019-07-11 23:01:23"}, "452": {"text": "RT @SenWhitehouse: Is the @USChamber, Washington’s biggest lobbyist, shirking its responsibility to disclose on whose behalf it is lobbying…", "date": "2019-07-11 16:26:01"}, "453": {"text": ".@NLRB member William Emanuel got busted once for hearing a case where he had a conflict of interest — &amp; he might do it again. The NLRB is supposed to protect workers &amp; Emanuel’s mile-long list of conflicts is disqualifying. He must resign. https://t.co/4Qy4pdvgk2", "date": "2019-07-10 21:47:15"}, "454": {"text": "Let's get this straight: @ICEgov spent money it doesn't have for a secret contract to detain migrants in a facility so horrendous that @TheJusticeDept stopped using it? \n \nWe need to end private prisons &amp; detention centers, and stop the inhumane detention at the border. NOW. https://t.co/H15qmwLEK7", "date": "2019-07-10 18:28:10"}, "455": {"text": "I’m reintroducing my Climate Risk Disclosure Act with @RepCasten, @RepCartwright &amp; @RepAOC to make public companies disclose their climate-related risks. Investors can hold corporations accountable for their role in the climate crisis &amp; speed up the transition to a green economy.", "date": "2019-07-10 14:10:14"}, "456": {"text": "It’s time to wake up &amp; fight back against giant corporations that pollute our environment &amp; make everyone else deal with the consequences. So I’ve got a bill to #ActOnClimate with the language that giant corporations understand best: money.", "date": "2019-07-10 14:10:14"}, "457": {"text": "The #ClimateCrisis threatens our air, water, &amp; health, but it could also trigger a global financial crisis. Rising sea levels, more extreme storms, &amp; water shortages are just a few of the many threats to our economy. https://t.co/iceyG2IAGD", "date": "2019-07-10 14:10:13"}, "458": {"text": "RT @JacksonCorbin_: When I testified at the Kavanaugh hearings on behalf of people w/ #PreExistingConditions, I got trolled pretty hard by…", "date": "2019-07-09 21:59:54"}, "459": {"text": "I reintroduced my Gambling Addiction Prevention Act with @SteveDaines &amp; @RepSusieLee so servicemembers &amp; vets struggling with gambling addiction can get the treatment they need. It's one more way we can honor their sacrifices by keeping them safe. https://t.co/8Z1B2fk0Jb", "date": "2019-07-09 20:25:10"}, "460": {"text": "There are more than 3000 slot machines at US military installations around the world, but the @DeptofDefense doesn't systematically screen for gambling disorder. That's dangerous for our servicemembers' health &amp; well-being, &amp; our national security. But I've got a bill for that.", "date": "2019-07-09 20:25:10"}, "461": {"text": "RT @RepKClark: Today, the #GOP is back in court trying to dismantle the health care that 20 mil Americans rely on. We won't stand for it. W…", "date": "2019-07-09 19:07:03"}, "462": {"text": "RT @SenMarkey: Rafa is 3. He lives in Boston, is learning to read, and loves going to the @MuseumOfScience. He’s also one of the 130 millio…", "date": "2019-07-09 19:02:32"}, "463": {"text": "We should call our climate crisis what it is: an emergency. That’s why I support a climate emergency resolution, a #GreenNewDeal, protecting our public lands and coasts from drilling, and other big, bold actions to tackle it.", "date": "2019-07-09 17:44:03"}, "464": {"text": "I’m proud that MA &amp; our @MassAGO Maura Healey is still leading the fight to stop the Trump administration from ripping away health care from millions of Americans. We’re in this fight all the way. #ProtectOurCare https://t.co/wcWTUaklC5", "date": "2019-07-09 15:56:38"}, "465": {"text": "Health care is a basic human right, and we fight for basic human rights. That’s why I support #MedicareForAll so families don’t go broke while begging insurance companies to get the care they need. https://t.co/Pv7pu8fOM3", "date": "2019-07-09 15:56:38"}, "466": {"text": "The Trump administration is in court today in their never-ending crusade to destroy health care for millions of Americans. If they succeed, families like Chantel’s would go bankrupt. People would die. #ProtectOurCare https://t.co/QAfPKCf2eM", "date": "2019-07-09 15:56:37"}, "467": {"text": "The facts are clear: @RealDonaldTrump’s only environmental priority is to stuff the pockets of Big Oil &amp; Big Coal companies that deepen the #ClimateCrisis &amp; poison our water &amp; air. https://t.co/KKrGkHcMG3", "date": "2019-07-08 19:50:34"}, "468": {"text": "Wall Street is lobbying policymakers to weaken the rules for their new ways to trick &amp; trap people into debt. This time it's student debt – but we’ve seen this story before. That's why @RepKatiePorter, @RepPressley, and I have sounded the alarm. https://t.co/6ShfF2NuUD", "date": "2019-07-08 17:24:46"}, "469": {"text": "Mayor Bill Carpenter was a true champion for the City of Brockton, &amp; a devoted public servant. Bruce &amp; I send our prayers to Bill’s family &amp; the people of Brockton. We’ll be with you every step of the way. https://t.co/2y2a8nSt5T", "date": "2019-07-03 16:31:40"}, "470": {"text": "I look forward to a response and hope Dr. @ScottGottliebMD will rectify his mistake &amp; resign from his position at @Pfizer. It would send a strong message about the importance of integrity of current &amp; former federal officials. https://t.co/6JhGfSutAX", "date": "2019-07-02 16:46:18"}, "471": {"text": "As @US_FDA Commissioner, @ScottGottliebMD &amp; I worked together on a number of public health priorities. That’s why I found his new position on the Board of drug giant @Pfizer to be such a tough pill to swallow.  https://t.co/TXXYGyy3s4", "date": "2019-07-02 16:46:16"}, "472": {"text": "RT @RepLoriTrahan: Toddlers quarantined in a 8x10’ room sleeping on the floor w/the flu. \n\nYoung girl in a hot warehouse coloring with a ch…", "date": "2019-07-02 16:23:03"}, "473": {"text": "RT @ABCPolitics: Rep. Ayanna Pressley: \"I learned a long time ago that when change happens it's either because people see the light or they…", "date": "2019-07-02 16:16:02"}, "474": {"text": "RT @RepJayapal: This is so important. The @FCC has tremendous power to wield on behalf of consumers...if it wants to. Or if it is forced to…", "date": "2019-07-02 13:43:08"}, "475": {"text": "RT @RepJayapal: How can the FCC strive for “security, reliability” and transparency when their advisory panel is dominated by industry insi…", "date": "2019-07-02 13:42:51"}, "476": {"text": "I want @JPMorgan @Chase CEO Jamie Dimon to explain why his bank is reinstating harmful forced arbitration clauses, &amp; to reconsider their plans to resume exploiting their customers. https://t.co/b94aOqA209", "date": "2019-07-02 00:11:49"}, "477": {"text": "This might sound wonky, but it’s important. If @Chase unfairly charges you a $5 fee, you’re probably not going to challenge them alone in a bank-friendly arbitration process. But you might join a class action – like customers did in 2012 to recover $110M. https://t.co/b5B6GNVjSh", "date": "2019-07-02 00:11:49"}, "478": {"text": "Forced arbitration clauses are a fancy way for companies to force customers to waive their right to go to court when they’re cheated. And @JPMorgan @Chase just snuck them back into the fine print of their credit cards. https://t.co/0RwvVs8FG4", "date": "2019-07-02 00:11:48"}, "479": {"text": "Watch @RepJudyChu’s story &amp; #DontLookAway. What’s happening at @DHSgov border detention facilities is inhumane. https://t.co/H6yWFo7jmf", "date": "2019-07-01 23:23:09"}, "480": {"text": "Late Friday, @BetsyDeVosED declared open season for swindlers &amp; crooks by quietly throwing the rules on #4profit colleges in the garbage. I won’t stop fighting to hold DeVos accountable for turning her back on students. https://t.co/JRgnWCPe0p", "date": "2019-07-01 23:12:14"}, "481": {"text": "During her confirmation, I asked @BetsyDeVosED if she would enforce rules that protect students from cheating #4profit schools. She hemmed &amp; hawed &amp; sent a terrifying message to students: you’re on your own. https://t.co/kJVvuz1Osc", "date": "2019-07-01 23:10:24"}, "482": {"text": "The @FCC should be working on behalf of American consumers, not giant telecom companies. @RepJayapal &amp; I want @AjitPaiFCC to explain the extent to which CSRIC may be corrupted by corporate influence. https://t.co/NfXhHqfl3D", "date": "2019-07-01 17:55:11"}, "483": {"text": ".@POGOBlog found that a federal advisory panel tasked with making policy recs to the @FCC is stacked with corporate insiders. This is the definition of corruption: industry members writing the rules to benefit themselves &amp; their rich friends. https://t.co/eowemeiBw1", "date": "2019-07-01 17:55:11"}, "484": {"text": "@CFPB @splcenter @RepKatiePorter @RepPressley Paul Watkins’ role at @CFPB lets him scrap anti-discrimination laws for tech companies that are supposed to protect LGBTQ consumers. @CFPBDirector  Kraninger should explain how the former lawyer of a homophobic hate-group got this job. https://t.co/WgNvs9jNg6", "date": "2019-06-28 15:54:21"}, "485": {"text": "The @CFPB’s Director of the Office of Innovation was Senior Counsel at an anti-LGBTQ organization labeled as a hate-group by the @SPLCenter. @RepKatiePorter, @RepPressley &amp; I don’t think he should have a job at the CFPB. https://t.co/Oo4TNSF9RJ", "date": "2019-06-28 15:53:15"}, "486": {"text": "Whether @realDonaldTrump likes it or not, he needs Congressional authorization to wage war. That’s why I voted for @SenatorTomUdall &amp; Senator Tim Kaine’s amdt that prohibits war with Iran without approval from Congress. Americans don’t want another war in the Middle East.", "date": "2019-06-28 15:24:49"}, "487": {"text": ".@realDonaldTrump and his band of war hawks @SecPompeo &amp; @AmbJohnBolton have brought us to the brink of war with Iran, which would have devastating consequences for the region and the world. This should terrify every American.", "date": "2019-06-28 15:24:48"}, "488": {"text": "I wrote to @BalfourBeatty &amp; the @USAirForce for an explanation about how Balfour Beatty was able to falsify housing maintenance logs while the Air Force looked the other way. I want answers. https://t.co/vvQctlbf1w", "date": "2019-06-27 18:35:32"}, "489": {"text": "But it gets worse: the @USAirForce unit that oversees privatized housing ignored at least 18 warnings from local employees about false info in @BalfourBeatty maintenance logs. I have real concerns about how the Air Force is using its oversight authorities.", "date": "2019-06-27 18:35:31"}, "490": {"text": ".@BalfourBeatty got paid millions to operate housing on America's military bases – and it systematically falsified maintenance logs to collect huge bonuses while military families lived in unsafe &amp; unsanitary homes. It's shameful. https://t.co/zrUK10zaV7", "date": "2019-06-27 18:35:31"}, "491": {"text": "Let’s be clear: @realDonaldTrump’s nakedly partisan citizenship question is a scheme to undercount, underfund &amp; dilute the political power of communities of color. Today’s SCOTUS ruling proves this isn’t over. We must keep fighting to count every single person in the #2020census.", "date": "2019-06-27 17:32:11"}, "492": {"text": "Today the Supreme Court threw up its hands &amp; declared it can’t rein in partisan gerrymandering – can’t protect Americans’ constitutional rights to participate in their democracy equally &amp; choose their representatives. It's a shameful blow to the functioning of our democracy.", "date": "2019-06-27 16:22:33"}, "493": {"text": "It’s time for the Senate to pass the #EqualityAct to finally ban discrimination against LGBTQ people. And Congress should pass my Refund Equality Act so legally married same-sex couples can finally get the tax refunds they should have received but were denied.", "date": "2019-06-26 22:04:58"}, "494": {"text": "Today we celebrate 4 years since Obergefell v. Hodges, the landmark SCOTUS ruling for #MarriageEquality. We celebrate – but we also remember that our LGBTQ friends &amp; family are still fighting for “equal dignity in the eyes of the law” at work, school, &amp; in our communities.", "date": "2019-06-26 22:04:15"}, "495": {"text": "RT @RepDebHaaland: My story is not unlike many parents struggling to give their kids every opportunity to get ahead. That’s why I introduce…", "date": "2019-06-26 21:49:41"}, "496": {"text": "@USDOL Today I led my @SenateDems colleagues in urging @USDOL to reverse course on joint employer agreements. The Labor Dept should be leading the fight to protect US workers – not undermining wage-and-hour protections for our most vulnerable. https://t.co/1UoYqduNtn", "date": "2019-06-26 19:17:52"}, "497": {"text": "Giant corporations try to shirk responsibility for following federal labor laws by using contract workers, temps, &amp; franchises – &amp; @USDOL is trying to help them. Their proposal to narrow the definition of “employer” would weaken workers' wage protections. https://t.co/HvBA04FgTP", "date": "2019-06-26 19:16:33"}, "498": {"text": "What @realDonaldTrump's admin is doing is intentional cruelty – a deliberate attempt to destroy families and psychologically scar children. Shame on @realDonaldTrump &amp; shame on his @SenateGOP allies who have done his bidding on these horrific policies. https://t.co/WksjWKr2YM", "date": "2019-06-26 17:42:41"}, "499": {"text": "We should ban for-profit detention centers &amp; prisons. We should decriminalize migration. Parents &amp; children shouldn’t be deemed criminals for fleeing violence or seeking a better future. And we must stop family separation &amp; jailing children. Period. https://t.co/ZhPdENhQzj", "date": "2019-06-26 17:42:40"}, "500": {"text": "We have a moral obligation to condemn &amp; end the despicable human rights abuses at detention facilities under @realDonaldTrump’s orders. I won't support a bill that lets companies continue to profit off of jailing children &amp; allows kids to remain in unlicensed facilities.", "date": "2019-06-26 17:42:40"}, "501": {"text": "Right now, kids are locked in cages &amp; dying in US custody, @realDonaldTrump is terrorizing communities with raids &amp; mass deportation, &amp; the @WhiteHouse is threatening to veto legislation if it leaves out funding for more @ICEgov detention. Congress must fight back.", "date": "2019-06-26 17:42:39"}, "502": {"text": "I’m glad students cheated by shady for-profit colleges are fighting back against @BetsyDeVosED in court. If she doesn’t care about helping defrauded students, then let’s hope a federal judge will make her care. https://t.co/nJp0mwbw4S", "date": "2019-06-25 18:23:34"}, "503": {"text": "One year ago, I was in McAllen to see the families ripped apart by the Trump admin. A year later, his administration is fighting to make sure the kids held in those cages don’t have soap or toothbrushes. This is a humanitarian crisis, and @realDonaldTrump is responsible for it. https://t.co/93Z25Z2hxF", "date": "2019-06-25 17:01:35"}, "504": {"text": "Climate change deniers like @VP Pence may think we can bury our heads in the sand &amp; flat-out lie that “America has the cleanest air &amp; water in the world.” But the climate crisis is a national security threat. https://t.co/1DDf3sSmA8", "date": "2019-06-25 00:29:32"}, "505": {"text": "“While the plan is technically universal, it really does seem geared toward alleviating the current burdens of the poor and lower-middle class.” #UniversalChildCare https://t.co/TaXQac1eh7", "date": "2019-06-22 13:39:46"}, "506": {"text": "RT @reveal: ICYMI: .@SenWarren has called on the Pentagon and the nation’s workplace safety regulator to tighten oversight to prevent compa…", "date": "2019-06-21 20:31:32"}, "507": {"text": "RT @RepJudyChu: And thank you @SenWarren for your leadership on this in the Senate! Families come in all forms and it's time our federal do…", "date": "2019-06-21 19:58:14"}, "508": {"text": "I’m deeply worried about the volume &amp; severity with which @ICEgov appears to be violating its own solitary confinement rules, &amp; the health &amp; safety of detainees in ICE's care. Today I’m demanding answers. https://t.co/WPrldOsonv", "date": "2019-06-21 14:21:55"}, "509": {"text": "Solitary confinement is a cruel &amp; unnecessary practice. It's appalling that @ICEgov misuses it in immigrant detention centers, including for people with mental or physical disabilities, sexual assault or torture victims, &amp; LGBTQ people. https://t.co/8DYl6cc0Qr", "date": "2019-06-21 14:21:55"}, "510": {"text": "One of @HUDgov’s most important jobs is to fight housing discrimination &amp; close the homeownership gap for people of color. Eric Blankenstein’s history of racist writings show that he is unfit for a job at HUD. https://t.co/nA2jaqwivF", "date": "2019-06-21 00:52:06"}, "511": {"text": "The crisis with Iran is a result of @realDonaldTrump provoking Iran’s extreme hardliners &amp; alienating our allies. I cosponsored @SenatorTomUdall’s amdt to the defense bill that prohibits war with Iran without Congressional approval. We can't start another war in the Middle East.", "date": "2019-06-20 23:02:20"}, "512": {"text": "Great news: thanks to @RepJudyChu &amp; @RepRichardNeal’s leadership in the House, the @WaysMeansCmte just passed the Refund Equality Act! https://t.co/w9zHbXNaiM", "date": "2019-06-20 20:41:34"}, "513": {"text": "It’s been almost 4 months since the House passed a commonsense bill to require background checks for every gun sale – but the @SenateGOP haven’t done a thing. Listen to @GabbyGiffords, @SenateMajLdr McConnell. Our kids’ safety can’t wait another day. #BackgroundChecksNow https://t.co/VHXTI0bsS8", "date": "2019-06-20 18:17:39"}, "514": {"text": "I’ve met with refugees from Syria, Iraq, &amp; Central America – moms, dads, kids, young people – fleeing terrorists &amp; gangs to seek a better life. On #WorldRefugeeDay, we reaffirm our values by fighting this administration’s hate-fueled attack on immigrants &amp; refugees. https://t.co/995ALG3F0i", "date": "2019-06-20 17:50:43"}, "515": {"text": "The Refund Equality Act allows same-sex couples to claim the tax refunds they earned but were denied because of who they love. Tune in to the House markup of the bill now: https://t.co/kdyvxpBC6J", "date": "2019-06-20 13:51:14"}, "516": {"text": "For years, legally married same-sex couples couldn’t file joint taxes &amp; often paid more. I’m reintroducing my Refund Equality Act with 39 other senators to right that wrong. https://t.co/TkuzkyFdJv", "date": "2019-06-20 13:51:14"}, "517": {"text": "When antitrust regulators let giant corporations put profits over workers &amp; consumers, this is what happens. Disney is on track to make $9 BILLION at the box office in 2019. CEO Bob Iger took home $65.7M last year. And workers are facing layoffs. https://t.co/kB85VAHzwm", "date": "2019-06-19 21:12:04"}, "518": {"text": "I’ll keep fighting in Washington to pass the #RaisetheWage Act, which would help ensure that all American workers, including tipped workers, make a living wage and have dignity at work.", "date": "2019-06-19 18:30:45"}, "519": {"text": "The federal minimum wage for tipped workers has been frozen at $2.13 since George HW Bush was President. MA can step up &amp; lead with #1fairwage because full-time work shouldn’t mean full-time poverty, financial uncertainty, and harassment on the job.  https://t.co/O0UFZZy2Gv", "date": "2019-06-19 18:30:14"}, "520": {"text": "On #Juneteenth, we remember that our country still hasn’t made enough progress toward racial equality &amp; justice. Voter suppression. Mass incarceration. Decades of govt discrimination to keep Black families from building wealth. We can, &amp; must, do better. https://t.co/I1CLOcKLUa", "date": "2019-06-19 17:46:06"}, "521": {"text": "This important study from the @NLIHC shows what we already know – too many families across MA are stretched to the breaking point just to afford housing. Congress should treat the shortage of affordable housing like the crisis it is &amp; pass my housing bill. https://t.co/j7WbxdKkG3", "date": "2019-06-19 15:12:49"}, "522": {"text": "@DeptofDefense The Trump admin has outsourced leadership of the Pentagon to the defense industry. My bill to #EndCorruptionNow would slam shut the revolving door so there wouldn’t be any question that the Pentagon is working for our national security, not the profits of giant defense companies.", "date": "2019-06-19 14:03:23"}, "523": {"text": "Trump’s new Acting @DeptofDefense Secretary is a former Raytheon lobbyist who wouldn’t commit to fully recusing himself on matters related to his former employer when I questioned him 19 months ago. https://t.co/oy3Dhe1VOx", "date": "2019-06-19 14:02:38"}, "524": {"text": "RT @nwlc: Thank you @SenWarren and @RepDebHaaland for introducing the #UniversalChildCare and Early Learning Act so that families can find…", "date": "2019-06-18 21:47:48"}, "525": {"text": "RT @AFSCME: It’s already hard enough for working families to make ends meet, let alone afford the extraordinary cost of quality child care.…", "date": "2019-06-18 21:39:18"}, "526": {"text": "RT @AFTunion: Families are caught in a bind-they need to work to support their kids, but more and more of their paychecks are going to chil…", "date": "2019-06-18 21:29:14"}, "527": {"text": "RT @RepDebHaaland: If we’re going to get serious about ending the cycle of poverty in New Mexico and the entire country, we need to invest…", "date": "2019-06-18 21:16:50"}, "528": {"text": "RT @RepDebHaaland: Our families deserve to have the resources that will help our kids have a bright future. Yet, according to @aecfkidscoun…", "date": "2019-06-18 21:16:21"}, "529": {"text": "In the wealthiest country in the world, access to affordable, high-quality child care &amp; early ed should be a right for all families – not a privilege for only the rich. Congress should pass our #UniversalChildCare bill to invest in our kids &amp; make this economy work for everyone.", "date": "2019-06-18 18:36:01"}, "530": {"text": "Massachusetts families pay an average of $20k/yr for infant center care – more than the cost of in-state public tuition at UMass. My #UniversalChildCare bill would help 100k low-income kids in MA &amp; thousands more above the poverty line.", "date": "2019-06-18 18:36:01"}, "531": {"text": "@RepDebHaaland My new #UniversalChildCare bill with @RepDebHaaland would:\n✔️ Guarantee high-quality child care options for every family\n✔️ Make child care free for millions &amp; affordable for every family\n✔️ Invest in child care workers\n✔️ Provide universal pre-K education", "date": "2019-06-18 18:36:00"}, "532": {"text": "Like a lot of working parents, I struggled to find good, affordable child care. Nobody should have to feel like they’re failing their kids. That’s why @RepDebHaaland &amp; I have a plan – AND a bill – for #UniversalChildCare for every child in America. https://t.co/njYzS1vINe", "date": "2019-06-18 18:34:36"}, "533": {"text": "President Trump’s Texas District Court nominee claimed that being transgender is a “delusion.” That narrow-minded bigotry deserves no place on the federal judiciary. The Senate must stand with the trans community and reject Matthew Kacsmaryk’s nomination. https://t.co/dSIEDGriw7", "date": "2019-06-18 18:04:27"}, "534": {"text": "RT @NRDems: Thanks to leaders like @SenWarren, @SenSanders, @SenatorMenendez, @SenGillibrand and many House colleagues for leading the figh…", "date": "2019-06-17 22:56:51"}, "535": {"text": "Our government isn’t here to help powerful corporations get even more powerful. Our government is here to work for all families. https://t.co/cn51ipv449", "date": "2019-06-17 19:18:45"}, "536": {"text": "I’ve got a bill with @RepCummings, @CongressmanRaja, &amp; @MarkWarner to impose massive, mandatory fines when companies like @Equifax expose people’s personal data. The govt should help prevent data breaches, not leave Americans vulnerable to identity theft. https://t.co/GTugkoudIw", "date": "2019-06-14 13:13:05"}, "537": {"text": "The government needs to be better &amp; smarter about protecting Americans’ personal information. @RepCummings, @RonWyden &amp; I want @DeptVetAffairs, @CMSGov, @USPS, &amp; @SocialSecurity to explain why they haven’t made improvements to protect consumer data &amp; when they plan to do so.", "date": "2019-06-14 13:13:04"}, "538": {"text": "This is a nightmare: almost 2 years after the massive @Equifax data breach, 4 govt agencies are still using an outdated process that relies on credit reporting agency data to verify people’s ID. They're putting Americans at even greater risk for fraud. https://t.co/Wyy60dpDGP", "date": "2019-06-14 13:13:04"}, "539": {"text": "All of the credible scientific evidence demonstrates that modern vaccines are safe, effective, and our best chance of protecting our children from diseases that can kill them. https://t.co/M7esvjhw8q", "date": "2019-06-13 19:24:42"}, "540": {"text": "I’m glad to be an original cosponsor of @PattyMurray’s bill to #FreeThePill. https://t.co/3rXQOyTL0I", "date": "2019-06-13 18:34:59"}, "541": {"text": "@FreddieMac @SenatorCarper My bill to #EndCorruptionNow would force ALL @WhiteHouse staff &amp; advisers, paid or unpaid, to follow basic ethics rules. That includes forcing senior White House advisors to fully divest from their family’s commercial real estate companies.", "date": "2019-06-13 18:14:06"}, "542": {"text": "Jared Kushner didn’t fully divest from Kushner Co &amp; now @FreddieMac is guaranteeing an $800M loan to the company. @SenatorCarper &amp; I have concerns about Kushner’s conflicts of interests &amp; if the company got special treatment. https://t.co/yBC4A1XzHR", "date": "2019-06-13 18:13:33"}, "543": {"text": "It’s time for us to decide: Are we going to be a country that only helps the rich and powerful get richer and more powerful, or are we going to be a country that invests in its future? Our #CancelMyDebt bill will do better for students, families, &amp; our economy.", "date": "2019-06-13 17:37:45"}, "544": {"text": "My student debt bill with @WhipClyburn will:\n✅Cancel up to $50k in student loan debt for 42M Americans\n✅Help close the racial wealth gap \n✅Provide meaningful access to bankruptcy relief for student borrowers\n#CancelMyDebt", "date": "2019-06-13 17:37:44"}, "545": {"text": "I graduated from a public commuter college that cost $50/semester, &amp; it opened a million doors for me. But today, we’re crushing students with debt. This crisis is real – and @WhipClyburn &amp; I have a plan to fix it. #CancelMyDebt", "date": "2019-06-13 17:37:44"}, "546": {"text": "Surprise, surprise: @realDonaldTrump’s pick to head @USCIS has compared immigrants to rats and spent his career peddling dangerous, anti-immigrant policies. Ken Cuccinelli is unfit to lead the agency tasked with fulfilling America’s promise as a nation of immigrants. https://t.co/wbr9XZUvXc", "date": "2019-06-13 02:02:49"}, "547": {"text": "Algorithms now determine who can get a mortgage, credit card, or bank account, &amp; the terms of those financial products. I want to know what the @federalreserve, @USOCC, @FDICgov &amp; @CFPB are doing to ensure lending algorithms are fair &amp; nondiscriminatory.", "date": "2019-06-12 20:44:07"}, "548": {"text": "For generations, lenders have given African American &amp; Latino families fewer loans at worse terms than similar white borrowers. Tech alone won’t fix the problem. A new analysis found that discrimination is hardwired into lending algorithms. I want answers. https://t.co/3FNd8bljfg", "date": "2019-06-12 20:43:21"}, "549": {"text": "We need to padlock the revolving door between big business &amp; government to get our democracy working for the people again. My bill to #EndCorruptionNow would force former corporate lobbyists like Charles Faulkner to take a 6-year time-out before taking a job in government.", "date": "2019-06-12 19:37:17"}, "550": {"text": ".@RepTedLieu &amp; I have urged the @StateOIG to investigate Charles Faulkner’s conduct, including whether he violated his ethics pledge &amp; any federal ethics laws during his govt service. Officials should work for the American people, not their former defense contractor clients.", "date": "2019-06-12 19:37:17"}, "551": {"text": ".@realDonaldTrump is more interested in appeasing US defense contractors than holding Saudi Arabia accountable for one of the world’s worst humanitarian catastrophes. https://t.co/DdorZGh8AA", "date": "2019-06-12 19:37:16"}, "552": {"text": "Former @StateDept official Charles Faulkner helped the Trump administration bypass Congress to fast track arms sales to Saudi Arabia &amp; the UAE – including arms made by Raytheon, his former lobbying client. That’s blatant government corruption. https://t.co/kKWXxD7BJ6", "date": "2019-06-12 19:37:16"}, "553": {"text": "The @USWNT is #1 in the world &amp; contributes higher revenues for @USSoccer than the men’s team, but they’re still paid a fraction of what the men earn. Women deserve equal pay for equal (or better!) work in offices, factories, AND on the soccer field. https://t.co/ftOSrjRyOE", "date": "2019-06-11 19:07:34"}, "554": {"text": "The House passed the #SaveTheInternet Act to restore #NetNeutrality, &amp; @senatemajldr buried it in his legislative graveyard. The internet doesn’t belong to giant companies – it belongs to all of us. I’m joining @SenMarkey &amp; @SenateDems to demand a vote for a free &amp; open internet. https://t.co/j17QfSrVHo", "date": "2019-06-11 16:39:22"}, "555": {"text": "@TheJusticeDept Consumers &amp; markets deserve confidence that @TheJusticeDept will conduct antitrust investigations into Google, Apple or any company with integrity &amp; impartiality. That’s why my bill to #EndCorruptionNow would shut down the revolving door between big business &amp; the government.", "date": "2019-06-11 15:02:37"}, "556": {"text": "The head of the antitrust division at @TheJusticeDept should not be supervising investigations into Apple or Google – former clients who paid him tens of thousands of dollars to lobby the federal govt. Makan Delrahim should recuse himself. https://t.co/AEpIrQEyVe", "date": "2019-06-11 15:01:17"}, "557": {"text": "Giant coal companies are cheating taxpayers into giving them tax subsidies intended for technologies that truly reduce emissions. @SenWhitehouse, @SenSherrodBrown &amp; I want the IRS to explain why the Trump admin is letting this happen. https://t.co/uKKbSHYdSx", "date": "2019-06-11 14:12:15"}, "558": {"text": "I’ve got a bill for that. My affordable housing plan will build 3M+ new housing units AND create a competitive grant program as an incentive for local governments to eliminate unnecessary zoning laws &amp; land use restrictions that drive up costs. https://t.co/R7fble9Qah", "date": "2019-06-10 15:01:28"}, "559": {"text": "Happy #Pride, Boston! It’s my favorite day of the year because it’s the day we celebrate love. Don’t just march in #BostonPride today – DANCE. Be #wickedproud of who you are because our diversity makes our Commonwealth &amp; our country stronger.", "date": "2019-06-08 16:56:26"}, "560": {"text": "The accreditation system for private detention centers is an utter sham. I wrote last week to private prisons, @DHSgov &amp; the accreditors looking for answers, but one thing is already clear: we need real accountability to protect the lives of everyone detained at these facilities.", "date": "2019-06-08 13:15:26"}, "561": {"text": "An independent investigator found dangerous violations of detention standards at four immigration detention facilities. And guess what? All four facilities are listed on @ACAinfo’s website as accredited institutions. This is despicable.\nhttps://t.co/N1O0K1mPtX", "date": "2019-06-08 13:14:42"}, "562": {"text": "RT @RepJayapal: Nahro al-Kasnazan spent 26 nights at the Trump Hotel while lobbying the administration for a regime change in Iran. Somethi…", "date": "2019-06-07 21:27:38"}, "563": {"text": "RT @SenSchumer: This is a lie. Without your interference, Puerto Rico and these other disaster-impacted areas would have received disaster…", "date": "2019-06-07 19:53:18"}, "564": {"text": "On National Gun Violence Awareness Day, it’s time for the Senate to finally show some political courage &amp; vote on common-sense gun safety laws to protect our kids &amp; grandkids. We’re here to work for the people, not the @NRA. #wearorange https://t.co/TsxxWomBbA", "date": "2019-06-07 15:36:20"}, "565": {"text": "I love #Pride because it's a time we all come together to celebrate love. I'll never stop fighting for a world where everyone feels safe to be who they are &amp; love who they love. https://t.co/WPOIItWHRF", "date": "2019-06-06 23:04:12"}, "566": {"text": "Congress should take the next step &amp; pass our Tax Filing Simplification Act to make filing taxes easier &amp; cheaper for all Americans. https://t.co/lUIqXTLRY9", "date": "2019-06-06 19:53:35"}, "567": {"text": "For years, giant tax prep companies have deliberately rigged the IRS program that is supposed to provide free filing services to pad their bottom lines instead. Taxpayers &amp; advocates fought back – &amp; stopped that broken program from being written into law. https://t.co/SuB3717Gyx", "date": "2019-06-06 19:52:23"}, "568": {"text": "@DHSgov @WhiteHouse @realDonaldTrump I launched an investigation w/ @RepJayapal on General Kelly joining the board of a company that runs the country’s largest detention center for migrant kids. Our anti-corruption bill would lock the revolving door to make these sorts of rapid, cynical, &amp; unethical actions illegal.", "date": "2019-06-06 18:12:41"}, "569": {"text": "Former @DHSgov Secretary &amp; @WhiteHouse Chief of Staff John Kelly was at the center of @realDonaldTrump’s policies that separated families &amp; locked kids in cages. It’s outrageous that he’s now set to cash in on those inhumane policies at Caliburn. https://t.co/8fwYu7iNYG", "date": "2019-06-06 18:11:49"}, "570": {"text": "@MassGovernor @CAgovernor Our federal marijuana laws perpetuate our broken criminal justice system, impede research, restrict veterans' access &amp; hinder economic development. Marijuana should be legalized, &amp; I’ll work with anyone – GOP, Dem, Independent, Libertarian, vegetarian – to push for these reforms.", "date": "2019-06-06 15:40:40"}, "571": {"text": "12 GOP &amp; Democratic governors – led by @MassGovernor Baker &amp; @CAgovernor Newsom – have endorsed my bipartisan bill to protect states’ right to enforce their own marijuana laws without federal interference. This is long overdue. https://t.co/ChitIdejZc", "date": "2019-06-06 15:40:19"}, "572": {"text": "On #DDay75thAnniversary, we remember the sacrifices of American and Allied troops to liberate Europe from the Nazi regime. We also remember that America is strong, but we are even stronger when we work with our allies to build a more peaceful world. #DDay75", "date": "2019-06-06 13:01:12"}, "573": {"text": "The new SEC rules make it easier for Wall St to cheat families out of their life savings. Workers are facing a retirement crisis. The last thing the SEC should do is give the green light for brokers &amp; advisers to trick people into buying harmful products. https://t.co/6KmS62mpze", "date": "2019-06-05 23:45:46"}, "574": {"text": "Unlike Big Tech, the American people can’t afford to hire an “army” of lobbyists to march on Capitol Hill when Washington isn’t working for them. That’s why my plan to #EndCorruptionNow would end lobbying as we know it. https://t.co/vg77ZSBb5H", "date": "2019-06-05 23:38:04"}, "575": {"text": "Betsy DeVos should focus on real solutions to the student debt crisis – not more ways to trick &amp; trap students in debt. @RepPressley, @RepKatiePorter &amp; I want answers about @usedgov’s ISA plans to determine if they’re acting in students’ best interest. https://t.co/ditxMygtX7", "date": "2019-06-05 23:28:57"}, "576": {"text": "It's disturbing that @usedgov is exploring Income Share Agreements – student debt contracts that allow private investors to exploit students (especially students of color) as badly as some of the most predatory &amp; costly private student loans. https://t.co/qfngVfscnF", "date": "2019-06-05 23:28:15"}, "577": {"text": "It’s time to stop handing out tax breaks to Big Oil &amp; padding corporate profits at our communities’ expense. Investing in clean energy &amp; reducing carbon pollution are investments in our health, our environment, our national security, &amp; our economy. #climaterisks #climatecosts", "date": "2019-06-05 21:35:41"}, "578": {"text": "Even some giant multinational corporations are starting to disclose to their shareholders that climate change will have an enormous effect on their bottom line – &amp; I have a bill to force them all to fess up. #climatecosts https://t.co/5zwGDWxTm9", "date": "2019-06-05 21:35:41"}, "579": {"text": "The climate crisis poses an existential threat to our country &amp; our planet. We see #climaterisks every day: record floods. Devastating wildfires. Monster storms. It jeopardizes our air, water, homes, businesses, food, infrastructure, economy, &amp; national security. #climatecosts", "date": "2019-06-05 21:35:40"}, "580": {"text": "Last year, Hurricane Florence tore through NC. Hurricane Michael ripped through FL. And floods put Plains states like NE underwater. It will cost US taxpayers billions of dollars just to repair three bases because of those storms. #climatecosts https://t.co/UgHjCNSTYO", "date": "2019-06-05 21:35:40"}, "581": {"text": "We’re proud that Massachusetts leads the way on health care coverage. Health care is a basic human right, and we fight for basic human rights. https://t.co/qCJI14Rc86", "date": "2019-06-05 19:34:16"}, "582": {"text": "The House sent an important message today: we must protect Dreamers, TPS holders, &amp; DED beneficiaries from @realDonaldTrump’s racist, anti-immigrant agenda. The Senate should pass this bill immediately. https://t.co/UhM5cmWk3N #DreamAndPromiseNow", "date": "2019-06-05 01:23:15"}, "583": {"text": "It’s been 2 months since the House voted to reauthorize the Violence Against Women Act &amp; the @SenateGOP haven’t done a thing. Women – especially Native women &amp; women of color – can’t wait any longer, @senatemajldr. It’s time to vote on the House version of VAWA. #VAWA4ALL #HR1585", "date": "2019-06-04 21:44:55"}, "584": {"text": "Even Silicon Valley is cashing in on the Pentagon’s corrupt contracting system. My @DeptofDefense Ethics &amp; Anti-Corruption Act with @RepSpeier would lock the revolving door so that the Pentagon isn't working for the benefit of past-and-future employers. https://t.co/8OVKe2kfAM", "date": "2019-06-04 19:52:43"}, "585": {"text": "People always say that big change is impossible. That’s what they told the suffragettes – but they got organized, persisted, &amp; 100 years ago today, the Senate passed the 19th Amendment to give women the right to vote. We can change the course of history – if we fight for it. https://t.co/ivuxrhpGvp", "date": "2019-06-04 16:25:51"}, "586": {"text": "Massachusetts families are fighting for their lives against the opioid epidemic – and the federal government isn't doing enough to help. My plan, the #CAREact, would spend $100 billion on treatment, recovery, and research to end this crisis. \nhttps://t.co/j8fiOKj4nj", "date": "2019-06-03 18:31:35"}, "587": {"text": "@ICEgov @ACAinfo I'm opening an investigation into the accreditation process for private detention operators. If federal agencies rely on @ACAinfo for detainees' safety, they must be accountable for proper conditions before we hand these companies huge govt contracts. https://t.co/DrIKPZNAj1", "date": "2019-05-31 18:23:36"}, "588": {"text": "@ICEgov The American Correctional Association is in charge of accrediting private prison facilities to ensure they meet basic standards. But @ACAinfo is ALSO the #1 trade association of the private prison industry. Those perverse incentives are a recipe for disaster.", "date": "2019-05-31 18:22:48"}, "589": {"text": ".@ICEgov detains almost 50k immigrants – many in facilities run by for-profit companies. I’ve repeatedly pushed these contractors, auditors, &amp; ICE about their failure to protect the health &amp; safety of detainees. Today I’m taking another step. https://t.co/LABpj6Mcpn", "date": "2019-05-31 18:22:07"}, "590": {"text": "Thousands of loyal @Sears employees lost their jobs because of Eddie Lampert. Now he’s trying to betray his promise to pay them the severance they earned. @RepAOC and I are demanding answers. https://t.co/nteJG502Ie", "date": "2019-05-31 17:05:29"}, "591": {"text": "RT @RepAOC: Last week @senwarren and I sent a letter to @stevemnuchin1. This week, we’re sending one to Sears CEO, Eddie Lampert.\n\n👇 https:…", "date": "2019-05-31 17:03:48"}, "592": {"text": "The CRS report confirmed what most Americans already knew: the #GOPTaxScam was a heist that stole from middle class families &amp; handed that money over to big campaign donors. That’s corruption. It’s long past time for the rich &amp; powerful to pay their fair share.", "date": "2019-05-30 19:39:24"}, "593": {"text": "So if they didn’t raise wages for workers or spend the money to grow the economy, what did CEOs use all of that #GOPTaxScam money for? Stock buybacks that artificially pump up the company’s stock price for wealthy shareholders. https://t.co/0PuL4B33Zo", "date": "2019-05-30 19:39:23"}, "594": {"text": "Did people spend more money because of the #GOPTaxScam? Nope. Turns out that the ultra-rich who got those tax breaks don’t need even more money for yachts &amp; diamonds. https://t.co/jJqxIOSmdU", "date": "2019-05-30 19:39:22"}, "595": {"text": "Did giant corporations use their #GOPTaxScam money to raise workers’ wages? Nope. No trickle-down here. https://t.co/tM7H306Ayf", "date": "2019-05-30 19:39:22"}, "596": {"text": "Did the #GOPTaxScam grow the economy? Nope. https://t.co/pcki2uoT02", "date": "2019-05-30 19:39:21"}, "597": {"text": "First off, let’s just be clear: The #GOPTaxScam helped giant corporations a heck of a lot more than middle class families. That’s a fact. https://t.co/fsBFhmEWrg", "date": "2019-05-30 19:39:20"}, "598": {"text": "The #GOPTaxScam was a $1.5 trillion giveaway to billionaires &amp; giant corporations. That’s not a conspiracy theory or partisan attack. The nonpartisan Congressional Research Service just ran the 2018 numbers. Let’s look at the facts: https://t.co/tp4wbO1kMq", "date": "2019-05-30 19:39:20"}, "599": {"text": "I struggled for years to juggle my family &amp; my teaching job. The constant search for good, affordable child care nearly knocked me out. Luckily, my Aunt Bee stepped in to help. But not every family has an Aunt Bee – and that’s why I’m fighting for #UniversalChildCare. https://t.co/PhPVQl3aIU", "date": "2019-05-30 16:00:24"}, "600": {"text": "Workers at @UMassMemorial provide life-saving care for people in Central MA. I’m very glad to see that @sharehospitalu1, @AFSCME &amp; UMass Memorial have ratified a new 4-yr contract that improves patient care, raises wages, &amp; strengthens workers' voices. https://t.co/MZ2GMort9j", "date": "2019-05-30 13:12:21"}, "601": {"text": "If the companies that belong to the @USChamber and @ShopFloorNAM really support efforts to #ActOnClimate, they should put people over profits and stop funneling money to the #ChamberOfCarbon and other anti-climate lobbying groups.", "date": "2019-05-29 20:34:44"}, "602": {"text": "This is bigger than 2 anti-climate lobbying groups – it’s also about the companies (many of which have made public commitments to fight climate change) that support them. They're putting their reputations – and our communities – at risk. https://t.co/9IEijuVKmZ", "date": "2019-05-29 20:34:43"}, "603": {"text": ".@ShopFloorNAM has repeatedly opposed federal action on the climate crisis – and worked to protect Big Oil by supporting Arctic and offshore oil drilling and fighting the transition to a clean energy economy. #ManufacturedFacts. https://t.co/FnPs6NTxte", "date": "2019-05-29 20:34:43"}, "604": {"text": "The @USChamber has supported Trump Admin efforts to roll back the Clean Power Plan and funded a misleading study that @realDonaldTrump used to justify withdrawing from the Paris Agreement. It might as well change its name to the #ChamberOfCarbon. https://t.co/5rE8ZYc9gj", "date": "2019-05-29 20:34:42"}, "605": {"text": "What do the @USChamber and @ShopFloorNAM have in common? They’re 2 of corporate America’s top lobbying groups. And they’re both leading the charge to stop Congress from combatting the climate crisis and saving our planet. https://t.co/AKQFeXQl39", "date": "2019-05-29 20:34:42"}, "606": {"text": "I read the Mueller Report. In fact, I re-read portions of it on the floor of the United States Senate. It should be crystal clear to anyone who read the report: Congress must hold the President accountable.\n\nhttps://t.co/lN32DJmKC5", "date": "2019-05-29 16:17:48"}, "607": {"text": ".@BostonLogan airport workers keep us safe and get us where we need to go. I’m glad that @MassAGO is holding contractors accountable, and making sure workers are paid every penny they’ve earned. https://t.co/bcCIkbAKJp", "date": "2019-05-28 19:26:33"}, "608": {"text": "On #MemorialDay, we remember the brave women and men who made the ultimate sacrifice for our country. We honor them by following through on the promises we made to their families, and all those who serve. https://t.co/pzg8HvNzdY", "date": "2019-05-27 13:01:10"}, "609": {"text": "Selling more weapons to Saudi Arabia doesn't make America safer or align with our country's values. It only benefits defense contractors and @realDonaldTrump's alarming desire to sow chaos abroad. l'll do everything I can in Congress to stop it.", "date": "2019-05-25 17:03:43"}, "610": {"text": ".@realDonaldTrump wants to keep selling American weapons to his Saudi buddies. But he knows Congress won't approve selling to a regime that's bombed thousands of Yemeni civilians and murdered journalist Jamal Khashoggi – so he's trying to go around us. \nhttps://t.co/Yvx0g21gR9", "date": "2019-05-25 17:03:43"}, "611": {"text": "This is a despicable act of cowardice. This vandalism is meant to divide us – but I know it only strengthens the resolve of the people of Dorchester and the Commonwealth of Massachusetts to remember and honor those who made the ultimate sacrifice. https://t.co/gDy3rvIYkC", "date": "2019-05-24 20:06:52"}, "612": {"text": "Last week, @SenatorMenendez, @NydiaVelazquez &amp; I questioned @FEMA about the delays. Now, the agency has confirmed the hospital on Vieques will be rebuilt. It's a critical win for the people of Puerto Rico – and we’ll be with them every step of the way. https://t.co/1PWLW37Nta", "date": "2019-05-24 17:03:52"}, "613": {"text": "For nearly 2 years, 9,000 US citizens living on the island of Vieques, Puerto Rico haven't had access to a local hospital. Theirs was destroyed in Hurricane Maria, and despite promises to rebuild, @FEMA kept delaying the project. https://t.co/TtfPxiTrtN", "date": "2019-05-24 17:03:52"}, "614": {"text": "Last night, I voted for a major bipartisan disaster relief package that will help people across the country recover from natural disasters like hurricanes, flooding, and wildfires. When we work together, our nation comes out on top.  https://t.co/EHQ98gVDCL", "date": "2019-05-24 15:23:42"}, "615": {"text": "10 years ago this week, Congress passed a bipartisan bill to help get the tricks &amp; traps out of the fine print of credit card agreements – but the fight’s not over. We need a strong @CFPB to hold credit card companies accountable when they cheat customers &amp; break the law. https://t.co/8a8OCiEQDx", "date": "2019-05-24 00:03:23"}, "616": {"text": "I'm proud to cosponsor the Women’s Health Protection Act. It would #StopTheBans by enshrining Roe v. Wade into federal law – ensuring everyone in this country has access to abortion, no matter where they live. #ActForWomen https://t.co/ePxhIlIj4n", "date": "2019-05-23 20:51:27"}, "617": {"text": "I was wrong. It's not 5 children dead – it's SIX. The Trump Admin just disclosed a 10-yr-old girl died in federal custody last year.\n\nAre there more we don't know about? We need oversight. We need accountability. We need to do everything we can to keep this from happening again. https://t.co/65yQ0nxda0", "date": "2019-05-23 19:32:51"}, "618": {"text": "I stand with @AOC, @forrespect, and the 250,000 workers who lost jobs and severance pay when Wall Street fat cats @StevenMnuchin1 and Eddie Lampert gutted companies like @Sears. Together, we'll keep fighting for justice, accountability, and better futures for all. https://t.co/xhNSNfXcYy", "date": "2019-05-23 18:08:14"}, "619": {"text": "RT @RepAOC: .@forrespect has empowered workers around the nation to fight for an economy that allows us to work in dignity. Meet some of th…", "date": "2019-05-23 15:54:43"}, "620": {"text": "Washington is supposed to work for everyone. Instead, the rich &amp; powerful like @StevenMnuchin1 &amp; Eddie Lampert use it to become even more rich &amp; powerful, while workers are left holding the bag. This is the DC swamp at its worst.  https://t.co/qEbIL9JAM8", "date": "2019-05-23 12:21:40"}, "621": {"text": "Steven Mnuchin and his college roommate Eddie Lampert (the CEO of Sears) piled the company with debt, closed thousands of stores, and enriched themselves at the expense of workers. Now, @StevenMnuchin1 could have a say in decisions affecting @Sears. https://t.co/042ENythbO", "date": "2019-05-23 12:20:30"}, "622": {"text": "Before @StevenMnuchin1 became Treasury Secretary, he was on the board of @Sears, where he helped gut the company and fire thousands of employees. Now, @AOC and I have some tough questions for him. https://t.co/hS25rPOsYa", "date": "2019-05-23 12:16:49"}, "623": {"text": "It's been 48 days since the Violence Against Women Act passed the House. But @SenateMajLdr McConnell would rather help his @NRA buddies than bring #VAWA to the floor. This is ridiculous. Women's lives are more important than gun lobbyists' wish lists. https://t.co/hEVLuVTTGN", "date": "2019-05-22 19:46:42"}, "624": {"text": "In December I called for @DHSOIG to investigate these deaths at the border, and that review is underway. But we need answers now: why are children dying after being taken into @CBP custody and what steps is CBP taking to end this string of tragedies?\nhttps://t.co/CHZS4vek4f", "date": "2019-05-22 18:00:58"}, "625": {"text": "Two more immigrant children died over the past week after having been in @CBP custody. That’s five deaths in the past six months. It’s appalling. CBP owes the American people an explanation for these children’s deaths and its failure to keep them safe. https://t.co/QapeFVGH8z", "date": "2019-05-22 18:00:58"}, "626": {"text": "RT @SenSchumer: We know that the Russians are trying to interfere in our elections again in 2020.\n\nBut @SenateMajLdr Mitch McConnell is bur…", "date": "2019-05-22 13:35:58"}, "627": {"text": "Not on my watch. I’m cosponsoring legislation to stop us from going to war with Iran. Congress must use its constitutional authority to stop @realDonaldTrump from dragging us into another forever war. https://t.co/EGMvnqDBCX", "date": "2019-05-21 22:07:53"}, "628": {"text": "Americans are tired of reckless and endless wars. We saw what the disastrous Iraq War did. Thousands of servicemembers dead and wounded. America's reputation damaged abroad. Now @realDonaldTrump’s advisors are pushing Shock and Awe 2.0 – this time against Iran.", "date": "2019-05-21 22:07:43"}, "629": {"text": "RT @cspan: CLIP: Complete exchange between Rep. Pressley and Secretary Carson.\n\n@SecretaryCarson: \"Reclaiming my time.\"\n\n@RepPressley: \"You…", "date": "2019-05-21 21:28:02"}, "630": {"text": ".@SecretaryCarson can’t distinguish between a cookie and a home that’s been foreclosed on. Luckily, @RepKatiePorter was able to school him on the difference. https://t.co/Rh1ETeCZDw", "date": "2019-05-21 20:01:04"}, "631": {"text": "Republican state legislators are already stripping away women's constitutional rights. And @realDonaldTrump &amp; @SenateGOP are making their jobs easier by appointing judges who could overturn Roe v. Wade. I'll be voting no on every one of these guys. https://t.co/Ktd8GrSDHH", "date": "2019-05-21 17:32:53"}, "632": {"text": "Kenneth Bell once argued the \"indefensibility of the abortion rights position,\" claiming there was \"no middle ground.\" Thanks to the @SenateGOP, he could wind up on the federal bench in North Carolina, where legislators have already considered an anti-abortion bill this year.", "date": "2019-05-21 17:32:53"}, "633": {"text": "Carl Nichols, @realDonaldTrump's nominee to be a Judge in the District of Washington DC, argued that pharmacists should be able to deny patients access to emergency contraceptives (which they're required by law to provide) because of religious objections.", "date": "2019-05-21 17:32:52"}, "634": {"text": "It gets worse. Stephen Clark sponsored an ad calling Roe v. Wade “BAD LAW” &amp; comparing it to Dred Scott, a heinous Supreme Court decision that deprived Black Americans of their constitutional rights. No wonder Republicans want him on the federal bench. https://t.co/N3qqZDDuXo", "date": "2019-05-21 17:32:52"}, "635": {"text": "Howard Nielson, nominee to be a Judge for the District of Utah, defended a highly restrictive Texas law that would have prevented countless women from accessing abortions. The Supreme Court disagreed and ultimately struck it down. https://t.co/XgHRaW9uXs", "date": "2019-05-21 17:32:51"}, "636": {"text": "Daniel Collins argued in a brief submitted in the Hobby Lobby case that companies should be able to deny contraceptive coverage to employees. Now @SenateGOP and @realDonaldTrump want him on the Ninth Circuit. https://t.co/7FagIBr0uG", "date": "2019-05-21 17:32:51"}, "637": {"text": "Last week, Alabama passed an extreme abortion ban in a thinly veiled attempt to overturn Roe v. Wade. This week, @SenateGOP is trying to shove through 5 judges who have spent their careers undermining women's reproductive rights. This is a full-scale attack on women's health.", "date": "2019-05-21 17:32:50"}, "638": {"text": "It’s been over 24 hours. No more spoiler alerts. Here’s why @AOC and I are officially on #TeamSansa now. https://t.co/WKKHDbFz1M", "date": "2019-05-21 15:55:16"}, "639": {"text": "Patients with mental health &amp; substance use disorders deserve the same access to care as patients with physical health conditions, but insurance companies deny these services to cut costs. @RepJoeKennedy &amp; I have a plan so people get the care they need. https://t.co/XFy0Y7PDbQ", "date": "2019-05-21 13:05:29"}, "640": {"text": "A group of lawyers, professors &amp; judges are about to vote on whether to subject consumers to abusive contracts they don't negotiate and can't opt out of. This dangerous proposal will shape decisions in courts across the country – it should be voted down. https://t.co/V6aVf2QYoz", "date": "2019-05-21 00:42:59"}, "641": {"text": "I introduced this legislation to help provide tribal nations with the resources they need to combat child abuse &amp; neglect. I’m very grateful for @NCAI1944 &amp; @NativeChildren's support of this bill. https://t.co/dkUpJBAb9p", "date": "2019-05-20 23:04:56"}, "642": {"text": "The @CFPB and @usedgov are supposed to protect students from loan companies that break the law. But @BetsyDeVosED has given these companies the green light to ignore regulators’ oversight. Students deserve better than this. https://t.co/MVqkop0ZBh", "date": "2019-05-20 20:10:45"}, "643": {"text": "RT @RepJayapal: Our justice system’s relationship with corporations and billionaires is not a new phenomenon - but under this administratio…", "date": "2019-05-20 17:50:16"}, "644": {"text": "Rising carbon dioxide levels are driving the climate crisis &amp; threaten the safety of every American. But @SecBernhardt “hasn’t lost any sleep over it.” We need an @Interior Secretary who cares more about our environment than the profits of his former and future lobbying clients. https://t.co/C9r4OGrp2M", "date": "2019-05-17 22:22:13"}, "645": {"text": "These actions are meant to inspire fear in places of worship and joy. But we won’t let that happen. By coming together to stand against anti-Semitism and other forms of bigotry, our communities will only grow stronger. https://t.co/05VaMLtbNg", "date": "2019-05-17 21:17:05"}, "646": {"text": "Exactly 15 years after Massachusetts became the first state to legalize gay marriage, the House has passed the #EqualityAct. \n\nI'll fight to do the same in the Senate. Because LGBTQ Americans deserve to be treated equally, no matter where they live – or who they love. https://t.co/zgkX6QsM0s", "date": "2019-05-17 17:46:10"}, "647": {"text": "Over and over again, I’ve spoken out against right-wing efforts to ban abortion. Now it's time for Congress to act. I have a plan to secure women’s access to reproductive care through federal, statutory rights that parallel Roe’s protections. Let’s #StopTheBans. https://t.co/2VfHIRN10R", "date": "2019-05-17 16:06:42"}, "648": {"text": "RT @RepRoKhanna: In 2017, @SenWarren, @RepTimRyan and I sent letters urging DoD IG to investigate TransDigm’s contracts after we learned Tr…", "date": "2019-05-16 21:07:32"}, "649": {"text": "We have two separate &amp; very unequal justice systems: one for the wealthy &amp; well connected, &amp; one for everyone else. Read my new essay with the @BrennanCenter on how we enforce the principle engraved on the Supreme Court: \"Equal Justice Under Law.\" https://t.co/TvgVqp084j", "date": "2019-05-16 19:03:49"}, "650": {"text": "RT @SenTinaSmith: 🚨 Jeff Rosen was hand-picked by William Barr to be the President’s puppet. We need someone who will ensure that our laws…", "date": "2019-05-16 17:49:24"}, "651": {"text": "This student loan company is literally under investigation and being sued by states and the federal government for cheating students to make more money.\n \nBut congrats on breaking into the #Fortune500, @Navient. I didn’t know they had a special section for scammers. https://t.co/6Pd1LUPOqH", "date": "2019-05-16 16:58:58"}, "652": {"text": "Tomorrow is the anniversary of the landmark Brown v. Board of Education. 65 years later, Wendy Vitter, @realDonaldTrump’s pick for the LA District Court, won't say whether that case was correctly decided. The Senate must reject her nomination.#CourtsMatter https://t.co/8xM6y5jdSn", "date": "2019-05-16 15:33:31"}, "653": {"text": "The defense industry will inevitably have a seat at the table, but they shouldn’t get to own the table. US security &amp; values must come ahead of private companies' profits. Congress should stand up to the military industrial complex &amp; pass the DOD Ethics &amp; Anti-Corruption Act.", "date": "2019-05-16 14:45:54"}, "654": {"text": "My bill with @RepSpeier would:\n-Slam shut the revolving door between defense contractors &amp; the Pentagon \n-Ban DOD officials from owning defense contractor stock\n-Limit foreign gov’ts from hiring former US national security officials\n-Increase transparency of lobbying", "date": "2019-05-16 14:45:53"}, "655": {"text": "Our national security decisions should be driven only by what best keeps Americans safe – not by what makes the defense industry the most money. That’s why I’m introducing new legislation to loosen the stranglehold defense contractors have on the Pentagon and #EndCorruptionNow. https://t.co/oEiY92lMoX", "date": "2019-05-16 14:45:53"}, "656": {"text": "I’ve said it for years: state &amp; federal efforts to defund @PPFA, gut Title X &amp; ban abortion are part of a deliberate, methodical, orchestrated attack on women’s rights. We’ll fight back for reproductive care – including access to safe &amp; legal abortion – as many times as it takes. https://t.co/9MmI26BidY", "date": "2019-05-15 23:53:06"}, "657": {"text": "The @USOCC has the authority to review @WellsFargo's pick for a new CEO. But they didn't use it when Tim Sloan was put in charge. I got Comptroller Otting to agree to review Sloan's successor, &amp; urged him to make that info public so Americans can hold Wells (&amp; him) accountable. https://t.co/1CayhwDMrL", "date": "2019-05-15 20:00:25"}, "658": {"text": "RT @RepEscobar: Climate change is a major threat to our national security. And military leaders agree.\n\nToday, @SenWarren and I introduced…", "date": "2019-05-15 18:54:12"}, "659": {"text": "Alabama lawmakers have voted to effectively ban abortion in the state. We see this for what it is: a direct attack on Roe v. Wade, and on women all across this country. \n\nWe will fight these attacks every step of the way.", "date": "2019-05-15 14:52:52"}, "660": {"text": "We cannot let the Trump Admin drag us into yet another war in the Middle East. This is exactly why the President doesn't have the constitutional authority to declare war. That's Congress’s job – and that's why I'm supporting this legislation to prevent a war with Iran. https://t.co/eb7QBaERbK", "date": "2019-05-14 23:35:07"}, "661": {"text": "I support the #EqualityAct because nobody should be discriminated against for who they are or who they love – period. https://t.co/4WGcCrAqxQ", "date": "2019-05-14 21:52:38"}, "662": {"text": "If we want to stop Wall Street banks &amp; giant companies from cheating customers, hurting workers, &amp; polluting our planet, we can’t sit back &amp; do nothing. We have to hold corporate criminals accountable. I’ve introduced legislation that would do just that. https://t.co/8DmDhZI6WE", "date": "2019-05-14 20:35:07"}, "663": {"text": "After @realDonaldTrump took office, the number of white collar crime enforcement actions pursued by the federal gov't declined to a 20-year-low. Fines and enforcement actions have dropped across nearly every agency. Cases brought by the @CFPB, SEC, &amp; DOJ have dropped by 50%.", "date": "2019-05-14 20:35:06"}, "664": {"text": "It’s already clear that our gov't is rigged in favor of the rich and powerful. But in case you need a refresher, @RepJayapal and I have a new report outlining how the Trump Admin is letting corporate criminals run rampant. https://t.co/RGH3ZW3M8u", "date": "2019-05-14 20:35:04"}, "665": {"text": "Dr. @YngvildOlsen is absolutely right. It's time to end the discrimination and fear surrounding addiction, and instead respond with courage. It's time for Congress to pass the #CAREact.  https://t.co/mklYxAQUeM", "date": "2019-05-14 17:00:57"}, "666": {"text": "RT @SenatorDurbin: Student loan debt is at crisis levels and it is ruining lives. I introduced a bill today w/@SenWarren, @RepJerryNadler,…", "date": "2019-05-10 21:21:32"}, "667": {"text": "Four years ago, @DrLeanaWen came to my Senate office &amp; trained me in the use of naloxone, the opioid overdose reversal drug. Our #CAREact includes $500 million/yr of funding to expand access to this life-saving medicine. https://t.co/NZrRdcvvMP", "date": "2019-05-10 18:43:32"}, "668": {"text": "RT @thejointstaff: #GenDunford on #MilitarySpouseAppreciationDay: \"You are our lifeline and our greatest source of strength.\"\n\nWatch his fu…", "date": "2019-05-10 18:05:19"}, "669": {"text": "RT @MachinistsUnion: Insulting. Without an IAM contract, many @Delta workers have to work 2-3 jobs just to survive. They have no time to pl…", "date": "2019-05-10 17:25:12"}, "670": {"text": "The biggest drug companies have made billions of dollars pushing powerful &amp; addictive drugs that contribute to our opioid epidemic. When drug manufacturers break the law, their execs should be held personally accountable. My corporate accountability bill will make sure of it. https://t.co/qktEm4F5FV", "date": "2019-05-09 21:50:46"}, "671": {"text": "Insys Therapeutics made a spray out of the powerful opioid fentanyl for cancer patients, illegally marketed it to people with milder pain, &amp; bribed doctors to overprescribe it. Their former CEO John Kapoor &amp; 4 other executives are going to jail. https://t.co/SaCBQA6BwT", "date": "2019-05-09 21:50:40"}, "672": {"text": "I’m happy to fight shoulder-to-shoulder with @RepLoriTrahan for families in Central MA, the Merrimack Valley, &amp; all across this country. Great to see everyone at #MA3InDC today! https://t.co/DkWV7EVUUu", "date": "2019-05-09 21:19:16"}, "673": {"text": "Long before I was a senator, I fought to keep student loans dischargeable in bankruptcy – but Congress chipped away at this critical protection. I’m glad to work with @SenatorDurbin on the Student Borrower Bankruptcy Relief Act to restore this protection. https://t.co/L8Zh5S6tLn", "date": "2019-05-09 20:04:32"}, "674": {"text": "Let’s do it! #CAREact https://t.co/4M4EVOyh8Y", "date": "2019-05-09 19:02:06"}, "675": {"text": ".@CNNBusiness let me explain (in more than 280 characters) why that @Chase tweet last week was a punch in the gut – it perpetuates the myth that irresponsible spending is the reason for Americans’ dire financial straits. (Spoiler alert: It's not.) https://t.co/WhRKdJq8dU", "date": "2019-05-09 15:09:47"}, "676": {"text": "RT @votevets: The Military Housing Oversight and Service Member Protection Act, embedded below, was proposed by @SenWarren and @RepDebHaala…", "date": "2019-05-08 23:08:45"}, "677": {"text": "Uber &amp; Lyft are worth billions of dollars, but their business model depends, in part, on low wages for their drivers. I stand with ride-sharing workers who are organizing for better pay &amp; benefits &amp; the opportunity to bargain collectively. https://t.co/pmVAZUNDLW", "date": "2019-05-08 21:14:28"}, "678": {"text": "RT @PoliceForReform: We are proud to join the 200+ orgs in endorsing the #CAREAct today. The #opioidcrisis is a public health crisis. https…", "date": "2019-05-08 20:40:31"}, "679": {"text": "RT @CountyBerkshire: The #CAREact will save lives by directing federal funding to #opioid prevention &amp; medication treatments. The opioid ep…", "date": "2019-05-08 20:28:56"}, "680": {"text": "RT @david_sheff: It IS a bold plan-the boldest yet. 130 deaths a day, # 1 cause of death 4 people under 50, $600 billion a year in healthca…", "date": "2019-05-08 20:18:10"}, "681": {"text": "RT @RepKClark: The #CAREAct will provide sorely needed resources to prevent, treat &amp; end substance use disorder. Families are counting on u…", "date": "2019-05-08 20:05:32"}, "682": {"text": "RT @RepRoKhanna: The opioid crisis has cost Americans $500 billion each year, and claimed over 70,000 lives in 2017. It’s long past time to…", "date": "2019-05-08 19:26:13"}, "683": {"text": "RT @StopOpioidOD: Thank you @SenWarren and @RepCummings for your leadership in introducing the #CAREAct to address the opioid overdose cris…", "date": "2019-05-08 19:17:29"}, "684": {"text": "RT @SenatorBaldwin: I support the #CAREAct because we need a bold plan and long term commitment to addressing the opioid and substance use…", "date": "2019-05-08 19:10:02"}, "685": {"text": "RT @MassAGO: If we are going to stop the opioid epidemic in Massachusetts, we need adequate funding for treatment, recovery, and harm reduc…", "date": "2019-05-08 19:02:49"}, "686": {"text": "RT @ASAMorg: Thank you @SenWarren for your leadership in introducing the #CAREAct – bold, comprehensive legislation that would authorize th…", "date": "2019-05-08 18:55:12"}, "687": {"text": "RT @RepCummings: I’m proud to introduce #TheCAREAct with @SenWarren to provide resources to treat the #opioidcrisis as the public health em…", "date": "2019-05-08 18:45:46"}, "688": {"text": "Congress needs to stand up to the #ChamberOfCarbon. And companies need to start walking the talk. If they really support efforts to combat climate change, they shouldn’t keep funneling money to the @USChamber while Big Oil uses it to do its dirty work. https://t.co/lsipUDWCbj", "date": "2019-05-08 17:59:26"}, "689": {"text": "The @USChamber has spent millions since 2010 to support climate-denying Republicans. But when @SenWhitehouse and I surveyed the Chamber’s board members, not a single one would endorse the org’s anti-climate position. So where’s the money coming from? https://t.co/N6aXlFOWuB", "date": "2019-05-08 17:59:25"}, "690": {"text": "The #CAREact is the most ambitious legislation ever introduced in Congress to confront the opioid epidemic, &amp; that's why 200+ organizations support this bill. It’s long past time for the federal government to step up &amp; take action. https://t.co/1FFvxAv9u7", "date": "2019-05-08 13:40:45"}, "691": {"text": "Construction workers are 6 times more likely to die of opioid overdoses than any other job, so the #CAREact has a new grant program to help high-risk workers. I’m proud that labor groups including the @AFLCIO &amp; @NABTU support our bill to fight this crisis. https://t.co/FE6BNi6E7n", "date": "2019-05-08 13:38:22"}, "692": {"text": "In Massachusetts, 1 in 4 people know someone who has died of an opioid overdose – but our communities just don’t have the resources to help everyone who needs it. Under our #CAREact, MA would receive $120.1 million to fight substance use disorders &amp; the opioid epidemic. https://t.co/CKna3XG5P1", "date": "2019-05-08 13:36:35"}, "693": {"text": "30 years ago, the Ryan White CARE Act transformed the fight against HIV/AIDS. Our new #CAREact to fight the opioid crisis is modeled on that bill – &amp; invests $100 billion in states &amp; local communities for prevention, treatment, &amp; recovery services. https://t.co/yotQ1IA8dq", "date": "2019-05-08 13:34:20"}, "694": {"text": "130 Americans die every day from an opioid overdose. That’s like a plane crash every day. This is a public health emergency – &amp; @RepCummings &amp; I have a bold plan to fight it. #CAREact https://t.co/xMiYgsHRzM", "date": "2019-05-08 13:32:50"}, "695": {"text": "A year ago today, the Trump admin made family separation the official policy of the US. I saw firsthand how that policy was cruelly carried out – children separated from their mothers in detention. We won't stop fighting #UntilEveryFamilyIsReunited.  https://t.co/JDqgTvNobb", "date": "2019-05-07 23:09:45"}, "696": {"text": "Enough is enough. Credit reporting agencies like @Equifax collect our information without our permission. If they allow that information to get stolen, they need to be held accountable. My colleagues &amp; I urged the @FTC &amp; the @CFPB to do just that. https://t.co/XcPk7oxULN", "date": "2019-05-07 20:31:42"}, "697": {"text": ".@Equifax didn’t just allow the breach to happen. It also initially refused to come clean with the public &amp; help consumers protect themselves. And according to a new Congressional report, the company is STILL failing consumers months later. https://t.co/YIpFAELakB", "date": "2019-05-07 20:30:54"}, "698": {"text": ".@Equifax let hackers steal personal info from almost 150 million Americans. If this bill had been the law before the breach, the company would have paid at least $1.5 billion in fines, half of which would have gone straight back to affected consumers. https://t.co/GTugkoudIw", "date": "2019-05-07 20:29:16"}, "699": {"text": "It’s been nearly 2 years since the #EquifaxBreach – &amp; Congress still hasn’t acted to protect consumers or prevent the next breach. So @MarkWarner @RepCummings, @CongressmanRaja &amp; I are reintroducing a bill to impose massive, mandatory fines when companies expose personal data. https://t.co/3AglWEMWMj", "date": "2019-05-07 20:28:24"}, "700": {"text": "You and I both took an oath, @SenateMajLdr McConnell. To defend the Constitution of the United States – not to protect @realDonaldTrump. Congress must consider the evidence provided in the Mueller Report and hold the President accountable. https://t.co/H2aoBCl7AD", "date": "2019-05-07 15:35:53"}, "701": {"text": "I grew up to be a teacher, then a senator – in no small part because of Mrs. Lee, my 2nd grade teacher. She opened the door to a world of opportunity for me. If we want to invest in brighter futures for our kids, we must invest more in our teachers today. #TeacherAppreciationWeek https://t.co/BakUkBBR80", "date": "2019-05-06 18:05:11"}, "702": {"text": "Home care workers deserve higher wages, better benefits, and stronger collective bargaining rights. But the Trump Admin is trying to roll back their rights. I'm in this fight with #homecare workers – and the Americans who rely on their care – all the way. https://t.co/60KYQSAXbG", "date": "2019-05-06 16:15:26"}, "703": {"text": "Murder rates for Native women &amp; girls are horrifyingly high. This is a crisis. On National Day of Awareness for Missing and Murdered Indigenous Women and Girls, we renew our commitment to reauthorizing the Violence Against Women Act, &amp; ending this epidemic of violence. #MMIWG https://t.co/YBMB3Dhs8M", "date": "2019-05-05 16:50:24"}, "704": {"text": "My plan to #EndCorruptionNow would stop senior govt officials from leaving &amp; immediately getting paid by firms they gave contracts to. I’ll keep fighting to make that law. In the meantime, Kelly should try &amp; save what’s left of his reputation by resigning from Caliburn’s board. https://t.co/BMvNX4VqTN", "date": "2019-05-03 22:45:39"}, "705": {"text": "John Kelly oversaw many of the Trump Admin's most morally repugnant immigration policies. Now he could be making big bucks serving on the Board of a company that's profiting from the same cruel plans he put in place. This is corruption at its absolute worst. https://t.co/1rgpSew8gR", "date": "2019-05-03 22:45:37"}, "706": {"text": "Construction workers are some of the toughest people I know, but the back-breaking work means too many get hurt, become addicted to opioids &amp; die of overdoses. I'm grateful that the MA Building Trades are tackling this crisis. We're in this fight together. https://t.co/FE6BNi6E7n", "date": "2019-05-03 19:48:03"}, "707": {"text": "Congress may not have the courage yet to pass real gun reforms – but @GabbyGiffords has plenty of courage to spare. Grateful for @GiffordsCourage’s leadership and tireless efforts to #EndGunViolence, and to be with Gabby in this fight. We can do this, together. https://t.co/IxuTHXPIyz", "date": "2019-05-03 18:51:45"}, "708": {"text": "The FTC should investigate if hiding Free File is unfair &amp; deceptive, and if the companies colluded to rip off taxpayers. And IRS should end its agreements with them &amp; get refunds for taxpayers who paid for services because of these abuses. https://t.co/NgYXqQkk2K", "date": "2019-05-03 17:05:54"}, "709": {"text": "It gets worse: A @propublica report &amp; an investigation by my office found that nearly half of the IRS’s Free File companies hide the free option in online search results &amp; direct people to paid products instead. It’s unfair &amp; deceptive. https://t.co/MSeK6lfX7Z", "date": "2019-05-03 17:05:30"}, "710": {"text": "The IRS’s Free File program claims to provide free tax prep services to 70% of taxpayers. But only 3% of eligible taxpayers use it because the companies trick people into purchasing unnecessary products. (That’s why I’ve got a plan to overhaul it.) https://t.co/GTCm49wi7N", "date": "2019-05-03 17:04:57"}, "711": {"text": "The private firms that own &amp; operate military housing are cutting corners to make a profit on the homes of four-star generals. What do you think they’re doing to the homes of junior enlisted? That’s why @RepDebHaaland &amp; I have a plan to fix it. https://t.co/sk4p7JGjOw", "date": "2019-05-03 14:09:39"}, "712": {"text": "We must be vigilant about the threat of terrorism, but no one believes that there is a military-only solution in Afghanistan. We need an economic &amp; diplomatic plan with our allies for safety &amp; stability in the region. And it’s time to bring our troops home — now.", "date": "2019-05-02 20:40:33"}, "713": {"text": "The Trump administration owes it to the American people &amp; our service members to define what winning is in Afghanistan &amp; how we achieve that goal. The evidence is abundantly clear: this administration has no plan. https://t.co/lS7KmjJsCY", "date": "2019-05-02 20:39:58"}, "714": {"text": "Today I’m reintroducing the US Territorial Relief Act to give US territories like Puerto Rico a route to comprehensive debt relief &amp; a chance to get back on their feet. Our fellow US citizens are counting on us, &amp; we cannot forget them. https://t.co/woV6ibi2W3", "date": "2019-05-02 17:04:26"}, "715": {"text": "Now, post-Maria, Puerto Rico faces a much bigger crisis. Rebuilding efforts in Puerto Rico are still slow, &amp; the debt is a big reason why. Few investors want to put money into reconstruction if the debt means the island doesn’t have a realistic chance of recovering.", "date": "2019-05-02 17:03:52"}, "716": {"text": "Puerto Rico was in crisis long before Hurricanes Maria &amp; Irma tore through the island. For years, Puerto Rico has been at the mercy of Wall Street vulture funds that snapped up the island’s crushing debt to squeeze the Puerto Rican people for every penny they can get. https://t.co/AHCx44cOI3", "date": "2019-05-02 17:03:17"}, "717": {"text": "On Yom Hashoa, #WeRemember the 6 million Jews and millions of others who were murdered in the Holocaust. We honor their memories by speaking out and confronting anti-Semitism, bigotry, and hate – wherever we find it.", "date": "2019-05-02 13:28:37"}, "718": {"text": "Our military families deserve high-quality housing. I’ve introduced the Military Housing Oversight &amp; Service Member Protection Act to help fix the private housing program's shortcomings &amp; eliminate the corner-cutting &amp; neglect by providers. https://t.co/MjHb4eDjV1", "date": "2019-05-01 23:06:15"}, "719": {"text": "The failure of private housing companies to meet basic standards for military housing is unacceptable. My office conducted an investigation of the private housing program &amp; found a series of problems in the structure, administration, &amp; oversight. https://t.co/QsjmsnMkTr", "date": "2019-05-01 23:05:26"}, "720": {"text": "My friend @maziehirono always speaks truth to power. 🔥 Thanks to @JudiciaryDems for asking the tough questions. https://t.co/qZvgDx9gmF", "date": "2019-05-01 22:26:31"}, "721": {"text": "The Attorney General does not swear an oath of loyalty to any one individual. The AG swears an oath of loyalty to the Constitution of the United States. Barr has made clear that he doesn't swear his loyalty that way &amp; that disqualifies him from being AG. He should resign.", "date": "2019-05-01 18:27:31"}, "722": {"text": "Sending my best wishes to Rutland’s own Drew Pescaro &amp; all of the victims of the tragic shooting at UNC Charlotte yesterday. Stay strong, Drew. #drewstrong https://t.co/CmPShpSWZb", "date": "2019-05-01 13:54:03"}}